romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
/*
 * Academic License - for use in teaching, academic research, and meeting
 * course requirements at degree granting institutions only.  Not for
 * government, commercial, or other organizational use.
 * File: Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.c
 *
 * MATLAB Coder version            : 23.2
 * C/C++ source code generated on  : 17-Apr-2024 18:20:59
 */

/* Include Files */
#include "Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.h"
#include "BuildBitCnfg.h"
#include "CalcItByVout.h"
#include "CalcK.h"
#include "CalcPortSpiPrm.h"
#include "CalcStructKalman.h"
#include "Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229_data.h"
#include "Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229_emxutil.h"
#include "Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229_initialize.h"
#include "Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229_rtwutil.h"
#include "Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229_types.h"
#include "ControlKp184.h"
#include "Esp32StepSwitchToggleCombAll_ESP_48.h"
#include "InitKalman.h"
#include "ReadVI.h"
#include "abs.h"
#include "all.h"
#include "allOrAny.h"
#include "any.h"
#include "controlJuntekDPH8920.h"
#include "datetime.h"
#include "defineOutStruct.h"
#include "find.h"
#include "ifWhileCond.h"
#include "isequal.h"
#include "ismember.h"
#include "mean.h"
#include "minOrMax.h"
#include "mod.h"
#include "padArr.h"
#include "padArrUint8.h"
#include "pause.h"
#include "polyfit.h"
#include "rand.h"
#include "randn.h"
#include "readI2cVIfastTicTocV5_Rratio_ser.h"
#include "remPadArr.h"
#include "rt_nonfinite.h"
#include "sprintf.h"
#include "squeeze.h"
#include "sum.h"
#include "tic.h"
#include "toc.h"
#include "unique.h"
#include "writePortToSpi4RowMask_ser.h"
#include "rt_nonfinite.h"
#include <math.h>
#include <stdio.h>
#include <string.h>

/* Type Definitions */
#ifndef struct_emxArray_real_T_1x1
#define struct_emxArray_real_T_1x1

struct emxArray_real_T_1x1
{
  double data[1];
  int size[2];
};

#endif                                 /* struct_emxArray_real_T_1x1 */

#ifndef typedef_emxArray_real_T_1x1
#define typedef_emxArray_real_T_1x1

typedef struct emxArray_real_T_1x1 emxArray_real_T_1x1;

#endif                                 /* typedef_emxArray_real_T_1x1 */

/* Function Declarations */
static void binary_expand_op(double in1_data[], int in1_size[2], const
  emxArray_real_T *in2, const signed char in3_data[], const int in3_size[2]);
static void binary_expand_op_1(float in1_data[], const int in1_size[2], int in2,
  const double in3_data[], const int in3_size[2], const struct0_T *in4);
static void binary_expand_op_2(double in1_data[], int in1_size[2], const
  emxArray_real_T *in2, const struct0_T *in3, const int in4_data[], int in5, int
  in6);
static void binary_expand_op_3(emxArray_real_T *in1, const emxArray_real_T *in2,
  const double in3_data[], const signed char in4_data[], const int *in4_size,
  int in5);
static float rt_roundf_snf(float u);

/* Function Definitions */
/*
 * Arguments    : double in1_data[]
 *                int in1_size[2]
 *                const emxArray_real_T *in2
 *                const signed char in3_data[]
 *                const int in3_size[2]
 * Return Type  : void
 */
static void binary_expand_op(double in1_data[], int in1_size[2], const
  emxArray_real_T *in2, const signed char in3_data[], const int in3_size[2])
{
  const double *in2_data;
  int aux_0_1;
  int aux_1_1;
  int b_loop_ub;
  int i;
  int i1;
  int loop_ub;
  int stride_0_1;
  int stride_1_1;
  in2_data = in2->data;
  in1_size[0] = in2->size[0];
  if (in3_size[1] == 1) {
    loop_ub = in2->size[1];
  } else {
    loop_ub = in3_size[1];
  }

  in1_size[1] = loop_ub;
  stride_0_1 = (in2->size[1] != 1);
  stride_1_1 = (in3_size[1] != 1);
  aux_0_1 = 0;
  aux_1_1 = 0;
  for (i = 0; i < loop_ub; i++) {
    b_loop_ub = in2->size[0];
    for (i1 = 0; i1 < b_loop_ub; i1++) {
      in1_data[i1 + in1_size[0] * i] = in2_data[i1 + in2->size[0] * aux_0_1] *
        (double)in3_data[aux_1_1];
    }

    aux_1_1 += stride_1_1;
    aux_0_1 += stride_0_1;
  }
}

/*
 * Arguments    : float in1_data[]
 *                const int in1_size[2]
 *                int in2
 *                const double in3_data[]
 *                const int in3_size[2]
 *                const struct0_T *in4
 * Return Type  : void
 */
static void binary_expand_op_1(float in1_data[], const int in1_size[2], int in2,
  const double in3_data[], const int in3_size[2], const struct0_T *in4)
{
  int i;
  int loop_ub;
  int stride_0_1;
  stride_0_1 = (in3_size[1] != 1);
  loop_ub = in1_size[1];
  for (i = 0; i < loop_ub; i++) {
    in1_data[in2 + in1_size[0] * i] = (float)in3_data[in2 + in3_size[0] * (i *
      stride_0_1)] - in4->bat.Rint[in2 + (i << 1)];
  }
}

/*
 * Arguments    : double in1_data[]
 *                int in1_size[2]
 *                const emxArray_real_T *in2
 *                const struct0_T *in3
 *                const int in4_data[]
 *                int in5
 *                int in6
 * Return Type  : void
 */
static void binary_expand_op_2(double in1_data[], int in1_size[2], const
  emxArray_real_T *in2, const struct0_T *in3, const int in4_data[], int in5, int
  in6)
{
  const double *in2_data;
  int aux_0_1;
  int aux_1_1;
  int b_loop_ub;
  int i;
  int i1;
  int in4;
  int loop_ub;
  int stride_0_1;
  int stride_1_1;
  in2_data = in2->data;
  in4 = in4_data[in5];
  in1_size[0] = in2->size[0];
  if (in6 + 1 == 1) {
    loop_ub = in2->size[1];
  } else {
    loop_ub = in6 + 1;
  }

  in1_size[1] = loop_ub;
  stride_0_1 = (in2->size[1] != 1);
  stride_1_1 = (in6 + 1 != 1);
  aux_0_1 = 0;
  aux_1_1 = 0;
  for (i = 0; i < loop_ub; i++) {
    b_loop_ub = in2->size[0];
    for (i1 = 0; i1 < b_loop_ub; i1++) {
      in1_data[i1 + in1_size[0] * i] = in2_data[i1 + in2->size[0] * aux_0_1] *
        (double)in3->seq.tst.i.NegIflag[(in4 + (aux_1_1 << 3)) - 1];
    }

    aux_1_1 += stride_1_1;
    aux_0_1 += stride_0_1;
  }
}

/*
 * Arguments    : emxArray_real_T *in1
 *                const emxArray_real_T *in2
 *                const double in3_data[]
 *                const signed char in4_data[]
 *                const int *in4_size
 *                int in5
 * Return Type  : void
 */
static void binary_expand_op_3(emxArray_real_T *in1, const emxArray_real_T *in2,
  const double in3_data[], const signed char in4_data[], const int *in4_size,
  int in5)
{
  const double *in2_data;
  double *in1_data;
  int i;
  int loop_ub;
  int stride_0_0;
  int stride_1_0;
  in2_data = in2->data;
  if (*in4_size == 1) {
    loop_ub = in2->size[1];
  } else {
    loop_ub = *in4_size;
  }

  i = in1->size[0];
  in1->size[0] = loop_ub;
  emxEnsureCapacity_real_T(in1, i);
  in1_data = in1->data;
  stride_0_0 = (in2->size[1] != 1);
  stride_1_0 = (*in4_size != 1);
  for (i = 0; i < loop_ub; i++) {
    in1_data[i] = in2_data[i * stride_0_0] + (in3_data[in4_data[i * stride_1_0]]
      - 1.0) * (double)in5;
  }
}

