romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
/*
 * Arguments    : float u
 * Return Type  : float
 */
static float rt_roundf_snf(float u)
{
  float y;
  if ((float)fabs(u) < 8.388608E+6F) {
    if (u >= 0.5F) {
      y = (float)floor(u + 0.5F);
    } else if (u > -0.5F) {
      y = u * 0.0F;
    } else {
      y = (float)ceil(u - 0.5F);
    }
  } else {
    y = u;
  }

  return y;
}

/*
 * const
 *
 * Arguments    : struct0_T *prm
 *                struct30_T *outStruct
 * Return Type  : void
 */
void Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229(struct0_T *prm, struct30_T
  *outStruct)
{
  static unsigned char bitCnfg_data[32768];
  static unsigned char c_y_data[32767];
  static signed char j_tmp_data[32767];
  emxArray_boolean_T b_AllBypassPerGroup_data;
  emxArray_boolean_T b_SelDual_nm1_data;
  emxArray_boolean_T c_SelDual_nm1_data;
  emxArray_boolean_T d_SelDual_nm1_data;
  emxArray_boolean_T e_SelDual_nm1_data;
  emxArray_boolean_T *b_changeConfigFlag;
  emxArray_boolean_T *changeConfigFlag;
  emxArray_boolean_T *switchFlag;
  emxArray_boolean_T *switchFlagHelp;
  emxArray_boolean_T *x;
  emxArray_char_T *IchargeAct;
  emxArray_char_T *Vcharge0;
  emxArray_char_T *b_IchargeAct;
  emxArray_char_T *b_IshuntTest2;
  emxArray_char_T *b_VbusTest2;
  emxArray_char_T *b_VbusTest_data;
  emxArray_char_T *b_Vcharge0;
  emxArray_char_T *b_VmKp184Test_data;
  emxArray_char_T *b_k_Ttest;
  emxArray_char_T *b_k_bat;
  emxArray_char_T *b_prm;
  emxArray_char_T *b_vSumMax;
  emxArray_char_T *c_IchargeAct;
  emxArray_char_T *c_Vcharge0;
  emxArray_char_T *c_prm;
  emxArray_char_T *d_IchargeAct;
  emxArray_char_T *d_Vcharge0;
  emxArray_char_T *d_prm;
  emxArray_char_T *dv0;
  emxArray_char_T *e_IchargeAct;
  emxArray_char_T *f_IchargeAct;
  emxArray_char_T *k_Ttest;
  emxArray_char_T *k_bat;
  emxArray_char_T *meanIbrd0;
  emxArray_char_T *r10;
  emxArray_char_T *r11;
  emxArray_char_T *r12;
  emxArray_char_T *r13;
  emxArray_char_T *r14;
  emxArray_char_T *r15;
  emxArray_char_T *r16;
  emxArray_char_T *r17;
  emxArray_char_T *r18;
  emxArray_char_T *r19;
  emxArray_char_T *r20;
  emxArray_char_T *r21;
  emxArray_char_T *r22;
  emxArray_char_T *r23;
  emxArray_char_T *r24;
  emxArray_char_T *r25;
  emxArray_char_T *r26;
  emxArray_char_T *r27;
  emxArray_char_T *r28;
  emxArray_char_T *r29;
  emxArray_char_T *r4;
  emxArray_char_T *r5;
  emxArray_char_T *r6;
  emxArray_char_T *r7;
  emxArray_char_T *r8;
  emxArray_char_T *r9;
  emxArray_char_T *vSumMax;
  emxArray_int8_T *b_Vbat;
  emxArray_int8_T *c_Vbat;
  emxArray_real_T c_BattConfigPerInaHelp_data;
  emxArray_real_T d_BattConfigPerInaHelp_data;
  emxArray_real_T *Iacs758_cal;
  emxArray_real_T *IbatMat;
  emxArray_real_T *Ibrd;
  emxArray_real_T *ImKp184Test2;
  emxArray_real_T *IshuntTest2;
  emxArray_real_T *Ishunt_cal_bat_00;
  emxArray_real_T *SelDual;
  emxArray_real_T *SelDualHelp;
  emxArray_real_T *SelDual_nm1;
  emxArray_real_T *Vbat;
  emxArray_real_T *VbatMat;
  emxArray_real_T *VbatMat0;
  emxArray_real_T *VbitInsMeas;
  emxArray_real_T *Vbrd;
  emxArray_real_T *VbusTest2;
  emxArray_real_T *Vbus_cal_bat_00;
  emxArray_real_T *b_y;
  emxArray_real_T *indVperGrp;
  emxArray_real_T *meanIbrd;
  emxArray_real_T *r;
  emxArray_real_T *r1;
  emxArray_real_T *tLastToggle;
  emxArray_real_T *tV;
  emxArray_real_T *tV1;
  emxArray_real_T *y;
  emxArray_real_T_1x1 r30;
  emxArray_uint8_T c_bitCnfg_data;
  emxArray_uint8_T d_bitCnfg_data;
  emxArray_uint8_T e_bitCnfg_data;
  emxArray_uint8_T *r2;
  emxArray_uint8_T *r3;
  creal_T t2_data;
  double b_IshuntTest2_data[4080];
  double ImKp184Test2_bat_00_data[2048];
  double BattConfigPerInaHelp_data[512];
  double BattConfigPerIna_data[512];
  double n_tmp_data[512];
  double Vdebug_data[256];
  double VmV_data[256];
  double b_BattConfigPerInaHelp_data[256];
  double b_VbusTest2_data[256];
  double VdebugVec_data[64];
  double kEst_data[64];
  double Rtot_data[32];
  double VbusTest_data[32];
  double VmKp184Test_data[32];
  double a__38_data[32];
  double a__39_data[32];
  double a__40_data[32];
  double a__42_data[32];
  double a__72_data[32];
  double b_VdebugVec_data[32];
  double I_data[16];
  double b_VmV_data[16];
  double c_VmKp184Test_data[16];
  double tvv_data[16];
  double a__1_data[8];
  double dateVec[6];
  double VecIna219_data[2];
  double b_k_t0[2];
  double o_tmp_data[2];
  double outVI[2];
  double N0;
  double Nina219_tmp_tmp;
  double V_dis_all;
  double a__16_data;
  double a__4_data;
  double b_dv0;
  double b_meanIbrd0;
  double d;
  double d_tmp_data;
  double g_IchargeAct;
  double k_t;
  double toc00;
  double *Iacs758_cal_data;
  double *ImKp184Test2_data;
  double *IshuntTest2_data;
  double *SelDualHelp_data;
  double *SelDual_data;
  double *VbatMat0_data;
  double *VbatMat_data;
  double *VbusTest2_data;
  double *b_y_data;
  double *tLastToggle_data;
  double *tV1_data;
  double *tV_data;
  double *y_data;
  float varargin_1[1024];
  float f_prm[496];
  float pIacs758_data[64];
  float h_prm[38];
  float Rwire_data[32];
  float a__64_data[32];
  float fv[31];
  float a__36_data[16];
  float e_prm[16];
  float i_prm[2];
  float Icharge;
  float IchargePhase2_tmp_tmp;
  float IchargePhase2t;
  float IchargePhase3;
  float ImaxAcDC;
  float ImaxChrB2B;
  float ImaxDis;
  float Ta;
  float c_vSumMax;
  float e_Vcharge0;
  float f;
  float juntekEfficencyFactor;
  int indVperGrp_data[16];
  int Ibrd_size[4];
  int IshuntTest2_size[4];
  int VbusTest2_size[4];
  int BattConfigPerInaHelp_size[3];
  int Pac2Vid0All_size[3];
  int VdebugVec_size[3];
  int b_VdebugVec_size[3];
  int bitCnfg_size[3];
  int c_tmp_size[3];
  int kEst_size[3];
  int pIacs758_size[3];
  int AllBypassPerGroup_size[2];
  int I_size[2];
  int IbatMat_size[2];
  int ImKp184Test2_bat_00_size[2];
  int Nina219[2];
  int Rtot_size[2];
  int Rwire_size[2];
  int SelDual_nm1_size[2];
  int Vdebug_size[2];
  int VmKp184Test_size[2];
  int VmV_size[2];
  int a__1_size[2];
  int a__3_size[2];
  int a__4_size[2];
  int b_Rwire_size[2];
  int b_VmV_size[2];
  int b_tmp_size[2];
  int d_tmp_size[2];
  int e_tmp_size[2];
  int errI2C_size[2];
  int f_tmp_size[2];
  int id2Bypass_data[2];
  int ipos_data[2];
  int tLastToggle_size[2];
  int tii_size[2];
  int tmp_size[2];
  int tvv_size[2];
  int N_bat_tmp_tmp_tmp;
  int VbusTest_size_idx_0;
  int VdebugVec_size_tmp;
  int VmKp184Test_size_idx_0;
  int VmKp184Test_size_idx_1;
  int b_end;
  int b_loop_ub;
  int b_loop_ub_tmp;
  int b_size;
  int b_trueCount;
  int c_end;
  int c_loop_ub;
  int c_loop_ub_tmp;
  int d_loop_ub;
  int e_loop_ub;
  int end;
  int end_tmp;
  int i;
  int i1;
  int i2;
  int i3;
  int id2Bypass_size;
  int ipos_size;
  int k0;
  int k1;
  int k_ina219_;
  int k_t0;
  int k_tstState;
  int loop_ub;
  int loop_ub_tmp;
  int partialTrueCount;
  int state_k;
  int trueCount;
  short b_data[2];
  short prm_data[2];
  short N_bat1;
  short N_bitCnfg;
  short i4;
  unsigned short size_tmp_idx_1;
  char bitCnfgStr_data[4096];
  unsigned char Pac2Vid0All_data[512];
  unsigned char Pac2Vid0[256];
  unsigned char b_bitCnfg_data[256];
  unsigned char i_tmp_data[256];
  unsigned char id0_data[256];
  unsigned char l_tmp_data[256];
  unsigned char m_tmp_data[256];
  signed char g_tmp_data[255];
  signed char h_tmp_data[255];
  unsigned char SpiPortRowBypass[24];
  unsigned char disConAll[24];
  signed char g_prm[16];
  signed char iv[8];
  unsigned char N_bat[2];
  signed char b_tmp_data[2];
  signed char c_tmp_data[2];
  signed char e_tmp_data[2];
  signed char f_tmp_data[2];
  signed char k_tmp_data[2];
  signed char p_tmp_data[2];
  signed char q_tmp_data[2];
  signed char r_tmp_data[2];
  signed char s_tmp_data[2];
  signed char t_tmp_data[2];
  signed char tmp_data[2];
  signed char Iacs758Flag;
  unsigned char NstTst_tmp_tmp;
  signed char ProjectFlag;
  signed char k_groups_tmp;
  signed char *Vbat_data;
  unsigned char *r31;
  boolean_T VbusTest0_data[256];
  boolean_T ismember0_data[255];
  boolean_T BattConfigAct_data[32];
  boolean_T c_VbusTest_data[32];
  boolean_T AllBypassPerGroup_data[2];
  boolean_T SelDual_nm1_data[2];
  boolean_T b_VecIna219_data[2];
  boolean_T b_guard1;
  boolean_T exitg1;
  boolean_T exitg2;
  boolean_T guard1;
  boolean_T guard2;
  boolean_T guard3;
  boolean_T guard4;
  boolean_T guard5;
  boolean_T kalmanFlag;
  boolean_T keepMeas;
  boolean_T newState;
  boolean_T onPowerFlag;
  boolean_T showVdiff;
  boolean_T *b_changeConfigFlag_data;
  boolean_T *changeConfigFlag_data;
  boolean_T *switchFlagHelp_data;
  boolean_T *switchFlag_data;
  if (!isInitialized_Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229) {
    Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229_initialize();
  }

  /* int16(32); */
  /*  NstrColMax= 256; */
  outStruct->VpassFlag = defineOutStruct(prm->Nmax.NbrdMax, prm->Nmax.NbatMax,
    outStruct->VbusTest, outStruct->VmKp184Test, &outStruct->VresetFlag,
    &outStruct->Rint);

  /*  []; */
  /*  init */
  ProjectFlag = prm->ins.ProjectFlag;

