romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
  /*  disconnect All */
  CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                 prm->brd.spi.PortSpiRow_esp, prm->brd.spi.SwitchMat_esp,
                 prm->brd.spi.PortSpiRow_esp2, prm->brd.spi.SwitchMat_esp2,
                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                 prm->brd.spi.disconnect, disConAll, a__1_data, a__1_size,
                 id0_data);
  Nina219_tmp_tmp = prm->brd.Nina219;

  /* length(Esp32_v1); */
  pause(1.0);

  /* repmat(prm.struct.KalmanStruct,Nina219);%nadav Coder */
  VbusTest_size_idx_0 = (int)prm->brd.Nina219;
  for (k_ina219_ = 0; k_ina219_ < VbusTest_size_idx_0; k_ina219_++) {
    /*      [disConAll,~,~] = CalcPortSpiPrm(prm.brd.spi,prm.brd.spi.disconnect); */
    switch (ProjectFlag) {
     case 2:
      /* esp32 */
      break;

     case 3:
      /* esp32 ser */
      /*  writePortToSpi4RowMask_ser(disConAll,Esp32_v1(k_ina219),false); */
      writePortToSpi4RowMask_ser(disConAll);
      break;
    }
  }

  N_bat_tmp_tmp_tmp = prm->brd.N_bat;
  N_bat1 = prm->brd.N_bat1;

  /*  juntek_Flag        = prm.ins.juntek; */
  /*  juntekOnlyChr_Flag = prm.ins.juntekOnlyChr_Flag; */
  /*  OnlyDis_Flag       = prm.ins.OnlyDis_Flag; */
  /*  CalibrateBaordFlag = prm.ins.CalibrateBaordFlag; */
  /*  PwSwFalg           = prm.ins.PwSwFalg; */
  /*  SwitchMat_esp   = prm.brd.spi.SwitchMat_esp; */
  /*  SwitchMat_esp2  = prm.brd.spi.SwitchMat_esp2; */
  /*  PortSpiRow_esp  = prm.brd.spi.PortSpiRow_esp; */
  /*  PortSpiRow_esp2 = prm.brd.spi.PortSpiRow_esp2; */
  /*  Pac2Vid         = prm.brd.spi.Pac2Vid; */
  /*  Pac2Vid2        = prm.brd.spi.Pac2Vid2; */
  kalmanFlag = prm->klm.kalmanFlag;
  Ta = prm->klm.Ta;
  Iacs758Flag = prm->brd.pac.Iacs758Flag;

  /*  seq             = prm.seq(prm.run.seq); */
  /*  vTestFlag       = seq.tst.v; */
  /*  ITestFlag       = seq.tst.i; */
  ImaxAcDC = prm->ins.prm.jun.ImaxAcDC;

  /* 15;%35;%maximum c ACDC current [A] */
  pIacs758_size[0] = 2;
  pIacs758_size[1] = 1;
  pIacs758_size[2] = 2;
  pIacs758_data[0] = prm->brd.pac.pIacs758[0];
  pIacs758_data[1] = prm->brd.pac.pIacs758[1];
  pIacs758_data[2] = prm->brd.pac.pIacs758[2];
  pIacs758_data[3] = prm->brd.pac.pIacs758[3];
  if (prm->brd.useRwireFlag) {
    Rwire_size[0] = 2;
    Rwire_size[1] = 16;
    memcpy(&Rwire_data[0], &prm->brd.Rwire[0], 32U * sizeof(float));
  } else {
    Rwire_size[0] = (int)prm->brd.Nina219;
    Rwire_size[1] = prm->brd.N_bat;
    loop_ub = (int)prm->brd.Nina219 * prm->brd.N_bat;
    if (loop_ub - 1 >= 0) {
      memset(&Rwire_data[0], 0, (unsigned int)loop_ub * sizeof(float));
    }
  }

  juntekEfficencyFactor = prm->ins.prm.jun.juntekEfficencyFactor;

  /* 0.85; */
  trueCount = 0;
  if (prm->ser.com.grp[0] > 0) {
    trueCount = 1;
  }

  if (prm->ser.com.grp[1] > 0) {
    trueCount++;
  }

  partialTrueCount = 0;
  if (prm->ser.com.grp[0] > 0) {
    tmp_data[0] = 0;
    partialTrueCount = 1;
  }

  if (prm->ser.com.grp[1] > 0) {
    tmp_data[partialTrueCount] = 1;
  }

  end_tmp = trueCount - 1;
  trueCount = 0;
  partialTrueCount = 0;
  for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
    i = prm->ser.com.grp[tmp_data[loop_ub]];
    if (i > 0) {
      trueCount++;
      b_tmp_data[partialTrueCount] = (signed char)loop_ub;
      partialTrueCount++;
    }
  }

  for (i = 0; i < trueCount; i++) {
    prm_data[i] = prm->ser.com.grp[tmp_data[b_tmp_data[i]]];
  }

  b_size = unique_vector(prm_data, trueCount, b_data, id2Bypass_data,
    &id2Bypass_size, ipos_data, &ipos_size);
  loop_ub_tmp = (int)prm->brd.Nina219 * prm->brd.N_bat;
  VmKp184Test_size_idx_0 = (int)prm->brd.Nina219;
  VmKp184Test_size_idx_1 = prm->brd.N_bat;

  /*  if juntek_Flag */
  /*  %     [s_juntek] = Init_juntekDPH8920(COM_juntek); */
  /*      vTestFlag = false; */
  /*      ImaxAcDC = prm.ins.jun.ImaxAcDC;%15;%35;%maximum c ACDC current [A] */
  /*      ITestFlag = false; */
  /*      prm.brd.pac.pIacs758 = pIacs758; */
  /*      prm.brd.pac.Rval     = Rval; */
  /*      if PwSwFalg */
  /*          [s_PwrSw] = Init_PwrSw(prm.ser.com.COM_PwrSw); */
  /*      end */
  /*      s_PwrSw = prm.ser.s_PwrSw; */
  /*      if juntekOnlyChr_Flag */
  /*          AcDcFlag = true; */
  /*      else */
  /*          AcDcFlag = false; */
  /*      end */
  /*  elseif ~OnlyDis_Flag */
  /*      s_kp184 = prm.ser.s_kp184; */
  /*      s_ka6005p = prm.ser.s_ka6005p; */
  /*      vTestFlag = true; */
  /*      ITestFlag = true; */
  /*      Rval     = prm.brd.pac.Rval; */
  /*      pIacs758 = prm.brd.pac.pIacs758; */
  /*  elseif OnlyDis_Flag */
  /*      vTestFlag = false; */
  /*      ITestFlag = false; */
  /*      Rval     = prm.brd.pac.Rval; */
  /*      pIacs758 = prm.brd.pac.pIacs758; */
  /*  end */
  /* init parameters */
  /* true;%false;%true; */
  /* 60;%sec FIX (ORG 60) */
  /* [1:Nbat]';%ORG([1:N_bat-NtoggleDrop]');%[1:N_bat]';%[1 ; 2 ; 3 ; 4]; */
  /* [1:N_bat-NtoggleDrop]';%[1:N_bat]';%[1 ; 2 ; 3 ; 4];%[1 , 2 , 3 , 4]; */
  /* [1:N_bat-NtoggleDrop]';%[1:N_bat]';%[1 ; 2 ; 3 ; 4]; */
  /* [1:N_bat]';%[1 ; 2 ; 3 ; 4]; */
  /*  */
  /*  for k_ina219 = 1:Nina219 %Dis Configuration */
  /*      BattConfigDis{k_ina219,1} = BattConfigDis1 + (k_ina219-1)*N_bat;%Serial */
  /*      BattConfigDisPerIna{k_ina219,1} = BattConfigDis1; */
  /*  end */
  /*  for k_ina219 = 1:Nina219 %Chr Configuration */
  /*      BattConfigChr{k_ina219,1} = BattConfigChr1 + (k_ina219-1)*N_bat;%Parallel */
  /*      BattConfigChrPerIna{k_ina219,1} = BattConfigChr1; */
  /*  end */
  /*  for k_ina219 = 1:Nina219 */
  /*      BattConfigAct{k_ina219,1} = true(N_bat,1); */
  /*  end */
  for (i = 0; i < loop_ub_tmp; i++) {
    VbusTest_data[i] = 0.0;
    VmKp184Test_data[i] = 0.0;
    BattConfigAct_data[i] = true;
  }

  pause(1.0);

  /* sum(seqTstV.grp>0); */
  outStruct->VpassFlag = true;
  outStruct->VresetFlag = true;
  emxInit_real_T(&VbusTest2, 4);
  emxInit_real_T(&IshuntTest2, 4);
  emxInit_real_T(&ImKp184Test2, 4);
  emxInit_real_T(&Iacs758_cal, 4);
  emxInit_real_T(&Vbrd, 5);
  emxInit_real_T(&Ibrd, 5);
  emxInit_real_T(&meanIbrd, 4);
  emxInit_real_T(&VbitInsMeas, 4);
  emxInit_real_T(&Vbat, 2);
  emxInit_real_T(&IbatMat, 3);
  emxInit_real_T(&VbatMat, 3);
  emxInit_real_T(&VbatMat0, 3);
  emxInit_real_T(&tV1, 2);
  emxInit_real_T(&tV, 3);
  emxInit_real_T(&SelDual, 2);
  emxInit_real_T(&SelDualHelp, 2);
  emxInit_real_T(&tLastToggle, 2);
  emxInit_boolean_T(&switchFlag);
  emxInit_boolean_T(&switchFlagHelp);
  emxInit_boolean_T(&changeConfigFlag);
  emxInit_real_T(&SelDual_nm1, 2);
  emxInit_real_T(&Ishunt_cal_bat_00, 2);
  emxInit_real_T(&Vbus_cal_bat_00, 2);
  emxInit_real_T(&r, 2);
  emxInit_real_T(&indVperGrp, 1);
  emxInit_int8_T(&b_Vbat);
  emxInit_int8_T(&c_Vbat);
  emxInit_real_T(&y, 2);
  y_data = y->data;
  emxInit_boolean_T(&x);
  emxInit_real_T(&r1, 2);
  emxInit_real_T(&b_y, 1);
  emxInit_uint8_T(&r2, 3);
  emxInit_boolean_T(&b_changeConfigFlag);
  emxInit_uint8_T(&r3, 2);
  emxInit_char_T(&r4);
  emxInit_char_T(&r5);
  emxInit_char_T(&k_bat);
  emxInit_char_T(&b_VbusTest_data);
  emxInit_char_T(&r6);
  emxInit_char_T(&b_k_bat);
  emxInit_char_T(&b_VmKp184Test_data);
  emxInit_char_T(&vSumMax);
  emxInit_char_T(&r7);
  emxInit_char_T(&b_prm);
  emxInit_char_T(&r8);
  emxInit_char_T(&r9);
  emxInit_char_T(&c_prm);
  emxInit_char_T(&r10);
  emxInit_char_T(&r11);
  emxInit_char_T(&k_Ttest);
  emxInit_char_T(&b_vSumMax);
  emxInit_char_T(&b_VbusTest2);
  emxInit_char_T(&d_prm);
  emxInit_char_T(&b_k_Ttest);
  emxInit_char_T(&b_IshuntTest2);
  emxInit_char_T(&r12);
  emxInit_char_T(&r13);
  emxInit_char_T(&meanIbrd0);
  emxInit_char_T(&r14);
  emxInit_char_T(&r15);
  emxInit_char_T(&r16);
  emxInit_char_T(&dv0);
  emxInit_char_T(&r17);
  emxInit_char_T(&r18);
  emxInit_char_T(&Vcharge0);
  emxInit_char_T(&b_Vcharge0);
  emxInit_char_T(&r19);
  emxInit_char_T(&IchargeAct);
  emxInit_char_T(&b_IchargeAct);
  emxInit_char_T(&r20);
  emxInit_char_T(&r21);
  emxInit_char_T(&r22);
  emxInit_char_T(&r23);
  emxInit_char_T(&r24);
  emxInit_char_T(&c_IchargeAct);
  emxInit_char_T(&d_IchargeAct);
  emxInit_char_T(&e_IchargeAct);
  emxInit_char_T(&r25);
  emxInit_char_T(&f_IchargeAct);
  emxInit_char_T(&r26);
  emxInit_char_T(&r27);
  emxInit_char_T(&c_Vcharge0);
  emxInit_char_T(&r28);
  emxInit_char_T(&d_Vcharge0);
  emxInit_char_T(&r29);
  guard1 = false;
  guard2 = false;
  guard3 = false;
  guard4 = false;
  if (prm->seq.tst.v.isTest) {
    tic();

    /*  NTtest = 2; */
    /*  if prm.ins.swm */
    /*      Control_SwChDisLoad(prm.ser.s_swm,seqTstV.swm); */
    /*  end */
    VdebugVec_size[0] = (int)prm->brd.Nina219;
    VdebugVec_size_tmp = prm->brd.N_bat;
    b_loop_ub_tmp = loop_ub_tmp << 1;
    if (b_loop_ub_tmp - 1 >= 0) {
      memset(&VdebugVec_data[0], 0, (unsigned int)b_loop_ub_tmp * sizeof(double));
    }

    if (prm->brd.Nina219 < 1.0) {
      y->size[0] = 1;
      y->size[1] = 0;
    } else {
      i = y->size[0] * y->size[1];
      y->size[0] = 1;
      y->size[1] = (int)(prm->brd.Nina219 - 1.0) + 1;
      emxEnsureCapacity_real_T(y, i);
      y_data = y->data;
      loop_ub = (int)(prm->brd.Nina219 - 1.0);
      for (i = 0; i <= loop_ub; i++) {
        y_data[i] = (double)i + 1.0;
      }
    }

    i = b_y->size[0];
    b_y->size[0] = y->size[1];
    emxEnsureCapacity_real_T(b_y, i);
    b_y_data = b_y->data;
    loop_ub = y->size[1];
    for (i = 0; i < loop_ub; i++) {
      b_y_data[i] = y_data[i];
    }

    loop_ub = y->size[1];
    for (i = 0; i < loop_ub; i++) {
      VecIna219_data[i] = b_y_data[i];
    }

    kEst_size[0] = (int)prm->brd.Nina219;
    if (b_loop_ub_tmp - 1 >= 0) {
      memset(&kEst_data[0], 0, (unsigned int)b_loop_ub_tmp * sizeof(double));
    }

