romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
    /*  [~,~,~,~]          = ControlKp184(s_kp184,'Read',[]); */
    i = prm->seq.tst.v.Nst;
    for (k_tstState = 0; k_tstState < i; k_tstState++) {
      pause(0.1);

      /* 1:length(uGroups) */
      id2Bypass_size = ipos_size - 1;
      trueCount = 0;
      partialTrueCount = 0;

      /* VecIna219_k = find(k_groups == uGroupId); */
      b_trueCount = 0;
      for (loop_ub = 0; loop_ub <= id2Bypass_size; loop_ub++) {
        k_groups_tmp = prm->seq.tst.v.grp[k_tstState];
        i1 = ipos_data[loop_ub];
        if (k_groups_tmp == i1) {
          trueCount++;
          c_tmp_data[partialTrueCount] = (signed char)loop_ub;
          partialTrueCount++;
        }

        if (k_groups_tmp != i1) {
          b_trueCount++;
        }
      }

      for (k0 = 0; k0 < b_trueCount; k0++) {
        /* k_ina219not = VecIna219_notk %diconnect group that not tested */
        switch (ProjectFlag) {
         case 2:
          /* ESP32 */
          break;

         case 3:
          /* ESP32 ser */
          writePortToSpi4RowMask_ser(disConAll);
          break;
        }

        pause(0.1);
      }

      if (trueCount - 1 >= 0) {
        b_loop_ub = trueCount;
        i2 = N_bat_tmp_tmp_tmp;
        if (N_bat_tmp_tmp_tmp < 1) {
          size_tmp_idx_1 = 0U;
          y->size[0] = 1;
          y->size[1] = 0;
        } else {
          size_tmp_idx_1 = (unsigned short)N_bat_tmp_tmp_tmp;
          i1 = y->size[0] * y->size[1];
          y->size[0] = 1;
          y->size[1] = N_bat_tmp_tmp_tmp;
          emxEnsureCapacity_real_T(y, i1);
          y_data = y->data;
          loop_ub = N_bat_tmp_tmp_tmp - 1;
          for (i1 = 0; i1 <= loop_ub; i1++) {
            y_data[i1] = (double)i1 + 1.0;
          }
        }

        c_loop_ub = size_tmp_idx_1;
        i1 = (int)rt_roundd_snf((double)N_bat_tmp_tmp_tmp / 2.0 + 1.0);
        if (i1 < 256) {
          if (i1 >= 0) {
            NstTst_tmp_tmp = (unsigned char)i1;
          } else {
            NstTst_tmp_tmp = 0U;
          }
        } else {
          NstTst_tmp_tmp = MAX_uint8_T;
        }

        N_bat[0] = NstTst_tmp_tmp;
        i1 = N_bat_tmp_tmp_tmp;
        if (N_bat_tmp_tmp_tmp < 0) {
          i1 = 0;
        } else if (N_bat_tmp_tmp_tmp > 255) {
          i1 = 255;
        }

        N_bat[1] = (unsigned char)i1;
      }

      for (k0 = 0; k0 < trueCount; k0++) {
        /* k_ina219 = VecIna219_k */
        b_meanIbrd0 = VecIna219_data[c_tmp_data[k0]];
        for (i1 = 0; i1 < b_loop_ub; i1++) {
          b_VecIna219_data[i1] = (VecIna219_data[c_tmp_data[i1]] != b_meanIbrd0);
        }

        id2Bypass_size = c_eml_find(b_VecIna219_data, trueCount, id2Bypass_data);
        if (id2Bypass_size - 1 >= 0) {
          CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                         prm->brd.spi.PortSpiRow_esp, prm->brd.spi.SwitchMat_esp,
                         prm->brd.spi.PortSpiRow_esp2,
                         prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                         prm->brd.spi.Pac2Vid2, prm->brd.spi.bypass,
                         SpiPortRowBypass, a__1_data, a__1_size, id0_data);
        }

        for (k1 = 0; k1 < id2Bypass_size; k1++) {
          /* k_bypass = VecIna219_k(id2Bypass) */
          /*  ina219StateAll(:,k_bypass)   = ina219StateBypass; */
          /*  BattConfig{k_bypass}       = prm.brd.spi.bypass;%-2; */
          /*  BattConfigPerIna{k_bypass} = prm.brd.spi.bypass;%-2; */
          d_tmp_data = VecIna219_data[c_tmp_data[id2Bypass_data[k1] - 1]];
          if (d_tmp_data < 2.147483648E+9) {
            i1 = (int)d_tmp_data;
          } else {
            i1 = MAX_int32_T;
          }

          b_sprintf(i1, r4);
          switch (ProjectFlag) {
           case 0:
            /* ina219 */
            break;

           case 1:
            /* EVBOTS_v1 */
            break;

           case 2:
            /* ESP32 */
            break;

           case 3:
            /* ESP32 ser */
            writePortToSpi4RowMask_ser(SpiPortRowBypass);
            break;
          }

          pause(0.1);
        }

        /*  for k_bypass = VecIna219(id2Bypass) */
        if (i2 - 1 >= 0) {
          if (b_meanIbrd0 < 2.147483648E+9) {
            i3 = (int)b_meanIbrd0;
            c_loop_ub_tmp = (int)b_meanIbrd0;
          } else {
            i3 = MAX_int32_T;
            c_loop_ub_tmp = MAX_int32_T;
          }
        }

        for (b_loop_ub_tmp = 0; b_loop_ub_tmp < i2; b_loop_ub_tmp++) {
          if (b_loop_ub_tmp + 1 < 256) {
            NstTst_tmp_tmp = (unsigned char)((double)b_loop_ub_tmp + 1.0);
          } else {
            NstTst_tmp_tmp = MAX_uint8_T;
          }

          padArrUint8(NstTst_tmp_tmp, prm->Nmax.NbatMax, prm->Nmax.NbatMax, r3);
          b_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                           prm->brd.spi.PortSpiRow_esp,
                           prm->brd.spi.SwitchMat_esp,
                           prm->brd.spi.PortSpiRow_esp2,
                           prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                           prm->brd.spi.Pac2Vid2, r3, SpiPortRowBypass,
                           a__1_data, a__1_size, id0_data);

          /*                  ina219State = findSwitch(SwitchCell,k_bat);%8+(k_bat-1); */
          /*  BattConfig{k_ina219}       = k_bat + (k_ina219-1)*N_bat; */
          /*  BattConfigPerIna{k_ina219} = k_bat; */
          /*  ina219StateAll(:,k_ina219)   = ina219State; */
          b_sprintf(i3, r5);
          partialTrueCount = a__1_size[0];
          if (partialTrueCount < 1) {
            partialTrueCount = 1;
          }

          if (a__1_size[0] == 0) {
            k_ina219_ = 0;
          } else {
            k_ina219_ = partialTrueCount;
          }

          for (id2Bypass_size = 0; id2Bypass_size < k_ina219_; id2Bypass_size++)
          {
            d_tmp_data = rt_roundd_snf(a__1_data[id2Bypass_size]);
            if (d_tmp_data < 2.147483648E+9) {
              if (d_tmp_data >= -2.147483648E+9) {
                i1 = (int)d_tmp_data;
              } else {
                i1 = MIN_int32_T;
              }
            } else if (d_tmp_data >= 2.147483648E+9) {
              i1 = MAX_int32_T;
            } else {
              i1 = 0;
            }

