romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
            printf("%d \n", i1);
            fflush(stdout);
          }

          switch (ProjectFlag) {
           case 2:
            /* ESP32 */
            break;

           case 3:
            /* ESP32 ser */
            writePortToSpi4RowMask_ser(SpiPortRowBypass);
            break;
          }

          pause(0.5);
          switch (ProjectFlag) {
           case 2:
            /* ESP32 */
            memset(&VmV_data[0], 0, 16U * sizeof(double));
            Vdebug_size[0] = 16;
            Vdebug_size[1] = 2;
            memset(&Vdebug_data[0], 0, 32U * sizeof(double));

            /*  */
            break;

           case 3:
            /* ESP32 ser */
            for (i1 = 0; i1 < 16; i1++) {
              g_prm[i1] = prm->brd.pac.VIpacId[((int)b_meanIbrd0 + (i1 << 1)) -
                1];
            }

            c_readI2cVIfastTicTocV5_Rratio_(g_prm, N_bat1, b_VmV_data,
              b_VmV_size, I_data, I_size, tvv_data, tvv_size, c_VmKp184Test_data,
              tii_size, (double *)&b_dv0, errI2C_size, Vdebug_data, Vdebug_size);
            loop_ub = b_VmV_size[0] * b_VmV_size[1];
            if (loop_ub - 1 >= 0) {
              memcpy(&VmV_data[0], &b_VmV_data[0], (unsigned int)loop_ub *
                     sizeof(double));
            }

            /*  */
            break;

           default:
            Vdebug_size[0] = N_bat_tmp_tmp_tmp;
            Vdebug_size[1] = 1;
            if (N_bat_tmp_tmp_tmp - 1 >= 0) {
              memset(&VmV_data[0], 0, (unsigned int)N_bat_tmp_tmp_tmp * sizeof
                     (double));
              memset(&Vdebug_data[0], 0, (unsigned int)N_bat_tmp_tmp_tmp *
                     sizeof(double));
            }
            break;
          }

          VbusTest_data[((int)b_meanIbrd0 + (int)Nina219_tmp_tmp * b_loop_ub_tmp)
            - 1] = VmV_data[b_loop_ub_tmp];
          b_trueCount = (int)b_meanIbrd0 + VdebugVec_size[0] * b_loop_ub_tmp;
          VdebugVec_data[b_trueCount - 1] = Vdebug_data[b_loop_ub_tmp];
          VdebugVec_data[(b_trueCount + VdebugVec_size[0] * VdebugVec_size_tmp)
            - 1] = Vdebug_data[b_loop_ub_tmp + Vdebug_size[0]];
          c_sprintf(c_loop_ub_tmp, b_loop_ub_tmp + 1, k_bat);
          d_sprintf(VbusTest_data[((int)b_meanIbrd0 + (int)Nina219_tmp_tmp *
                     b_loop_ub_tmp) - 1], b_VbusTest_data);
          pause(0.1);
          if (prm->seq.tst.v.ins[k_tstState] == 1) {
            /* kp184 */
            ControlKp184((double *)&N0, a__3_size, (double *)&a__4_data,
                         a__4_size, (double *)&d_tmp_data, b_tmp_size, (double *)
                         &b_dv0, errI2C_size);
            VmKp184Test_data[((int)b_meanIbrd0 + (int)Nina219_tmp_tmp *
                              b_loop_ub_tmp) - 1] = d_tmp_data;
            if (b_meanIbrd0 < 2.147483648E+9) {
              i1 = (int)b_meanIbrd0;
            } else {
              i1 = MAX_int32_T;
            }

            c_sprintf(i1, b_loop_ub_tmp + 1, b_k_bat);
            d_sprintf(VmKp184Test_data[((int)b_meanIbrd0 + (int)Nina219_tmp_tmp *
                       b_loop_ub_tmp) - 1], b_VmKp184Test_data);
            pause(0.1);
          }
        }

        /*  for k_bat = 1:N_bat */
        for (i1 = 0; i1 < c_loop_ub; i1++) {
          d_tmp_data = y_data[i1];
          if (d_tmp_data < 256.0) {
            NstTst_tmp_tmp = (unsigned char)d_tmp_data;
          } else {
            NstTst_tmp_tmp = MAX_uint8_T;
          }

          c_y_data[i1] = NstTst_tmp_tmp;
        }

        c_padArrUint8(c_y_data, size_tmp_idx_1, prm->Nmax.NbatMax,
                      prm->Nmax.NbatMax, r3);
        b_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                         prm->brd.spi.PortSpiRow_esp, prm->brd.spi.SwitchMat_esp,
                         prm->brd.spi.PortSpiRow_esp2,
                         prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                         prm->brd.spi.Pac2Vid2, r3, SpiPortRowBypass, a__1_data,
                         a__1_size, id0_data);
        switch (ProjectFlag) {
         case 2:
          /* ESP32 */
          break;

         case 3:
          /* ESP32 ser */
          writePortToSpi4RowMask_ser(SpiPortRowBypass);
          break;
        }

        pause(0.1);
        switch (ProjectFlag) {
         case 2:
          /* ESP32 */
          VmV_size[0] = 16;
          VmV_size[1] = 2;
          memset(&VmV_data[0], 0, 32U * sizeof(double));

          /*  */
          break;

         case 3:
          /* ESP32 ser */
          for (i1 = 0; i1 < 16; i1++) {
            g_prm[i1] = prm->brd.pac.VIpacId[((int)b_meanIbrd0 + (i1 << 1)) - 1];
          }

          c_readI2cVIfastTicTocV5_Rratio_(g_prm, N_bat1, b_VmV_data, b_VmV_size,
            I_data, I_size, tvv_data, tvv_size, c_VmKp184Test_data, tii_size,
            (double *)&N0, a__3_size, Vdebug_data, Vdebug_size);
          VmV_size[0] = Vdebug_size[0];
          VmV_size[1] = Vdebug_size[1];
          loop_ub = Vdebug_size[0] * Vdebug_size[1];
          if (loop_ub - 1 >= 0) {
            memcpy(&VmV_data[0], &Vdebug_data[0], (unsigned int)loop_ub * sizeof
                   (double));
          }

          /*  */
          break;

         default:
          VmV_size[0] = N_bat_tmp_tmp_tmp;
          VmV_size[1] = 1;
          if (N_bat_tmp_tmp_tmp - 1 >= 0) {
            memset(&VmV_data[0], 0, (unsigned int)N_bat_tmp_tmp_tmp * sizeof
                   (double));
          }
          break;
        }

        if (prm->seq.tst.v.ins[k_tstState] == 1) {
          /* kp184 */
          ControlKp184((double *)&N0, a__3_size, (double *)&a__4_data, a__4_size,
                       (double *)&b_dv0, errI2C_size, (double *)&a__16_data,
                       id2Bypass_data);
        }

        /*  [SpiPortRow0,ina219State,Pac2Vid0] = CalcPortSpi(SwitchMat_esp,SwitchMat_esp2,PortSpiRow_esp,PortSpiRow_esp2,Pac2Vid,Pac2Vid2,[1+N_bat/2,N_bat]'); */
        d_padArrUint8(N_bat, prm->Nmax.NbatMax, prm->Nmax.NbatMax, r3);
        b_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                         prm->brd.spi.PortSpiRow_esp, prm->brd.spi.SwitchMat_esp,
                         prm->brd.spi.PortSpiRow_esp2,
                         prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                         prm->brd.spi.Pac2Vid2, r3, SpiPortRowBypass, a__1_data,
                         a__1_size, Pac2Vid0);
        switch (ProjectFlag) {
         case 2:
          /* ESP32 */
          break;

         case 3:
          /* ESP32 ser */
          writePortToSpi4RowMask_ser(SpiPortRowBypass);
          break;
        }

        pause(0.1);
        switch (ProjectFlag) {
         case 2:
          /* ESP32 */
          /*  */
          break;

         case 3:
          /* ESP32 ser */
          for (i1 = 0; i1 < 16; i1++) {
            g_prm[i1] = prm->brd.pac.VIpacId[((int)b_meanIbrd0 + (i1 << 1)) - 1];
          }

          c_readI2cVIfastTicTocV5_Rratio_(g_prm, N_bat1, b_VmV_data, b_VmV_size,
            I_data, I_size, tvv_data, tvv_size, c_VmKp184Test_data, tii_size,
            (double *)&N0, a__3_size, Vdebug_data, Vdebug_size);

          /*  */
          break;
        }

        if (prm->seq.tst.v.isPrm) {
          b_VdebugVec_size[0] = 1;
          b_VdebugVec_size[1] = prm->brd.N_bat;
          b_VdebugVec_size[2] = 2;
          for (i1 = 0; i1 < 2; i1++) {
            for (id2Bypass_size = 0; id2Bypass_size < VdebugVec_size_tmp;
                 id2Bypass_size++) {
              b_VdebugVec_data[id2Bypass_size + VdebugVec_size_tmp * i1] =
                VdebugVec_data[(((int)b_meanIbrd0 + VdebugVec_size[0] *
                                 id2Bypass_size) + VdebugVec_size[0] *
                                VdebugVec_size_tmp * i1) - 1];
            }
          }

