romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
          squeeze(b_VdebugVec_data, b_VdebugVec_size, Vdebug_data, Vdebug_size);
          for (i1 = 0; i1 < 16; i1++) {
            g_prm[i1] = prm->brd.pac.VIpacId[((int)b_meanIbrd0 + (i1 << 1)) - 1];
          }

          for (i1 = 0; i1 < N_bat_tmp_tmp_tmp; i1++) {
            c_VmKp184Test_data[i1] = VmKp184Test_data[((int)b_meanIbrd0 + (int)
              Nina219_tmp_tmp * i1) - 1];
          }

          CalcK(VmV_data, VmV_size, Vdebug_data, Vdebug_size, g_prm, &id0_data[0],
                c_VmKp184Test_data, N_bat_tmp_tmp_tmp, b_VdebugVec_data,
                b_tmp_size);
          for (i1 = 0; i1 < 2; i1++) {
            for (id2Bypass_size = 0; id2Bypass_size < VdebugVec_size_tmp;
                 id2Bypass_size++) {
              kEst_data[(((int)b_meanIbrd0 + kEst_size[0] * id2Bypass_size) +
                         kEst_size[0] * VdebugVec_size_tmp * i1) - 1] =
                b_VdebugVec_data[id2Bypass_size + b_tmp_size[0] * i1];
            }
          }
        } else {
          for (i1 = 0; i1 < N_bat_tmp_tmp_tmp; i1++) {
            VmKp184Test_data[((int)b_meanIbrd0 + (int)Nina219_tmp_tmp * i1) - 1]
              = VbusTest_data[((int)b_meanIbrd0 + (int)Nina219_tmp_tmp * i1) - 1];
          }
        }

        /*  Kalman */
        if (kalmanFlag) {
          for (b_loop_ub_tmp = 0; b_loop_ub_tmp < N_bat_tmp_tmp_tmp;
               b_loop_ub_tmp++) {
            for (i1 = 0; i1 < 31; i1++) {
              fv[i1] = prm->klm.BatParamsCell[(int)b_meanIbrd0 - 1]
                .BatStateOrg[b_loop_ub_tmp + (i1 << 4)];
            }

            for (i1 = 0; i1 < 38; i1++) {
              h_prm[i1] = prm->klm.BatParamsCell[(int)b_meanIbrd0 - 1]
                .BatParams[b_loop_ub_tmp + (i1 << 4)];
            }

            CalcItByVout(h_prm, fv, Ta, VmKp184Test_data[((int)b_meanIbrd0 +
              (int)Nina219_tmp_tmp * b_loop_ub_tmp) - 1]);
            for (i1 = 0; i1 < 31; i1++) {
              prm->klm.BatParamsCell[(int)b_meanIbrd0 - 1]
                .BatState[b_loop_ub_tmp + (i1 << 4)] = fv[i1];
            }
          }

          VmKp184Test_size[0] = 1;
          VmKp184Test_size[1] = N_bat_tmp_tmp_tmp;
          for (i1 = 0; i1 < N_bat_tmp_tmp_tmp; i1++) {
            c_VmKp184Test_data[i1] = VmKp184Test_data[((int)b_meanIbrd0 + (int)
              Nina219_tmp_tmp * i1) - 1];
          }

          k_groups_tmp = c_tmp_data[k0];
          memcpy(&e_prm[0], &(*(float (*)[16])&prm->klm.BatParamsCell[(int)
                              VecIna219_data[k_groups_tmp] - 1].BatState[288])[0],
                 16U * sizeof(float));
          memcpy(&f_prm[0], &prm->klm.BatParamsCell[(int)
                 VecIna219_data[k_groups_tmp] - 1].BatState[0], 496U * sizeof
                 (float));
          InitKalman(e_prm, f_prm, prm->klm.BatParamsCell[(int)
                     VecIna219_data[k_groups_tmp] - 1].BatParams,
                     &prm->klm.BatParamsCell[(int)VecIna219_data[k_groups_tmp] -
                     1].BatState[16], Ta, mean(c_VmKp184Test_data,
                      VmKp184Test_size), &prm->klm.b_struct[(int)b_meanIbrd0 - 1]);
        }
      }

      /*  for k_ina219 = VecIna219_k */
      /*  for k_groups = 1:length(uGroups) */
    }

    /* for k_tstState = 1:N_stTst */
    if (prm->seq.tst.v.isPrm) {
      if (prm->brd.Nina219 < 1.0) {
        loop_ub = 0;
      } else {
        loop_ub = (int)prm->brd.Nina219;
      }

      if (prm->brd.N_bat < 1) {
        b_trueCount = 0;
      } else {
        b_trueCount = prm->brd.N_bat;
      }

      for (i = 0; i < 2; i++) {
        for (i1 = 0; i1 < b_trueCount; i1++) {
          for (i2 = 0; i2 < loop_ub; i2++) {
            prm->brd.pac.Rval[(i2 + (i1 << 1)) + (i << 5)] = (float)kEst_data
              [(i2 + loop_ub * i1) + loop_ub * b_trueCount * i];
          }
        }
      }
    }

    i = (int)prm->brd.Nina219;
    for (k_ina219_ = 0; k_ina219_ < i; k_ina219_++) {
      switch (ProjectFlag) {
       case 2:
        /* esp32 */
        break;

       case 3:
        /* esp32 ser */
        /*  writePortToSpi4RowMask_ser(disConAll,Esp32_v1(k_ina219),false); */
        writePortToSpi4RowMask_ser(disConAll);
        break;
      }
    }

    if (prm->run.testVreset) {
      for (i = 0; i < loop_ub_tmp; i++) {
        c_VbusTest_data[i] = (VbusTest_data[i] > prm->bat.VresetMax);
      }

      if (any(c_VbusTest_data, loop_ub_tmp)) {
        outStruct->VresetFlag = false;
        if (prm->brd.Nina219 < 1.0) {
          loop_ub = 0;
        } else {
          loop_ub = (int)prm->brd.Nina219;
        }

        Nina219[0] = loop_ub;
        Nina219[1] = outStruct->VbusTest->size[1];
        b_loop_ub = outStruct->VbusTest->size[1];
        for (i = 0; i < b_loop_ub; i++) {
          for (i1 = 0; i1 < loop_ub; i1++) {
            outStruct->VbusTest->data[i1 + outStruct->VbusTest->size[0] * i] =
              VbusTest_data[i1 + Nina219[0] * i];
          }
        }

        Nina219[0] = loop_ub;
        Nina219[1] = outStruct->VmKp184Test->size[1];
        b_loop_ub = outStruct->VmKp184Test->size[1];
        for (i = 0; i < b_loop_ub; i++) {
          for (i1 = 0; i1 < loop_ub; i1++) {
            outStruct->VmKp184Test->data[i1 + outStruct->VmKp184Test->size[0] *
              i] = VmKp184Test_data[i1 + Nina219[0] * i];
          }
        }
      } else {
        for (i = 0; i < loop_ub_tmp; i++) {
          c_VbusTest_data[i] = (VbusTest_data[i] < prm->bat.VresetMax);
        }

        if (all(c_VbusTest_data, loop_ub_tmp)) {
          outStruct->VresetFlag = true;
          if (prm->brd.Nina219 < 1.0) {
            loop_ub = 0;
          } else {
            loop_ub = (int)prm->brd.Nina219;
          }

          Nina219[0] = loop_ub;
          Nina219[1] = outStruct->VbusTest->size[1];
          b_loop_ub = outStruct->VbusTest->size[1];
          for (i = 0; i < b_loop_ub; i++) {
            for (i1 = 0; i1 < loop_ub; i1++) {
              outStruct->VbusTest->data[i1 + outStruct->VbusTest->size[0] * i] =
                VbusTest_data[i1 + Nina219[0] * i];
            }
          }

          Nina219[0] = loop_ub;
          Nina219[1] = outStruct->VmKp184Test->size[1];
          b_loop_ub = outStruct->VmKp184Test->size[1];
          for (i = 0; i < b_loop_ub; i++) {
            for (i1 = 0; i1 < loop_ub; i1++) {
              outStruct->VmKp184Test->data[i1 + outStruct->VmKp184Test->size[0] *
                i] = VmKp184Test_data[i1 + Nina219[0] * i];
            }
          }
        } else {
          outStruct->VresetFlag = false;
          if (prm->brd.Nina219 < 1.0) {
            loop_ub = 0;
          } else {
            loop_ub = (int)prm->brd.Nina219;
          }

          Nina219[0] = loop_ub;
          Nina219[1] = outStruct->VbusTest->size[1];
          b_loop_ub = outStruct->VbusTest->size[1];
          for (i = 0; i < b_loop_ub; i++) {
            for (i1 = 0; i1 < loop_ub; i1++) {
              outStruct->VbusTest->data[i1 + outStruct->VbusTest->size[0] * i] =
                VbusTest_data[i1 + Nina219[0] * i];
            }
          }

          Nina219[0] = loop_ub;
          Nina219[1] = outStruct->VmKp184Test->size[1];
          b_loop_ub = outStruct->VmKp184Test->size[1];
          for (i = 0; i < b_loop_ub; i++) {
            for (i1 = 0; i1 < loop_ub; i1++) {
              outStruct->VmKp184Test->data[i1 + outStruct->VmKp184Test->size[0] *
                i] = VmKp184Test_data[i1 + Nina219[0] * i];
            }
          }
        }
      }
    } else {
      for (i = 0; i < loop_ub_tmp; i++) {
        c_VbusTest_data[i] = (VbusTest_data[i] > prm->bat.Vmax);
      }

      if (any(c_VbusTest_data, loop_ub_tmp)) {
        guard2 = true;
      } else {
        for (i = 0; i < loop_ub_tmp; i++) {
          c_VbusTest_data[i] = (VbusTest_data[i] < prm->bat.Vmin);
        }

        if (any(c_VbusTest_data, loop_ub_tmp)) {
          guard2 = true;
        } else {
          for (i = 0; i < loop_ub_tmp; i++) {
            c_VbusTest_data[i] = (VmKp184Test_data[i] > prm->bat.Vmax);
          }

          if (any(c_VbusTest_data, loop_ub_tmp)) {
            guard2 = true;
          } else {
            for (i = 0; i < loop_ub_tmp; i++) {
              c_VbusTest_data[i] = (VmKp184Test_data[i] < prm->bat.Vmin);
            }

            if (any(c_VbusTest_data, loop_ub_tmp)) {
              guard2 = true;
            } else {
              guard4 = true;
            }
          }
        }
      }
    }
  } else {
    /*  Kalman NA */
    if (prm->klm.kalmanFlag) {
      if ((int)prm->brd.Nina219 - 1 >= 0) {
        b_loop_ub = loop_ub_tmp;
        c_loop_ub = prm->brd.N_bat;
      }

      if (VbusTest_size_idx_0 - 1 >= 0) {
        VmKp184Test_size_idx_0 = (int)Nina219_tmp_tmp;
        VmKp184Test_size_idx_1 = N_bat_tmp_tmp_tmp;
        VmKp184Test_size[0] = 1;
        VmKp184Test_size[1] = N_bat_tmp_tmp_tmp;
        for (i = 0; i < b_loop_ub; i++) {
          VmKp184Test_data[i] = 4.0;
        }

        for (i = 0; i < c_loop_ub; i++) {
          c_VmKp184Test_data[i] = 4.0;
        }
      }

      for (k_ina219_ = 0; k_ina219_ < VbusTest_size_idx_0; k_ina219_++) {
        /*  for k_bat = 1:N_bat */
        /*      BatParamsCell{k_ina219}.BatState(k_bat,:) = 0;%CalcItByVout(BatParamsCell{k_ina219}.BatParams(k_bat,:),BatParamsCell{k_ina219}.BatStateOrg(k_bat,:),Ta,1/3600,0,0,0,mean(squeeze(VmKp184Test(k_ina219,k_bat)))); */
        /*  end */
        memcpy(&e_prm[0], &(*(float (*)[16])&prm->klm.BatParamsCell[k_ina219_].
                            BatState[288])[0], 16U * sizeof(float));
        memcpy(&f_prm[0], &prm->klm.BatParamsCell[k_ina219_].BatState[0], 496U *
               sizeof(float));
        InitKalman(e_prm, f_prm, prm->klm.BatParamsCell[k_ina219_].BatParams,
                   &prm->klm.BatParamsCell[k_ina219_].BatState[16], Ta, mean
                   (c_VmKp184Test_data, VmKp184Test_size), &prm->
                   klm.b_struct[k_ina219_]);

