romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
        /* KalmanStruct(k_ina219_,1) = InitKalman(BatParamsCellKalmanStruct.BatState(:,19),BatParamsCell(k_ina219_,1).BatState,BatParamsCell(k_ina219_,1).BatParams,BatParamsCell(k_ina219_,1).BatState(:,2),Ta,mean(squeeze(VmKp184Test(k_ina219_,:)),2)); */
      }
    }

    guard4 = true;
  }

  if (guard4) {
    /* if vTestFlag */
    NstTst_tmp_tmp = prm->seq.tst.i.Nst;

    /* length(seqTstI.grp); */
    if (prm->seq.tst.i.isTest) {
      /*  ItestSwitch = [1:N_bat]'; */
      /*  [SpiPortRow0,ina219State,Pac2Vid0]  = CalcPortSpiPrm(prm.brd.spi,ItestSwitch); */
      /*  I2switchId = ina219State; */
      tic();

      /* 10; */
      /* linspace(0,4.9,NTtest); */
      i = VbusTest2->size[0] * VbusTest2->size[1] * VbusTest2->size[2] *
        VbusTest2->size[3];
      VbusTest2->size[0] = (int)prm->brd.Nina219;
      VbusTest2->size[1] = prm->brd.N_bat;
      VbusTest2->size[2] = prm->seq.tst.i.NTtest;
      VdebugVec_size_tmp = prm->seq.tst.i.Nst;
      VbusTest2->size[3] = prm->seq.tst.i.Nst;
      emxEnsureCapacity_real_T(VbusTest2, i);
      VbusTest2_data = VbusTest2->data;
      partialTrueCount = (int)prm->brd.Nina219 * prm->brd.N_bat;
      b_loop_ub_tmp = partialTrueCount * prm->seq.tst.i.NTtest *
        prm->seq.tst.i.Nst;
      for (i = 0; i < b_loop_ub_tmp; i++) {
        VbusTest2_data[i] = 0.0;
      }

      i = IshuntTest2->size[0] * IshuntTest2->size[1] * IshuntTest2->size[2] *
        IshuntTest2->size[3];
      IshuntTest2->size[0] = (int)prm->brd.Nina219;
      IshuntTest2->size[1] = prm->brd.N_bat;
      IshuntTest2->size[2] = prm->seq.tst.i.NTtest;
      IshuntTest2->size[3] = prm->seq.tst.i.Nst;
      emxEnsureCapacity_real_T(IshuntTest2, i);
      IshuntTest2_data = IshuntTest2->data;
      for (i = 0; i < b_loop_ub_tmp; i++) {
        IshuntTest2_data[i] = 0.0;
      }

      i = ImKp184Test2->size[0] * ImKp184Test2->size[1] * ImKp184Test2->size[2] *
        ImKp184Test2->size[3];
      ImKp184Test2->size[0] = (int)prm->brd.Nina219;
      ImKp184Test2->size[1] = prm->brd.N_bat;
      ImKp184Test2->size[2] = prm->seq.tst.i.NTtest;
      ImKp184Test2->size[3] = prm->seq.tst.i.Nst;
      emxEnsureCapacity_real_T(ImKp184Test2, i);
      ImKp184Test2_data = ImKp184Test2->data;
      for (i = 0; i < b_loop_ub_tmp; i++) {
        ImKp184Test2_data[i] = 0.0;
      }

      i = Iacs758_cal->size[0] * Iacs758_cal->size[1] * Iacs758_cal->size[2] *
        Iacs758_cal->size[3];
      Iacs758_cal->size[0] = (int)prm->brd.Nina219;
      Iacs758_cal->size[1] = 1;
      Iacs758_cal->size[2] = prm->seq.tst.i.NTtest;
      Iacs758_cal->size[3] = prm->seq.tst.i.Nst;
      emxEnsureCapacity_real_T(Iacs758_cal, i);
      Iacs758_cal_data = Iacs758_cal->data;
      loop_ub = (int)prm->brd.Nina219 * prm->seq.tst.i.NTtest *
        prm->seq.tst.i.Nst;
      for (i = 0; i < loop_ub; i++) {
        Iacs758_cal_data[i] = 0.0;
      }

      Rtot_size[0] = (int)prm->brd.Nina219;
      Rtot_size[1] = prm->brd.N_bat;
      Rwire_size[0] = (int)prm->brd.Nina219;
      Rwire_size[1] = prm->brd.N_bat;
      if (partialTrueCount - 1 >= 0) {
        memset(&Rtot_data[0], 0, (unsigned int)partialTrueCount * sizeof(double));
        memset(&Rwire_data[0], 0, (unsigned int)partialTrueCount * sizeof(float));
      }

      if (prm->brd.Nina219 < 1.0) {
        y->size[0] = 1;
        y->size[1] = 0;
      } else {
        i = y->size[0] * y->size[1];
        y->size[0] = 1;
        y->size[1] = (int)(prm->brd.Nina219 - 1.0) + 1;
        emxEnsureCapacity_real_T(y, i);
        y_data = y->data;
        loop_ub = (int)(prm->brd.Nina219 - 1.0);
        for (i = 0; i <= loop_ub; i++) {
          y_data[i] = (double)i + 1.0;
        }
      }

      i = b_y->size[0];
      b_y->size[0] = y->size[1];
      emxEnsureCapacity_real_T(b_y, i);
      b_y_data = b_y->data;
      loop_ub = y->size[1];
      for (i = 0; i < loop_ub; i++) {
        b_y_data[i] = y_data[i];
      }

      loop_ub = y->size[1];
      for (i = 0; i < loop_ub; i++) {
        VecIna219_data[i] = b_y_data[i];
      }

      for (k_tstState = 0; k_tstState < VdebugVec_size_tmp; k_tstState++) {
        pause(0.1);
        if (Nina219_tmp_tmp < 1.0) {
          i = 0;
        } else {
          i = (int)Nina219_tmp_tmp;
        }

        for (k0 = 0; k0 < i; k0++) {
          k_ina219_ = k_tstState << 3;
          k_groups_tmp = prm->seq.tst.i.grp[k0 + k_ina219_];

          /* 1:length(uGroups) %seqTstI.grp(k_tstState)%1:length(uGroups) */
          /* seqTstI.ItestSwitch{k_groups,k_tstState};%[1:N_bat]'; */
          i1 = ((k_groups_tmp - 1) << 8) + (k_tstState << 11);
          c_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                           prm->brd.spi.PortSpiRow_esp,
                           prm->brd.spi.SwitchMat_esp,
                           prm->brd.spi.PortSpiRow_esp2,
                           prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                           prm->brd.spi.Pac2Vid2, &prm->seq.tst.i.ItestSwitch[i1],
                           SpiPortRowBypass, a__1_data, a__1_size, id0_data);

          /*  I2switchId = ina219State; */
          /*  calc V */
          /* squeeze(Pac2Vid0All(k_ina219,:,:));%Pac2Vid3(:,1); */
          trueCount = 0;
          for (loop_ub = 0; loop_ub < 256; loop_ub++) {
            if (id0_data[loop_ub] > 0) {
              trueCount++;
            }
          }

          c_loop_ub = (k_groups_tmp + k_ina219_) - 1;
          partialTrueCount = (unsigned short)trueCount;
          if (partialTrueCount < 1) {
            partialTrueCount = 1;
          }

          if ((unsigned short)trueCount == 0) {
            partialTrueCount = 0;
          }

          c_vSumMax = prm->bat.Vd + ((prm->bat.CutOffChrV[0] + 0.1F) + maximum
            (prm->seq.tst.i.i_in_test) * prm->seq.tst.i.Rin[c_loop_ub]) * (float)
            partialTrueCount;
          id2Bypass_size = ipos_size - 1;
          trueCount = 0;
          partialTrueCount = 0;

          /* VecIna219_k = find(k_groups == uGroupId); */
          b_trueCount = 0;
          for (loop_ub = 0; loop_ub <= id2Bypass_size; loop_ub++) {
            i2 = ipos_data[loop_ub];
            if (k_groups_tmp == i2) {
              trueCount++;
              e_tmp_data[partialTrueCount] = (signed char)loop_ub;
              partialTrueCount++;
            }

            if (k_groups_tmp != i2) {
              b_trueCount++;
            }
          }

          for (k1 = 0; k1 < b_trueCount; k1++) {
            /* diconnect group that not tested */
            switch (ProjectFlag) {
             case 2:
              /* ESP32 */
              break;

             case 3:
              /* ESP32 ser */
              writePortToSpi4RowMask_ser(disConAll);
              break;
            }

            pause(0.1);
          }

          for (k1 = 0; k1 < trueCount; k1++) {
            b_meanIbrd0 = VecIna219_data[e_tmp_data[k1]];
            if (prm->seq.tst.i.BrdBeforePSflag[c_loop_ub] != 0) {
              for (i2 = 0; i2 < trueCount; i2++) {
                b_VecIna219_data[i2] = (VecIna219_data[e_tmp_data[i2]] !=
                  b_meanIbrd0);
              }

              id2Bypass_size = c_eml_find(b_VecIna219_data, trueCount,
                id2Bypass_data);
              for (k_ina219_ = 0; k_ina219_ < id2Bypass_size; k_ina219_++) {
                /* k_bypass = VecIna219_k(id2Bypass) */
                CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                               prm->brd.spi.PortSpiRow_esp,
                               prm->brd.spi.SwitchMat_esp,
                               prm->brd.spi.PortSpiRow_esp2,
                               prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                               prm->brd.spi.Pac2Vid2, prm->brd.spi.bypass,
                               SpiPortRowBypass, a__1_data, a__1_size, id0_data);

                /*  ina219StateAll(:,k_bypass)   = ina219StateBypass; */
                /*  BattConfig{k_bypass}       = prm.brd.spi.bypass;%-2; */
                /*  BattConfigPerIna{k_bypass} = prm.brd.spi.bypass;%-2; */
                d_tmp_data = VecIna219_data[e_tmp_data[id2Bypass_data[k_ina219_]
                  - 1]];
                if (d_tmp_data < 2.147483648E+9) {
                  i2 = (int)d_tmp_data;
                } else {
                  i2 = MAX_int32_T;
                }

                b_sprintf(i2, r7);
                if (prm->seq.tst.i.measRintR) {
                  for (i2 = 0; i2 < 24; i2++) {
                    SpiPortRowBypass[i2] = disConAll[i2];
                  }
                }

                switch (ProjectFlag) {
                 case 2:
                  /* ESP32 */
                  /* TODO bypass */
                  break;

                 case 3:
                  /* ESP32 ser */
                  writePortToSpi4RowMask_ser(SpiPortRowBypass);

                  /* TODO bypass */
                  break;
                }

                pause(0.1);
              }

              c_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                               prm->brd.spi.PortSpiRow_esp,
                               prm->brd.spi.SwitchMat_esp,
                               prm->brd.spi.PortSpiRow_esp2,
                               prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                               prm->brd.spi.Pac2Vid2,
                               &prm->seq.tst.i.ItestSwitch[i1], SpiPortRowBypass,
                               a__1_data, a__1_size, id0_data);

              /*  ina219StateAll(:,k_ina219)   = ina219State; */
              /*  BattConfig{k_ina219}       = iTestSwitchCell_1+(k_ina219-1)*N_bat; */
              /*  BattConfigPerIna{k_ina219} = iTestSwitchCell_1; */
            }

            if (b_meanIbrd0 < 2.147483648E+9) {
              i2 = (int)b_meanIbrd0;
            } else {
              i2 = MAX_int32_T;
            }

