romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
            b_sprintf(i2, r6);
            partialTrueCount = a__1_size[0];
            if (partialTrueCount < 1) {
              partialTrueCount = 1;
            }

            if (a__1_size[0] == 0) {
              k_ina219_ = 0;
            } else {
              k_ina219_ = partialTrueCount;
            }

            for (id2Bypass_size = 0; id2Bypass_size < k_ina219_; id2Bypass_size
                 ++) {
              d_tmp_data = rt_roundd_snf(a__1_data[id2Bypass_size]);
              if (d_tmp_data < 2.147483648E+9) {
                if (d_tmp_data >= -2.147483648E+9) {
                  i2 = (int)d_tmp_data;
                } else {
                  i2 = MIN_int32_T;
                }
              } else if (d_tmp_data >= 2.147483648E+9) {
                i2 = MAX_int32_T;
              } else {
                i2 = 0;
              }

              printf("%d \n", i2);
              fflush(stdout);
            }

            if (prm->seq.tst.i.measRintR) {
              for (i2 = 0; i2 < 24; i2++) {
                SpiPortRowBypass[i2] = disConAll[i2];
              }
            }

            switch (ProjectFlag) {
             case 2:
              /* esp32 */
              break;

             case 3:
              /* esp32 ser */
              writePortToSpi4RowMask_ser(SpiPortRowBypass);
              break;
            }

            /*  end */
            i2 = prm->seq.tst.i.NTtest;
            if (i2 - 1 >= 0) {
              if (b_meanIbrd0 < 2.147483648E+9) {
                k_t0 = (int)b_meanIbrd0;
                state_k = (int)b_meanIbrd0;
              } else {
                k_t0 = MAX_int32_T;
                state_k = MAX_int32_T;
              }
            }

            for (b_trueCount = 0; b_trueCount < i2; b_trueCount++) {
              /*  for k_ina219 = 1:Nina219 */
              switch (prm->seq.tst.i.ins[(k_groups_tmp + (k_tstState << 3)) - 1])
              {
               case 1:
                /* kp184 */
                /* CC */
                pause(0.05);
                pause(0.05);
                pause(1.0);
                break;

               case 2:
                /* ka6005p */
                e_sprintf(c_vSumMax, vSumMax);

                /* ['VSET',num2str(ch),':',num2str(Val)];%[V] */
                pause(0.05);
                f_sprintf(rt_roundf_snf(prm->seq.tst.i.i_in_test[b_trueCount]),
                          b_prm);

                /* ['ISET',num2str(ch),':',num2str(Val)];%[A] */
                pause(0.05);
                pause(1.0);
                break;

               case 3:
                /* juntek+ACDC */
                /* Imax); */
                i_prm[0] = prm->seq.tst.i.i_in_test[b_trueCount];
                i_prm[1] = ImaxAcDC;
                f = rt_roundf_snf(rt_roundf_snf(1000.0F * minimum(i_prm)) /
                                  1000.0F * 1000.0F);
                if (f < 2.14748365E+9F) {
                  if (f >= -2.14748365E+9F) {
                    i3 = (int)f;
                  } else {
                    i3 = MIN_int32_T;
                  }
                } else if (f >= 2.14748365E+9F) {
                  i3 = MAX_int32_T;
                } else {
                  i3 = 0;
                }

                g_sprintf(i3, r8);

                /* [':',juntek_address,'w11=',num2str(uint32(Val*1000),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                /*  disp(['Juntek: I=',num2str(IchargeBit)]); */
                pause(0.1);
                f = rt_roundf_snf(c_vSumMax * 100.0F);
                if (f < 2.14748365E+9F) {
                  if (f >= -2.14748365E+9F) {
                    i3 = (int)f;
                  } else {
                    i3 = MIN_int32_T;
                  }
                } else if (f >= 2.14748365E+9F) {
                  i3 = MAX_int32_T;
                } else {
                  i3 = 0;
                }

                g_sprintf(i3, r9);

                /* [':',juntek_address,'w10=',num2str(uint32(Val*100),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                /*  disp(['Juntek VSET=',num2str(vSumMax)]); */
                pause(0.1);
                pause(1.0);

                /*  disp('juntek ON'); */
                break;

               case 5:
                /* switch out to load */
                pause(0.05);
                break;
              }

              /*              [~,~,~,~]  = ControlKp184(s_kp184,'Read',[]); */
              pause(0.5);
              if (prm->seq.tst.i.BrdBeforePSflag[c_loop_ub] == 0) {
                for (i3 = 0; i3 < trueCount; i3++) {
                  b_VecIna219_data[i3] = (VecIna219_data[e_tmp_data[i3]] !=
                    b_meanIbrd0);
                }

                id2Bypass_size = c_eml_find(b_VecIna219_data, trueCount,
                  id2Bypass_data);
                for (k_ina219_ = 0; k_ina219_ < id2Bypass_size; k_ina219_++) {
                  CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                                 prm->brd.spi.PortSpiRow_esp,
                                 prm->brd.spi.SwitchMat_esp,
                                 prm->brd.spi.PortSpiRow_esp2,
                                 prm->brd.spi.SwitchMat_esp2,
                                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                                 prm->brd.spi.bypass, SpiPortRowBypass,
                                 a__1_data, a__1_size, id0_data);

                  /*  ina219StateAll(:,k_bypass)   = ina219StateBypass; */
                  /*  BattConfig{k_bypass}       = prm.brd.spi.bypass;%-2; */
                  /*  BattConfigPerIna{k_bypass} = prm.brd.spi.bypass;%-2; */
                  d_tmp_data =
                    VecIna219_data[e_tmp_data[id2Bypass_data[k_ina219_] - 1]];
                  if (d_tmp_data < 2.147483648E+9) {
                    i3 = (int)d_tmp_data;
                  } else {
                    i3 = MAX_int32_T;
                  }

                  b_sprintf(i3, r10);
                  if (prm->seq.tst.i.measRintR) {
                    for (i3 = 0; i3 < 24; i3++) {
                      SpiPortRowBypass[i3] = disConAll[i3];
                    }
                  }

                  switch (ProjectFlag) {
                   case 2:
                    /* ESP32 */
                    /* TODO bypass */
                    break;

                   case 3:
                    /* ESP32 ser */
                    writePortToSpi4RowMask_ser(SpiPortRowBypass);

                    /* TODO bypass */
                    break;
                  }

                  pause(0.1);
                }

                c_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                                 prm->brd.spi.PortSpiRow_esp,
                                 prm->brd.spi.SwitchMat_esp,
                                 prm->brd.spi.PortSpiRow_esp2,
                                 prm->brd.spi.SwitchMat_esp2,
                                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                                 &prm->seq.tst.i.ItestSwitch[i1],
                                 SpiPortRowBypass, a__1_data, a__1_size,
                                 id0_data);

                /*  ina219StateAll(:,k_ina219)   = ina219State; */
                /*  BattConfig{k_ina219}       = iTestSwitchCell_1+(k_ina219-1)*N_bat; */
                /*  BattConfigPerIna{k_ina219} = iTestSwitchCell_1; */
              }

              pause(0.5);
              switch (ProjectFlag) {
               case 2:
                /* esp32 */
                I_size[0] = 16;
                I_size[1] = 1;
                tvv_size[0] = 16;
                tvv_size[1] = 1;
                memset(&VmV_data[0], 0, 16U * sizeof(double));
                memset(&I_data[0], 0, 16U * sizeof(double));
                memset(&tvv_data[0], 0, 16U * sizeof(double));
                break;

               case 3:
                /* esp32 ser */
                for (i3 = 0; i3 < 16; i3++) {
                  g_prm[i3] = prm->brd.pac.VIpacId[((int)b_meanIbrd0 + (i3 << 1))
                    - 1];
                }

                c_readI2cVIfastTicTocV5_Rratio_(g_prm, N_bat1, b_VmV_data,
                  b_VmV_size, I_data, I_size, tvv_data, tvv_size,
                  c_VmKp184Test_data, tii_size, (double *)&b_dv0, errI2C_size,
                  Vdebug_data, Vdebug_size);
                loop_ub = b_VmV_size[0] * b_VmV_size[1];
                if (loop_ub - 1 >= 0) {
                  memcpy(&VmV_data[0], &b_VmV_data[0], (unsigned int)loop_ub *
                         sizeof(double));
                }
                break;

               default:
                I_size[0] = N_bat_tmp_tmp_tmp;
                I_size[1] = 1;
                tvv_size[0] = N_bat_tmp_tmp_tmp;
                tvv_size[1] = 1;
                if (N_bat_tmp_tmp_tmp - 1 >= 0) {
                  memset(&VmV_data[0], 0, (unsigned int)N_bat_tmp_tmp_tmp *
                         sizeof(double));
                  memset(&I_data[0], 0, (unsigned int)N_bat_tmp_tmp_tmp * sizeof
                         (double));
                  memset(&tvv_data[0], 0, (unsigned int)N_bat_tmp_tmp_tmp *
                         sizeof(double));
                }
                break;
              }

