romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
              Nina219[0] = 1;
              Nina219[1] = VbusTest2->size[1];
              loop_ub = VbusTest2->size[1];
              for (i3 = 0; i3 < loop_ub; i3++) {
                VbusTest2_data[((((int)b_meanIbrd0 + VbusTest2->size[0] * i3) +
                                 VbusTest2->size[0] * VbusTest2->size[1] *
                                 b_trueCount) + VbusTest2->size[0] *
                                VbusTest2->size[1] * VbusTest2->size[2] *
                                k_tstState) - 1] = VmV_data[i3];
              }

              Nina219[0] = 1;
              Nina219[1] = IshuntTest2->size[1];
              loop_ub = IshuntTest2->size[1];
              for (i3 = 0; i3 < loop_ub; i3++) {
                IshuntTest2_data[((((int)b_meanIbrd0 + IshuntTest2->size[0] * i3)
                                   + IshuntTest2->size[0] * IshuntTest2->size[1]
                                   * b_trueCount) + IshuntTest2->size[0] *
                                  IshuntTest2->size[1] * IshuntTest2->size[2] *
                                  k_tstState) - 1] = I_data[i3];
              }

              switch (prm->seq.tst.i.meas[(k_groups_tmp + (k_tstState << 3)) - 1])
              {
               case 1:
                /* kp184 */
                ControlKp184((double *)&N0, a__3_size, (double *)&a__4_data,
                             a__4_size, (double *)&d_tmp_data, b_tmp_size,
                             (double *)&a__16_data, id2Bypass_data);
                ImKp184Test2_data[(((int)b_meanIbrd0 + ImKp184Test2->size[0] *
                                    ImKp184Test2->size[1] * b_trueCount) +
                                   ImKp184Test2->size[0] * ImKp184Test2->size[1]
                                   * ImKp184Test2->size[2] * k_tstState) - 1] =
                  a__16_data;
                break;

               case 2:
                /* ka6005p */
                /* read I */
                d_tmp_data = d_rand();
                ImKp184Test2_data[(((int)b_meanIbrd0 + ImKp184Test2->size[0] *
                                    ImKp184Test2->size[1] * b_trueCount) +
                                   ImKp184Test2->size[0] * ImKp184Test2->size[1]
                                   * ImKp184Test2->size[2] * k_tstState) - 1] =
                  d_tmp_data * 5.0;

                /* read I */
                d_rand();
                break;

               case 3:
                /* juntek+ACDC */
                controlJuntekDPH8920((double *)&d_tmp_data, b_tmp_size);
                ImKp184Test2_data[(((int)b_meanIbrd0 + ImKp184Test2->size[0] *
                                    ImKp184Test2->size[1] * b_trueCount) +
                                   ImKp184Test2->size[0] * ImKp184Test2->size[1]
                                   * ImKp184Test2->size[2] * k_tstState) - 1] =
                  d_tmp_data;
                b_controlJuntekDPH8920(r30.data, r30.size);
                break;

               case 5:
                /*  switch out to load */
                /* []; */
                d_tmp_data = d_rand() * 2.5 + 2.0;
                b_dv0 = d_rand() * 5.0;
                if (prm->ins.prm.swOut.IfromVdivR_flag) {
                  if (prm->seq.tst.i.i_in_test[b_trueCount] == 0.0F) {
                    ImKp184Test2_data[(((int)b_meanIbrd0 + ImKp184Test2->size[0]
                                        * ImKp184Test2->size[1] * b_trueCount) +
                                       ImKp184Test2->size[0] *
                                       ImKp184Test2->size[1] *
                                       ImKp184Test2->size[2] * k_tstState) - 1] =
                      0.0;
                  } else {
                    ImKp184Test2_data[(((int)b_meanIbrd0 + ImKp184Test2->size[0]
                                        * ImKp184Test2->size[1] * b_trueCount) +
                                       ImKp184Test2->size[0] *
                                       ImKp184Test2->size[1] *
                                       ImKp184Test2->size[2] * k_tstState) - 1] =
                      (float)d_tmp_data / prm->seq.tst.i.Rload;

                    /* seqTstI.i_in_test(k_Ttest); */
                  }
                } else {
                  ImKp184Test2_data[(((int)b_meanIbrd0 + ImKp184Test2->size[0] *
                                      ImKp184Test2->size[1] * b_trueCount) +
                                     ImKp184Test2->size[0] * ImKp184Test2->size
                                     [1] * ImKp184Test2->size[2] * k_tstState) -
                    1] = b_dv0;
                }
                break;
              }

              /*  formatSpec0 = '%.3g'; */
              /*  formatSpec1 = '%.5g'; */
              /*                      disp(['V(',pad(num2str([k_ina219,k_Ttest,k_tstState]),'left',padLeft),')=',pad(num2str(VbusTest2(k_ina219,:,k_Ttest,k_tstState)),padRight,'left',padLeft),'V ',newline ,... */
              /*                          'I(',pad(num2str([k_ina219,k_Ttest,k_tstState]),'left',padLeft),')=',pad(num2str(IshuntTest2(k_ina219,:,k_Ttest,k_tstState)),padRight,'left',padLeft),'A ']); */
              h_sprintf(k_t0, b_trueCount + 1, k_tstState + 1, k_Ttest);
              for (b_loop_ub_tmp = 0; b_loop_ub_tmp < N_bat_tmp_tmp_tmp;
                   b_loop_ub_tmp++) {
                i_sprintf(VbusTest2_data[((((int)b_meanIbrd0 + VbusTest2->size[0]
                  * b_loop_ub_tmp) + VbusTest2->size[0] * VbusTest2->size[1] *
                            b_trueCount) + VbusTest2->size[0] * VbusTest2->size
                           [1] * VbusTest2->size[2] * k_tstState) - 1],
                          b_VbusTest2);
              }

              h_sprintf(state_k, b_trueCount + 1, k_tstState + 1, b_k_Ttest);
              for (b_loop_ub_tmp = 0; b_loop_ub_tmp < N_bat_tmp_tmp_tmp;
                   b_loop_ub_tmp++) {
                i_sprintf(IshuntTest2_data[((((int)b_meanIbrd0 +
                  IshuntTest2->size[0] * b_loop_ub_tmp) + IshuntTest2->size[0] *
                            IshuntTest2->size[1] * b_trueCount) +
                           IshuntTest2->size[0] * IshuntTest2->size[1] *
                           IshuntTest2->size[2] * k_tstState) - 1],
                          b_IshuntTest2);

                /* nadav Coder */
              }

              pause(0.1);
              if (Iacs758Flag == 1) {
                if (ProjectFlag == 2) {
                  /* esp32 */
                  Iacs758_cal_data[(((int)b_meanIbrd0 + Iacs758_cal->size[0] *
                                     Iacs758_cal->size[1] * b_trueCount) +
                                    Iacs758_cal->size[0] * Iacs758_cal->size[1] *
                                    Iacs758_cal->size[2] * k_tstState) - 1] =
                    0.0;
                }

                b_dv0 = Iacs758_cal_data[(((int)b_meanIbrd0 + Iacs758_cal->size
                  [0] * Iacs758_cal->size[1] * b_trueCount) + Iacs758_cal->size
                  [0] * Iacs758_cal->size[1] * Iacs758_cal->size[2] * k_tstState)
                  - 1];
                Nina219[0] = I_size[0];
                Nina219[1] = I_size[1];
                loop_ub = Nina219[0] * Nina219[1];
                for (i3 = 0; i3 < loop_ub; i3++) {
                  I_data[i3] = b_dv0;
                }
              } else if (Iacs758Flag == 2) {
                switch (ProjectFlag) {
                 case 2:
                  /* esp32 */
                  break;

                 case 3:
                  /* esp32 */
                  /* UNTITLED3 Summary of this function goes here */
                  /*    Detailed explanation goes here */
                  Iacs758_cal_data[(((int)b_meanIbrd0 + Iacs758_cal->size[0] *
                                     Iacs758_cal->size[1] * b_trueCount) +
                                    Iacs758_cal->size[0] * Iacs758_cal->size[1] *
                                    Iacs758_cal->size[2] * k_tstState) - 1] =
                    randn() * 5.0;

                  /*  else */
                  /*      V = zeros(length(VIpacId),1); */
                  /*      I = zeros(length(VIpacId),1); */
                  /*      tI = zeros(length(VIpacId),1); */
                  /*      tV = zeros(length(VIpacId),1); */
                  /*      outV2 = zeros(length(VIpacId),1); */
                  /*      err = -1; */
                  /*  end */
                  /*  I = I(10); */
                  /*  tI = tI(10); */
                  b_dv0 = Iacs758_cal_data[(((int)b_meanIbrd0 +
                    Iacs758_cal->size[0] * Iacs758_cal->size[1] * b_trueCount) +
                    Iacs758_cal->size[0] * Iacs758_cal->size[1] *
                    Iacs758_cal->size[2] * k_tstState) - 1];
                  Nina219[0] = I_size[0];
                  Nina219[1] = I_size[1];
                  loop_ub = Nina219[0] * Nina219[1];
                  for (i3 = 0; i3 < loop_ub; i3++) {
                    I_data[i3] = b_dv0;
                  }
                  break;
                }
              }

