romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
              switch (prm->seq.tst.i.ins[(k_groups_tmp + (k_tstState << 3)) - 1])
              {
               case 1:
                /* kunkin kp184 */
                break;

               case 2:
                /* ka6005p */
                break;

               case 3:
                /* juntek+ACDC */
                break;

               case 5:
                /* switch out to load */
                /* CC */
                pause(0.05);
                break;
              }

              b_pause(prm->seq.tst.i.pauseOff);

              /* pause(0.1); */
              /* kalman */
              if (kalmanFlag) {
                CalcStructKalman(&prm->klm.b_struct[(int)b_meanIbrd0 - 1], Ta,
                                 tvv_data, tvv_size, I_data, VmV_data);
              }
            }

            /*  switch seqTstI.ins(k_tstState) */
            /*      case 1 %kunkin kp184 */
            /*          ControlKp184(prm.ser.s_kp184,'Off'); */
            /*      case 2 %ka6005p */
            /*          ControlKa6005P(prm.ser.s_ka6005p,'Off',[]); */
            /*      case 3 %juntek+ACDC */
            /*          controlJuntekDPH8920(prm.ser.s_juntek,'OFF',[]); */
            /*  end */
            /*  pause(seqTstI.pauseOff);%pause(0.1); */
            switch (ProjectFlag) {
             case 2:
              /* esp32 */
              break;

             case 3:
              /* esp32 ser */
              writePortToSpi4RowMask_ser(disConAll);
              break;
            }

            /*  if prm.ser.kp184_Flag */
            /*      ControlKp184(prm.ser.s_kp184,'Off',[]); */
            /*      pause(0.1); */
            /*  end */
          }
        }
      }

      /*  if prm.ser.kp184_Flag */
      /*      ControlKp184(prm.ser.s_kp184,'Off',[]); */
      /*  end */
      /* TODO save */
      /*      coder.varsize('ImKp184Test2_bat_0','Ishunt_cal_bat_0','Vbus_cal_bat_0',[Nmax.NbitCnfgMax*Nmax.NstateMax 1],[1,1]); */
      i = (int)prm->brd.Nina219;
      kEst_size[0] = (int)prm->brd.Nina219;
      kEst_size[1] = prm->brd.N_bat;
      kEst_size[2] = 2;
      b_loop_ub_tmp = ((int)prm->brd.Nina219 * prm->brd.N_bat) << 1;
      VdebugVec_size[0] = (int)prm->brd.Nina219;
      if (b_loop_ub_tmp - 1 >= 0) {
        memset(&kEst_data[0], 0, (unsigned int)b_loop_ub_tmp * sizeof(double));
        memset(&VdebugVec_data[0], 0, (unsigned int)b_loop_ub_tmp * sizeof
               (double));
      }

      pIacs758_size[0] = (int)prm->brd.Nina219;
      pIacs758_size[1] = 1;
      pIacs758_size[2] = 2;
      loop_ub = (int)prm->brd.Nina219 << 1;
      if (loop_ub - 1 >= 0) {
        memset(&pIacs758_data[0], 0, (unsigned int)loop_ub * sizeof(float));
      }

      if (!prm->seq.tst.i.measRintR) {
        if (i - 1 >= 0) {
          if (N_bat_tmp_tmp_tmp - 1 >= 0) {
            end = NstTst_tmp_tmp - 1;
            tmp_size[0] = 1;
          }

          d_loop_ub = Rtot_size[1];
        }

        for (k_ina219_ = 0; k_ina219_ < i; k_ina219_++) {
          VbusTest2_size[0] = 1;
          VbusTest2_size[1] = 1;
          VbusTest2_size[2] = Iacs758_cal->size[2];
          loop_ub = Iacs758_cal->size[3];
          VbusTest2_size[3] = Iacs758_cal->size[3];
          for (i1 = 0; i1 < loop_ub; i1++) {
            b_loop_ub = Iacs758_cal->size[2];
            for (i2 = 0; i2 < b_loop_ub; i2++) {
              b_VbusTest2_data[i2 + VbusTest2_size[2] * i1] = Iacs758_cal_data
                [(k_ina219_ + Iacs758_cal->size[0] * Iacs758_cal->size[1] * i2)
                + Iacs758_cal->size[0] * Iacs758_cal->size[1] *
                Iacs758_cal->size[2] * i1];
            }
          }

          b_squeeze(b_VbusTest2_data, VbusTest2_size, r1);
          b_y_data = r1->data;
          b_loop_ub_tmp = r1->size[0] * r1->size[1];
          for (i1 = 0; i1 < b_loop_ub_tmp; i1++) {
            VmV_data[i1] = b_y_data[i1];
          }

          VbusTest2_size[0] = 1;
          VbusTest2_size[1] = 1;
          VbusTest2_size[2] = ImKp184Test2->size[2];
          loop_ub = ImKp184Test2->size[3];
          VbusTest2_size[3] = ImKp184Test2->size[3];
          for (i1 = 0; i1 < loop_ub; i1++) {
            b_loop_ub = ImKp184Test2->size[2];
            for (i2 = 0; i2 < b_loop_ub; i2++) {
              b_VbusTest2_data[i2 + VbusTest2_size[2] * i1] = ImKp184Test2_data
                [(k_ina219_ + ImKp184Test2->size[0] * ImKp184Test2->size[1] * i2)
                + ImKp184Test2->size[0] * ImKp184Test2->size[1] *
                ImKp184Test2->size[2] * i1];
            }
          }

          b_squeeze(b_VbusTest2_data, VbusTest2_size, r1);
          b_y_data = r1->data;
          if (r1->size[1] == NstTst_tmp_tmp) {
            Vdebug_size[0] = r1->size[0];
            Vdebug_size[1] = r1->size[1];
            loop_ub = r1->size[1];
            for (i1 = 0; i1 < loop_ub; i1++) {
              b_loop_ub = r1->size[0];
              for (i2 = 0; i2 < b_loop_ub; i2++) {
                Vdebug_data[i2 + Vdebug_size[0] * i1] = b_y_data[i2 + r1->size[0]
                  * i1] * (double)prm->seq.tst.i.NegIflag[(ipos_data[k_ina219_]
                  + (i1 << 3)) - 1];
              }
            }
          } else {
            binary_expand_op_2(Vdebug_data, Vdebug_size, r1, prm, ipos_data,
                               k_ina219_, NstTst_tmp_tmp - 1);
          }

          polyfit(VmV_data, b_loop_ub_tmp, Vdebug_data, Vdebug_size[0] *
                  Vdebug_size[1], outVI);
          pIacs758_data[k_ina219_] = (float)outVI[0];
          pIacs758_data[k_ina219_ + pIacs758_size[0]] = (float)outVI[1];

          /* polyfit(squeeze(IshuntTest2(k_ina219,k_bat,:,k_iTest)),1000*squeeze(ImKp184Test2(k_ina219,1,:,k_iTest)),1); */
          for (b_loop_ub_tmp = 0; b_loop_ub_tmp < N_bat_tmp_tmp_tmp;
               b_loop_ub_tmp++) {
            for (k_tstState = 0; k_tstState < VdebugVec_size_tmp; k_tstState++)
            {
              ismember0_data[k_tstState] = isMember((double)b_loop_ub_tmp + 1.0,
                &prm->seq.tst.i.ItestSwitch[((ipos_data[k_ina219_] - 1) << 8) +
                (k_tstState << 11)]);
            }

            trueCount = 0;
            partialTrueCount = 0;
            for (loop_ub = 0; loop_ub <= end; loop_ub++) {
              if (ismember0_data[loop_ub]) {
                trueCount++;
                g_tmp_data[partialTrueCount] = (signed char)loop_ub;
                partialTrueCount++;
              }
            }

