romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
            IshuntTest2_size[0] = 1;
            IshuntTest2_size[1] = 1;
            IshuntTest2_size[2] = IshuntTest2->size[2];
            IshuntTest2_size[3] = trueCount;
            for (i1 = 0; i1 < trueCount; i1++) {
              loop_ub = IshuntTest2->size[2];
              for (i2 = 0; i2 < loop_ub; i2++) {
                b_IshuntTest2_data[i2 + IshuntTest2_size[2] * i1] =
                  IshuntTest2_data[((k_ina219_ + IshuntTest2->size[0] *
                                     b_loop_ub_tmp) + IshuntTest2->size[0] *
                                    IshuntTest2->size[1] * i2) +
                  IshuntTest2->size[0] * IshuntTest2->size[1] *
                  IshuntTest2->size[2] * g_tmp_data[i1]];
              }
            }

            b_squeeze(b_IshuntTest2_data, IshuntTest2_size, Ishunt_cal_bat_00);
            IshuntTest2_size[0] = 1;
            IshuntTest2_size[1] = 1;
            IshuntTest2_size[2] = VbusTest2->size[2];
            IshuntTest2_size[3] = trueCount;
            for (i1 = 0; i1 < trueCount; i1++) {
              loop_ub = VbusTest2->size[2];
              for (i2 = 0; i2 < loop_ub; i2++) {
                b_IshuntTest2_data[i2 + IshuntTest2_size[2] * i1] =
                  VbusTest2_data[((k_ina219_ + VbusTest2->size[0] *
                                   b_loop_ub_tmp) + VbusTest2->size[0] *
                                  VbusTest2->size[1] * i2) + VbusTest2->size[0] *
                  VbusTest2->size[1] * VbusTest2->size[2] * g_tmp_data[i1]];
              }
            }

            b_squeeze(b_IshuntTest2_data, IshuntTest2_size, Vbus_cal_bat_00);
            IshuntTest2_size[0] = 1;
            IshuntTest2_size[1] = 1;
            IshuntTest2_size[2] = ImKp184Test2->size[2];
            IshuntTest2_size[3] = trueCount;
            tmp_size[1] = trueCount;
            for (i1 = 0; i1 < trueCount; i1++) {
              loop_ub = ImKp184Test2->size[2];
              for (i2 = 0; i2 < loop_ub; i2++) {
                b_IshuntTest2_data[i2 + IshuntTest2_size[2] * i1] =
                  ImKp184Test2_data[(k_ina219_ + ImKp184Test2->size[0] *
                                     ImKp184Test2->size[1] * i2) +
                  ImKp184Test2->size[0] * ImKp184Test2->size[1] *
                  ImKp184Test2->size[2] * g_tmp_data[i1]];
              }

              h_tmp_data[i1] = prm->seq.tst.i.NegIflag[(ipos_data[k_ina219_] +
                (g_tmp_data[i1] << 3)) - 1];
            }

            b_squeeze(b_IshuntTest2_data, IshuntTest2_size, r1);
            b_y_data = r1->data;
            if (r1->size[1] == trueCount) {
              ImKp184Test2_bat_00_size[0] = r1->size[0];
              ImKp184Test2_bat_00_size[1] = r1->size[1];
              loop_ub = r1->size[1];
              for (i1 = 0; i1 < loop_ub; i1++) {
                b_loop_ub = r1->size[0];
                for (i2 = 0; i2 < b_loop_ub; i2++) {
                  ImKp184Test2_bat_00_data[i2 + ImKp184Test2_bat_00_size[0] * i1]
                    = b_y_data[i2 + r1->size[0] * i1] * (double)h_tmp_data[i1];
                }
              }
            } else {
              binary_expand_op(ImKp184Test2_bat_00_data,
                               ImKp184Test2_bat_00_size, r1, h_tmp_data,
                               tmp_size);
            }

            id2Bypass_size = ImKp184Test2_bat_00_size[0] *
              ImKp184Test2_bat_00_size[1];
            trueCount = Vbus_cal_bat_00->size[0] * Vbus_cal_bat_00->size[1];
            polyfit(ImKp184Test2_bat_00_data, id2Bypass_size, (double *)
                    Vbus_cal_bat_00->data, trueCount, outVI);
            b_trueCount = k_ina219_ + VdebugVec_size[0] * b_loop_ub_tmp;
            VdebugVec_data[b_trueCount] = outVI[0];
            VdebugVec_data[b_trueCount + VdebugVec_size[0] * prm->brd.N_bat] =
              outVI[1];
            trueCount = Ishunt_cal_bat_00->size[0] * Ishunt_cal_bat_00->size[1];
            polyfit((double *)Ishunt_cal_bat_00->data, trueCount,
                    ImKp184Test2_bat_00_data, id2Bypass_size, outVI);
            b_trueCount = k_ina219_ + kEst_size[0] * b_loop_ub_tmp;
            kEst_data[b_trueCount] = outVI[0];
            kEst_data[b_trueCount + kEst_size[0] * kEst_size[1]] = outVI[1];

            /* polyfit(squeeze(IshuntTest2(k_ina219,k_bat,:,k_iTest)),1000*squeeze(ImKp184Test2(k_ina219,1,:,k_iTest)),1); */
          }

          /*  end */
          for (i1 = 0; i1 < d_loop_ub; i1++) {
            Rtot_data[k_ina219_ + Rtot_size[0] * i1] = -VdebugVec_data[k_ina219_
              + VdebugVec_size[0] * i1];
          }

          if (Rtot_size[1] == 16) {
            loop_ub = Rwire_size[1];
            for (i1 = 0; i1 < loop_ub; i1++) {
              Rwire_data[k_ina219_ + Rwire_size[0] * i1] = (float)
                Rtot_data[k_ina219_ + Rtot_size[0] * i1] - prm->
                bat.Rint[k_ina219_ + (i1 << 1)];
            }
          } else {
            binary_expand_op_1(Rwire_data, Rwire_size, k_ina219_, Rtot_data,
                               Rtot_size, prm);
          }

          if (!prm->seq.tst.i.useRwireFlag) {
            loop_ub = Rwire_size[1];
            for (i1 = 0; i1 < loop_ub; i1++) {
              b_loop_ub = Rwire_size[0];
              for (i2 = 0; i2 < b_loop_ub; i2++) {
                Rwire_data[i2 + Rwire_size[0] * i1] = 0.0F;
              }
            }
          }
        }

        guard3 = true;
      } else if (prm->seq.tst.i.measRintR) {
        loop_ub = ImKp184Test2->size[2];
        for (i = 0; i < loop_ub; i++) {
          tvv_data[i] = ImKp184Test2_data[ImKp184Test2->size[0] *
            ImKp184Test2->size[1] * i];
        }

        if (prm->seq.tst.i.RintBatId < 1) {
          k_groups_tmp = 1;
        } else {
          k_groups_tmp = prm->seq.tst.i.RintBatId;
        }

        loop_ub = VbusTest2->size[2];
        for (i = 0; i < loop_ub; i++) {
          b_VmV_data[i] = VbusTest2_data[VbusTest2->size[0] * (k_groups_tmp - 1)
            + VbusTest2->size[0] * VbusTest2->size[1] * i];
        }

