romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
        Nina219[0] = 1;
        Nina219[1] = prm->seq.tst.i.NTtest;
        id2Bypass_data[0] = 1;
        id2Bypass_data[1] = prm->seq.tst.i.NTtest;
        b_polyfit(tvv_data, Nina219, b_VmV_data, id2Bypass_data, outVI);
        outStruct->Rint = -outVI[0];
        VbusTest2_size[2] = VbusTest2->size[2];
        loop_ub = VbusTest2->size[3];
        for (i = 0; i < loop_ub; i++) {
          b_loop_ub = VbusTest2->size[2];
          for (i1 = 0; i1 < b_loop_ub; i1++) {
            b_VbusTest2_data[i1 + VbusTest2_size[2] * i] = VbusTest2_data
              [(VbusTest2->size[0] * (prm->seq.tst.i.RintBatId - 1) +
                VbusTest2->size[0] * VbusTest2->size[1] * i1) + VbusTest2->size
              [0] * VbusTest2->size[1] * VbusTest2->size[2] * i];
          }
        }

        trueCount = VbusTest2->size[2] * VbusTest2->size[3];
        outStruct->VpassFlag = true;
        for (i = 0; i < trueCount; i++) {
          d_tmp_data = b_VbusTest2_data[i];
          VmV_data[i] = d_tmp_data;
          VbusTest0_data[i] = (d_tmp_data > prm->bat.Vmax);
        }

        if (any(VbusTest0_data, trueCount)) {
          outStruct->VpassFlag = false;
        } else {
          for (i = 0; i < trueCount; i++) {
            VbusTest0_data[i] = (VmV_data[i] < prm->bat.Vmin);
          }

          if (any(VbusTest0_data, trueCount)) {
            outStruct->VpassFlag = false;
          } else {
            j_sprintf(prm->seq.tst.i.RintBatId, c_prm);
            Nina219[0] = 1;
            Nina219[1] = prm->seq.tst.i.NTtest;
            id2Bypass_data[0] = 1;
            id2Bypass_data[1] = prm->seq.tst.i.NTtest;
            b_polyfit(tvv_data, Nina219, b_VmV_data, id2Bypass_data, outVI);
            d_sprintf(-outVI[0], r11);
          }
        }
      } else {
        guard3 = true;
      }
    } else {
      b_loop_ub_tmp = (int)prm->brd.Nina219;
      kEst_size[0] = (int)prm->brd.Nina219;
      c_loop_ub_tmp = prm->brd.N_bat;
      kEst_size[1] = prm->brd.N_bat;
      kEst_size[2] = 2;
      loop_ub = ((int)prm->brd.Nina219 * prm->brd.N_bat) << 1;
      if (loop_ub - 1 >= 0) {
        memset(&kEst_data[0], 0, (unsigned int)loop_ub * sizeof(double));
      }

      for (i = 0; i < c_loop_ub_tmp; i++) {
        for (i1 = 0; i1 < b_loop_ub_tmp; i1++) {
          kEst_data[i1 + b_loop_ub_tmp * i] = 1.0;
        }
      }

      /* pIshunt*0; */
      loop_ub = prm->brd.N_bat;
      for (i = 0; i < loop_ub; i++) {
        for (i1 = 0; i1 < b_loop_ub_tmp; i1++) {
          kEst_data[(i1 + kEst_size[0] * i) + kEst_size[0] * c_loop_ub_tmp] =
            0.0;
        }
      }

      guard1 = true;
    }
  }

  if (guard3) {
    /*  if 0 */
    /*      I2switchId = [I2switchId 2];%add bypass */
    /*      pIshuntAll(:,:,:,1+end) = zeros(Nina219,Nbat,2); */
    /*      pIshunt(:,2:2:end,:) = 0;%pac even disconnected */
    for (k_ina219_ = 0; k_ina219_ < i; k_ina219_++) {
      switch (ProjectFlag) {
       case 2:
        /* esp32 */
        break;

       case 3:
        /* esp32 ser */
        writePortToSpi4RowMask_ser(disConAll);
        break;
      }
    }

    loop_ub = prm->brd.N_bat;
    for (i = 0; i < loop_ub; i++) {
      b_loop_ub = kEst_size[0];
      for (i1 = 0; i1 < b_loop_ub; i1++) {
        kEst_data[i1 + kEst_size[0] * i] = 1.0;
      }
    }

    /* pIshunt*0; */
    loop_ub = prm->brd.N_bat;
    for (i = 0; i < loop_ub; i++) {
      b_loop_ub = kEst_size[0];
      for (i1 = 0; i1 < b_loop_ub; i1++) {
        kEst_data[(i1 + kEst_size[0] * i) + kEst_size[0] * kEst_size[1]] = 0.0;
      }
    }

    /*  end */
    /*  pIshunt = squeeze(pIshunt); */
    /*  pIshunt(:,:,1) = 1;pIshunt(:,:,1) = 0; */
    guard1 = true;
  }

  if (guard2) {
    outStruct->VpassFlag = false;
    if (prm->brd.Nina219 < 1.0) {
      loop_ub = 0;
    } else {
      loop_ub = (int)prm->brd.Nina219;
    }

    Nina219[0] = loop_ub;
    Nina219[1] = outStruct->VbusTest->size[1];
    b_loop_ub = outStruct->VbusTest->size[1];
    for (i = 0; i < b_loop_ub; i++) {
      for (i1 = 0; i1 < loop_ub; i1++) {
        outStruct->VbusTest->data[i1 + outStruct->VbusTest->size[0] * i] =
          VbusTest_data[i1 + Nina219[0] * i];
      }
    }

    Nina219[0] = loop_ub;
    Nina219[1] = outStruct->VmKp184Test->size[1];
    b_loop_ub = outStruct->VmKp184Test->size[1];
    for (i = 0; i < b_loop_ub; i++) {
      for (i1 = 0; i1 < loop_ub; i1++) {
        outStruct->VmKp184Test->data[i1 + outStruct->VmKp184Test->size[0] * i] =
          VmKp184Test_data[i1 + Nina219[0] * i];
      }
    }
  }

  if (guard1 && ((!prm->seq.tst.savePrmFlag) || (!prm->seq.tst.v.isPrm) ||
                 (!prm->seq.tst.i.isTest))) {
    /*  RintTotal = zeros(Nina219,N_bat); */
    /*  for k_ina219 = 1:Nina219 */
    /*      for k_bat = 1:N_bat */
    /*          RintTotal0 = polyfit(i_in_test,squeeze(VbusTest2(k_ina219,k_bat,:,k_ina219))',1); */
    /*          RintTotal(k_ina219,k_bat) = -RintTotal0(1); */
    /*      end */
    /*  end */
    /*  BIT */
    b_loop_ub_tmp = (int)prm->brd.Nina219;
    Pac2Vid0All_size[0] = (int)prm->brd.Nina219;
    d_loop_ub = prm->brd.N_bat;
    Pac2Vid0All_size[2] = prm->brd.N_bat;
    c_loop_ub_tmp = (int)prm->brd.Nina219 * prm->brd.N_bat;
    end = c_loop_ub_tmp * prm->brd.N_bat;
    if (end - 1 >= 0) {
      memset(&Pac2Vid0All_data[0], 0, (unsigned int)end * sizeof(unsigned char));
    }

    if (prm->seq.bit.bit_flag) {
      /* TODO groups */
      /*  meanVbusTest = mean(VbusTest,3);%(k_ina219,k_bat,k_Ttest) */
      N_bitCnfg = BuildBitCnfg(prm->brd.N_bat1, prm->brd.N_bat2, prm->brd.N_bat,
        prm->Nmax.NbatMax, bitCnfg_data, b_VdebugVec_size, bitCnfgStr_data,
        id2Bypass_data);

      /*      N_bitCnfg = length(bitCnfg); */
      /*  [N_bitI,Ngroups,NstBit] = size(seqBit.IdisChr); */
      /*  N_bitIdis = length(prm.bit.Idis); */
      /*  N_bitIchr = length(prm.bit.Ichr); */
      /* [128,16,32,32,32],[1 1 1 1 1]); */
      i = Vbrd->size[0] * Vbrd->size[1] * Vbrd->size[2] * Vbrd->size[3] *
        Vbrd->size[4];
      Vbrd->size[0] = N_bitCnfg;
      Vbrd->size[1] = (int)prm->brd.Nina219;
      Vbrd->size[2] = 1;
      Vbrd->size[3] = prm->brd.N_bat;
      i1 = prm->seq.bit.Nst;
      Vbrd->size[4] = prm->seq.bit.Nst;
      emxEnsureCapacity_real_T(Vbrd, i);
      VbusTest2_data = Vbrd->data;
      partialTrueCount = N_bitCnfg * (int)prm->brd.Nina219;
      id2Bypass_size = partialTrueCount * prm->brd.N_bat * prm->seq.bit.Nst;
      for (i = 0; i < id2Bypass_size; i++) {
        VbusTest2_data[i] = 0.0;
      }

      i = Ibrd->size[0] * Ibrd->size[1] * Ibrd->size[2] * Ibrd->size[3] *
        Ibrd->size[4];
      Ibrd->size[0] = N_bitCnfg;
      Ibrd->size[1] = (int)prm->brd.Nina219;
      Ibrd->size[2] = 1;
      Ibrd->size[3] = prm->brd.N_bat;
      Ibrd->size[4] = prm->seq.bit.Nst;
      emxEnsureCapacity_real_T(Ibrd, i);
      IshuntTest2_data = Ibrd->data;
      for (i = 0; i < id2Bypass_size; i++) {
        IshuntTest2_data[i] = 0.0;
      }

      /*  VbrdChr = zeros(N_bitCnfg,Nina219,N_bitIchr,N_bat); */
      /*  IbrdChr = zeros(N_bitCnfg,Nina219,N_bitIchr,N_bat); */
      /* [128,16,32,32],[1 1 1 1]); */
      i = meanIbrd->size[0] * meanIbrd->size[1] * meanIbrd->size[2] *
        meanIbrd->size[3];
      meanIbrd->size[0] = N_bitCnfg;
      meanIbrd->size[1] = (int)prm->brd.Nina219;
      meanIbrd->size[2] = 1;
      meanIbrd->size[3] = prm->seq.bit.Nst;
      emxEnsureCapacity_real_T(meanIbrd, i);
      ImKp184Test2_data = meanIbrd->data;
      id2Bypass_size = partialTrueCount * prm->seq.bit.Nst;
      for (i = 0; i < id2Bypass_size; i++) {
        ImKp184Test2_data[i] = 0.0;
      }

      /*  meanIbrdChr = zeros(N_bitCnfg,Nina219,N_bitIchr); */
      i = VbitInsMeas->size[0] * VbitInsMeas->size[1] * VbitInsMeas->size[2] *
        VbitInsMeas->size[3];
      VbitInsMeas->size[0] = N_bitCnfg;
      VbitInsMeas->size[1] = (int)prm->brd.Nina219;
      VbitInsMeas->size[2] = 1;
      VbitInsMeas->size[3] = prm->seq.bit.Nst;
      emxEnsureCapacity_real_T(VbitInsMeas, i);
      Iacs758_cal_data = VbitInsMeas->data;
      for (i = 0; i < id2Bypass_size; i++) {
        Iacs758_cal_data[i] = 0.0;
      }

      /*  VbitInsMeasChr = zeros(N_bitCnfg,Nina219,N_bitIdis); */
      /*  IbitInsMeasChr = zeros(N_bitCnfg,Nina219,N_bitIdis); */
      if (prm->brd.Nina219 < 1.0) {
        y->size[0] = 1;
        y->size[1] = 0;
      } else {
        i = y->size[0] * y->size[1];
        y->size[0] = 1;
        y->size[1] = (int)(prm->brd.Nina219 - 1.0) + 1;
        emxEnsureCapacity_real_T(y, i);
        y_data = y->data;
        loop_ub = (int)(prm->brd.Nina219 - 1.0);
        for (i = 0; i <= loop_ub; i++) {
          y_data[i] = (double)i + 1.0;
        }
      }

      i = b_y->size[0];
      b_y->size[0] = y->size[1];
      emxEnsureCapacity_real_T(b_y, i);
      b_y_data = b_y->data;
      loop_ub = y->size[1];
      for (i = 0; i < loop_ub; i++) {
        b_y_data[i] = y_data[i];
      }

      loop_ub = y->size[1];
      for (i = 0; i < loop_ub; i++) {
        VecIna219_data[i] = b_y_data[i];
      }

      size_tmp_idx_1 = (unsigned short)N_bitCnfg;
      if ((unsigned short)N_bitCnfg > 32767) {
        size_tmp_idx_1 = 32767U;
      }

      i = size_tmp_idx_1;
      for (k_t0 = 0; k_t0 < i; k_t0++) {
        for (state_k = 0; state_k < i1; state_k++) {
          for (k_tstState = 0; k_tstState < b_size; k_tstState++) {
            id2Bypass_size = ipos_size - 1;
            trueCount = 0;
            partialTrueCount = 0;
            for (loop_ub = 0; loop_ub <= id2Bypass_size; loop_ub++) {
              if (k_tstState + 1 == ipos_data[loop_ub]) {
                trueCount++;
                f_tmp_data[partialTrueCount] = (signed char)loop_ub;
                partialTrueCount++;
              }
            }

            /* VecIna219_k = find(k_groups == uGroupId); */
            for (k0 = 0; k0 < trueCount; k0++) {
              /* for k_ina219 = VecIna219_k */
              if (prm->seq.bit.BrdBeforePSflag[state_k] != 0) {
                for (i2 = 0; i2 < trueCount; i2++) {
                  b_VecIna219_data[i2] = (VecIna219_data[f_tmp_data[i2]] !=
                    VecIna219_data[f_tmp_data[k0]]);
                }

                VdebugVec_size_tmp = c_eml_find(b_VecIna219_data, trueCount,
                  id2Bypass_data);
                c_loop_ub = c_eml_find(b_VecIna219_data, trueCount,
                  id2Bypass_data);
                if (c_loop_ub - 1 >= 0) {
                  CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                                 prm->brd.spi.PortSpiRow_esp,
                                 prm->brd.spi.SwitchMat_esp,
                                 prm->brd.spi.PortSpiRow_esp2,
                                 prm->brd.spi.SwitchMat_esp2,
                                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                                 prm->brd.spi.bypass, SpiPortRowBypass,
                                 a__1_data, a__1_size, id0_data);
                }

                for (k1 = 0; k1 < VdebugVec_size_tmp; k1++) {
                  /* for k_bypass = VecIna219(id2Bypass) */
                  switch (ProjectFlag) {
                   case 2:
                    /* ESP32 */
                    /* TODO bypass */
                    break;

                   case 3:
                    /* ESP32 ser */
                    writePortToSpi4RowMask_ser(SpiPortRowBypass);

                    /* TODO bypass */
                    break;
                  }

                  pause(0.1);
                }

                bitCnfg_size[1] = b_VdebugVec_size[1];
                loop_ub = b_VdebugVec_size[2];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  b_loop_ub = b_VdebugVec_size[1];
                  for (i3 = 0; i3 < b_loop_ub; i3++) {
                    b_bitCnfg_data[i3 + bitCnfg_size[1] * i2] = bitCnfg_data
                      [(k_t0 + b_VdebugVec_size[0] * i3) + b_VdebugVec_size[0] *
                      b_VdebugVec_size[1] * i2];
                  }
                }

                Nina219[0] = prm->Nmax.NbatMax;
                Nina219[1] = prm->Nmax.NbatMax;
                d_bitCnfg_data.data = &b_bitCnfg_data[0];
                d_bitCnfg_data.size = &Nina219[0];
                d_bitCnfg_data.allocatedSize = 256;
                d_bitCnfg_data.numDimensions = 2;
                d_bitCnfg_data.canFreeData = false;
                b_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                                 prm->brd.spi.PortSpiRow_esp,
                                 prm->brd.spi.SwitchMat_esp,
                                 prm->brd.spi.PortSpiRow_esp2,
                                 prm->brd.spi.SwitchMat_esp2,
                                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                                 &d_bitCnfg_data, SpiPortRowBypass, a__1_data,
                                 a__1_size, id0_data);
                for (i2 = 0; i2 < d_loop_ub; i2++) {
                  for (i3 = 0; i3 < d_loop_ub; i3++) {
                    Pac2Vid0All_data[(((int)VecIna219_data[f_tmp_data[k0]] +
                                       Pac2Vid0All_size[0] * i3) +
                                      Pac2Vid0All_size[0] * d_loop_ub * i2) - 1]
                      = id0_data[i3 + (i2 << 4)];
                  }
                }

                /* sort(bitCnfg{k_bitCnfg})); */
                switch (ProjectFlag) {
                 case 2:
                  /* esp32 */
                  break;

                 case 3:
                  /* esp32 ser */
                  writePortToSpi4RowMask_ser(SpiPortRowBypass);
                  break;
                }
              } else {
                bitCnfg_size[1] = b_VdebugVec_size[1];
                loop_ub = b_VdebugVec_size[2];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  b_loop_ub = b_VdebugVec_size[1];
                  for (i3 = 0; i3 < b_loop_ub; i3++) {
                    b_bitCnfg_data[i3 + bitCnfg_size[1] * i2] = bitCnfg_data
                      [(k_t0 + b_VdebugVec_size[0] * i3) + b_VdebugVec_size[0] *
                      b_VdebugVec_size[1] * i2];
                  }
                }

                Nina219[0] = prm->Nmax.NbatMax;
                Nina219[1] = prm->Nmax.NbatMax;
                c_bitCnfg_data.data = &b_bitCnfg_data[0];
                c_bitCnfg_data.size = &Nina219[0];
                c_bitCnfg_data.allocatedSize = 256;
                c_bitCnfg_data.numDimensions = 2;
                c_bitCnfg_data.canFreeData = false;
                b_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                                 prm->brd.spi.PortSpiRow_esp,
                                 prm->brd.spi.SwitchMat_esp,
                                 prm->brd.spi.PortSpiRow_esp2,
                                 prm->brd.spi.SwitchMat_esp2,
                                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                                 &c_bitCnfg_data, SpiPortRowBypass, a__1_data,
                                 a__1_size, id0_data);
                for (i2 = 0; i2 < d_loop_ub; i2++) {
                  for (i3 = 0; i3 < d_loop_ub; i3++) {
                    Pac2Vid0All_data[(((int)VecIna219_data[f_tmp_data[k0]] +
                                       Pac2Vid0All_size[0] * i3) +
                                      Pac2Vid0All_size[0] * d_loop_ub * i2) - 1]
                      = id0_data[i3 + (i2 << 4)];
                  }
                }

                /* sort(bitCnfg{k_bitCnfg}));sort(bitCnfg{k_bitCnfg})); */
              }

              /*  calc V */
              bitCnfg_size[0] = 1;
              bitCnfg_size[1] = d_loop_ub;
              bitCnfg_size[2] = Pac2Vid0All_size[2];
              for (i2 = 0; i2 < d_loop_ub; i2++) {
                for (i3 = 0; i3 < d_loop_ub; i3++) {
                  b_bitCnfg_data[i3 + d_loop_ub * i2] = Pac2Vid0All_data[(((int)
                    VecIna219_data[f_tmp_data[k0]] + Pac2Vid0All_size[0] * i3) +
                    Pac2Vid0All_size[0] * d_loop_ub * i2) - 1];
                }
              }

              c_squeeze(b_bitCnfg_data, bitCnfg_size, id0_data, id2Bypass_data);

              /* Pac2Vid3(:,1); */
              id2Bypass_size = id2Bypass_data[0] * id2Bypass_data[1] - 1;
              b_trueCount = 0;
              for (loop_ub = 0; loop_ub <= id2Bypass_size; loop_ub++) {
                if (id0_data[loop_ub] > 0) {
                  b_trueCount++;
                }
              }

              partialTrueCount = (unsigned short)b_trueCount;
              if (partialTrueCount < 1) {
                partialTrueCount = 1;
              }

              if ((unsigned short)b_trueCount == 0) {
                partialTrueCount = 0;
              }

              c_vSumMax = prm->bat.Vd + (prm->bat.CutOffChrV[0] + 0.1F) * (float)
                partialTrueCount;

              /*  sumV      = sum(meanVbusTest(k_ina219,Pac2Vid31)); */
              switch (prm->seq.bit.ins[k_tstState + (state_k << 3)]) {
               case 1:
                /* kunkin kp184 */
                /* CC */
                pause(0.05);
                pause(0.05);
                break;

