romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
               case 2:
                /* ka6005p */
                e_sprintf(c_vSumMax, b_vSumMax);

                /* ['VSET',num2str(ch),':',num2str(Val)];%[V] */
                pause(0.05);
                f_sprintf(prm->seq.bit.IdisChr[k_tstState + (state_k << 3)],
                          d_prm);

                /* ['ISET',num2str(ch),':',num2str(Val)];%[A] */
                pause(0.05);
                break;

               case 3:
                /* juntek+ACDC */
                /* Imax); */
                i_prm[0] = prm->seq.bit.IdisChr[k_tstState + (state_k << 3)];
                i_prm[1] = ImaxAcDC;
                f = rt_roundf_snf(rt_roundf_snf(1000.0F * minimum(i_prm)) /
                                  1000.0F * 1000.0F);
                if (f < 2.14748365E+9F) {
                  if (f >= -2.14748365E+9F) {
                    i2 = (int)f;
                  } else {
                    i2 = MIN_int32_T;
                  }
                } else if (f >= 2.14748365E+9F) {
                  i2 = MAX_int32_T;
                } else {
                  i2 = 0;
                }

                g_sprintf(i2, r12);

                /* [':',juntek_address,'w11=',num2str(uint32(Val*1000),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                /*  disp(['Juntek: I=',num2str(IchargeBit)]); */
                pause(0.1);
                f = rt_roundf_snf(c_vSumMax * 100.0F);
                if (f < 2.14748365E+9F) {
                  if (f >= -2.14748365E+9F) {
                    i2 = (int)f;
                  } else {
                    i2 = MIN_int32_T;
                  }
                } else if (f >= 2.14748365E+9F) {
                  i2 = MAX_int32_T;
                } else {
                  i2 = 0;
                }

                g_sprintf(i2, r13);

                /* [':',juntek_address,'w10=',num2str(uint32(Val*100),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                /*  disp(['Juntek VSET=',num2str(vSumMax)]); */
                pause(0.1);

                /*  disp('juntek ON'); */
                break;
              }

              pause(0.2);

              /* switch board */
              if (prm->seq.bit.BrdBeforePSflag[state_k] == 0) {
                for (i2 = 0; i2 < trueCount; i2++) {
                  b_VecIna219_data[i2] = (VecIna219_data[f_tmp_data[i2]] !=
                    VecIna219_data[f_tmp_data[k0]]);
                }

                VdebugVec_size_tmp = c_eml_find(b_VecIna219_data, trueCount,
                  id2Bypass_data);
                c_loop_ub = c_eml_find(b_VecIna219_data, trueCount,
                  id2Bypass_data);
                if (c_loop_ub - 1 >= 0) {
                  CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                                 prm->brd.spi.PortSpiRow_esp,
                                 prm->brd.spi.SwitchMat_esp,
                                 prm->brd.spi.PortSpiRow_esp2,
                                 prm->brd.spi.SwitchMat_esp2,
                                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                                 prm->brd.spi.bypass, SpiPortRowBypass,
                                 a__1_data, a__1_size, id0_data);
                }

                for (k1 = 0; k1 < VdebugVec_size_tmp; k1++) {
                  /* for k_bypass = VecIna219(id2Bypass) */
                  /*                                for k_bypass = VecIna219(id2Bypass) */
                  switch (ProjectFlag) {
                   case 2:
                    /* ESP32 */
                    /* TODO bypass */
                    break;

                   case 3:
                    /* ESP32 ser */
                    writePortToSpi4RowMask_ser(SpiPortRowBypass);

                    /* TODO bypass */
                    break;
                  }

                  pause(0.1);
                }

                bitCnfg_size[1] = b_VdebugVec_size[1];
                loop_ub = b_VdebugVec_size[2];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  b_loop_ub = b_VdebugVec_size[1];
                  for (i3 = 0; i3 < b_loop_ub; i3++) {
                    b_bitCnfg_data[i3 + bitCnfg_size[1] * i2] = bitCnfg_data
                      [(k_t0 + b_VdebugVec_size[0] * i3) + b_VdebugVec_size[0] *
                      b_VdebugVec_size[1] * i2];
                  }
                }

                Nina219[0] = prm->Nmax.NbatMax;
                Nina219[1] = prm->Nmax.NbatMax;
                e_bitCnfg_data.data = &b_bitCnfg_data[0];
                e_bitCnfg_data.size = &Nina219[0];
                e_bitCnfg_data.allocatedSize = 256;
                e_bitCnfg_data.numDimensions = 2;
                e_bitCnfg_data.canFreeData = false;
                b_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                                 prm->brd.spi.PortSpiRow_esp,
                                 prm->brd.spi.SwitchMat_esp,
                                 prm->brd.spi.PortSpiRow_esp2,
                                 prm->brd.spi.SwitchMat_esp2,
                                 prm->brd.spi.Pac2Vid, prm->brd.spi.Pac2Vid2,
                                 &e_bitCnfg_data, SpiPortRowBypass, a__1_data,
                                 a__1_size, id0_data);
                for (i2 = 0; i2 < d_loop_ub; i2++) {
                  for (i3 = 0; i3 < d_loop_ub; i3++) {
                    Pac2Vid0All_data[(((int)VecIna219_data[f_tmp_data[k0]] +
                                       Pac2Vid0All_size[0] * i3) +
                                      Pac2Vid0All_size[0] * d_loop_ub * i2) - 1]
                      = id0_data[i3 + (i2 << 4)];
                  }
                }

                /* sort(bitCnfg{k_bitCnfg})); */
                switch (ProjectFlag) {
                 case 2:
                  /* esp32 */
                  break;

                 case 3:
                  /* esp32 ser */
                  writePortToSpi4RowMask_ser(SpiPortRowBypass);
                  break;
                }
              }

              /* switch board - End */
              pause(0.2);
              switch (ProjectFlag) {
               case 2:
                /* esp32 */
                /*  [VbrdChr(k_bitCnfg,k_ina219,k_bitIchr,:),IbrdChr(k_bitCnfg,k_ina219,k_bitIchr,:),~,~,errI2C,~] = readI2cVIfastTicTocV5_Rratio(Esp32_v1(k_ina219),true,true,true,VIpacId(k_ina219,:),Pac2Vid0,squeeze(polyFitPacV(k_ina219,:,:)),squeeze(Rval(k_ina219,:,:)),N_bat1,N_bat2); */
                k_groups_tmp = f_tmp_data[k0];
                for (i2 = 0; i2 < 16; i2++) {
                  g_prm[i2] = prm->brd.pac.VIpacId[((int)
                    VecIna219_data[k_groups_tmp] + (i2 << 1)) - 1];
                }

                bitCnfg_size[0] = 1;
                bitCnfg_size[1] = d_loop_ub;
                bitCnfg_size[2] = Pac2Vid0All_size[2];
                for (i2 = 0; i2 < d_loop_ub; i2++) {
                  for (i3 = 0; i3 < d_loop_ub; i3++) {
                    b_bitCnfg_data[i3 + d_loop_ub * i2] = Pac2Vid0All_data
                      [(((int)VecIna219_data[k_groups_tmp] + Pac2Vid0All_size[0]
                         * i3) + Pac2Vid0All_size[0] * d_loop_ub * i2) - 1];
                  }
                }

