romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
                c_loop_ub = (int)VecIna219_data[k_groups_tmp] - 1;
                i_prm[0] = pIacs758_data[c_loop_ub];
                i_prm[1] = pIacs758_data[c_loop_ub + pIacs758_size[0]];
                b_Rwire_size[0] = 1;
                loop_ub = Rwire_size[1];
                b_Rwire_size[1] = Rwire_size[1];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  e_prm[i2] = Rwire_data[c_loop_ub + Rwire_size[0] * i2];
                }

                ReadVI(ProjectFlag, g_prm, b_bitCnfg_data, bitCnfg_size, N_bat1,
                       N_bat_tmp_tmp_tmp, i_prm, Iacs758Flag, kEst_data,
                       kEst_size, e_prm, b_Rwire_size, a__36_data,
                       c_VmKp184Test_data, &partialTrueCount, tvv_data,
                       &VdebugVec_size_tmp, Rtot_data, Rtot_size, a__38_data,
                       id2Bypass_data, a__39_data, b_VmV_size, a__40_data,
                       tii_size, b_VmV_data, &id2Bypass_size, a__42_data,
                       a__4_size, I_data, &k_ina219_, outVI, b_tmp_size,
                       VdebugVec_data, VdebugVec_size, &showVdiff, (double *)
                       &b_dv0, errI2C_size);
                loop_ub = Vbrd->size[3];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  VbusTest2_data[((k_t0 + Vbrd->size[0] * c_loop_ub) +
                                  Vbrd->size[0] * Vbrd->size[1] * Vbrd->size[2] *
                                  i2) + Vbrd->size[0] * Vbrd->size[1] *
                    Vbrd->size[2] * Vbrd->size[3] * state_k] =
                    c_VmKp184Test_data[i2];
                }

                loop_ub = Ibrd->size[3];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  IshuntTest2_data[((k_t0 + Ibrd->size[0] * c_loop_ub) +
                                    Ibrd->size[0] * Ibrd->size[1] * Ibrd->size[2]
                                    * i2) + Ibrd->size[0] * Ibrd->size[1] *
                    Ibrd->size[2] * Ibrd->size[3] * state_k] = tvv_data[i2];
                }

                /*  read V,I */
                break;

               case 3:
                /* esp32 ser */
                /*  [VbrdChr(k_bitCnfg,k_ina219,k_bitIchr,:),IbrdChr(k_bitCnfg,k_ina219,k_bitIchr,:),~,~,errI2C,~] = readI2cVIfastTicTocV5_Rratio_ser(Esp32_v1(k_ina219),true,true,prm.brd.pac.Rshunt(k_ina219),VIpacId(k_ina219,:),Pac2Vid0,squeeze(polyFitPacV(k_ina219,:,:)),squeeze(Rval(k_ina219,:,:)),N_bat1,N_bat2); */
                k_groups_tmp = f_tmp_data[k0];
                for (i2 = 0; i2 < 16; i2++) {
                  g_prm[i2] = prm->brd.pac.VIpacId[((int)
                    VecIna219_data[k_groups_tmp] + (i2 << 1)) - 1];
                }

                bitCnfg_size[0] = 1;
                bitCnfg_size[1] = d_loop_ub;
                bitCnfg_size[2] = Pac2Vid0All_size[2];
                for (i2 = 0; i2 < d_loop_ub; i2++) {
                  for (i3 = 0; i3 < d_loop_ub; i3++) {
                    b_bitCnfg_data[i3 + d_loop_ub * i2] = Pac2Vid0All_data
                      [(((int)VecIna219_data[k_groups_tmp] + Pac2Vid0All_size[0]
                         * i3) + Pac2Vid0All_size[0] * d_loop_ub * i2) - 1];
                  }
                }

                c_loop_ub = (int)VecIna219_data[k_groups_tmp] - 1;
                i_prm[0] = pIacs758_data[c_loop_ub];
                i_prm[1] = pIacs758_data[c_loop_ub + pIacs758_size[0]];
                b_Rwire_size[0] = 1;
                loop_ub = Rwire_size[1];
                b_Rwire_size[1] = Rwire_size[1];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  e_prm[i2] = Rwire_data[c_loop_ub + Rwire_size[0] * i2];
                }

                ReadVI(ProjectFlag, g_prm, b_bitCnfg_data, bitCnfg_size, N_bat1,
                       N_bat_tmp_tmp_tmp, i_prm, Iacs758Flag, kEst_data,
                       kEst_size, e_prm, b_Rwire_size, a__36_data,
                       c_VmKp184Test_data, &partialTrueCount, tvv_data,
                       &VdebugVec_size_tmp, Rtot_data, Rtot_size, a__38_data,
                       id2Bypass_data, a__39_data, b_VmV_size, a__40_data,
                       tii_size, b_VmV_data, &id2Bypass_size, a__42_data,
                       a__4_size, I_data, &k_ina219_, outVI, b_tmp_size,
                       VdebugVec_data, VdebugVec_size, &showVdiff, (double *)
                       &b_dv0, errI2C_size);
                loop_ub = Vbrd->size[3];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  VbusTest2_data[((k_t0 + Vbrd->size[0] * c_loop_ub) +
                                  Vbrd->size[0] * Vbrd->size[1] * Vbrd->size[2] *
                                  i2) + Vbrd->size[0] * Vbrd->size[1] *
                    Vbrd->size[2] * Vbrd->size[3] * state_k] =
                    c_VmKp184Test_data[i2];
                }

                loop_ub = Ibrd->size[3];
                for (i2 = 0; i2 < loop_ub; i2++) {
                  IshuntTest2_data[((k_t0 + Ibrd->size[0] * c_loop_ub) +
                                    Ibrd->size[0] * Ibrd->size[1] * Ibrd->size[2]
                                    * i2) + Ibrd->size[0] * Ibrd->size[1] *
                    Ibrd->size[2] * Ibrd->size[3] * state_k] = tvv_data[i2];
                }

                /*  read V,I */
                break;
              }

              switch (prm->seq.bit.meas.V[k_tstState + (state_k << 3)]) {
               case 1:
                /* kunkin kp184 */
                pause(0.1);
                ControlKp184((double *)&N0, a__3_size, (double *)&a__4_data,
                             a__4_size, (double *)&b_dv0, errI2C_size, (double *)
                             &a__16_data, id2Bypass_data);
                Iacs758_cal_data[(k_t0 + VbitInsMeas->size[0] * ((int)
                  VecIna219_data[f_tmp_data[k0]] - 1)) + VbitInsMeas->size[0] *
                  VbitInsMeas->size[1] * VbitInsMeas->size[2] * state_k] =
                  (float)b_dv0 - prm->seq.bit.meas.Vd[k_tstState + (state_k << 3)];
                break;

