romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
               case 2:
                /* ka6005p */
                /* read I */
                d_tmp_data = d_rand();
                Iacs758_cal_data[(k_t0 + VbitInsMeas->size[0] * ((int)
                  VecIna219_data[f_tmp_data[k0]] - 1)) + VbitInsMeas->size[0] *
                  VbitInsMeas->size[1] * VbitInsMeas->size[2] * state_k] =
                  (float)(d_tmp_data * 2.5 + 2.0) - prm->
                  seq.bit.meas.Vd[k_tstState + (state_k << 3)];
                break;

               case 3:
                /* juntek+ACDC */
                pause(0.1);
                b_controlJuntekDPH8920((double *)&d_tmp_data, b_tmp_size);
                d_tmp_data = (float)d_tmp_data - prm->seq.bit.meas.Vd[k_tstState
                  + (state_k << 3)];
                Iacs758_cal_data[(k_t0 + VbitInsMeas->size[0] * ((int)
                  VecIna219_data[f_tmp_data[k0]] - 1)) + VbitInsMeas->size[0] *
                  VbitInsMeas->size[1] * VbitInsMeas->size[2] * state_k] =
                  d_tmp_data;
                break;
              }

              switch (prm->seq.bit.meas.b_I[k_tstState + (state_k << 3)]) {
               case 1:
                /* kunkin kp184 */
                pause(0.1);
                ControlKp184((double *)&N0, a__3_size, (double *)&a__4_data,
                             a__4_size, (double *)&b_dv0, errI2C_size, (double *)
                             &d_tmp_data, b_tmp_size);
                break;

               case 2:
                /* ka6005p */
                /* read I */
                d_rand();
                break;

               case 3:
                /* juntek+ACDC */
                controlJuntekDPH8920(r30.data, r30.size);
                break;
              }

              switch (ProjectFlag) {
               case 2:
                /* esp32 */
                break;

               case 3:
                /* esp32 ser */
                writePortToSpi4RowMask_ser(disConAll);
                break;
              }

              bitCnfg_size[0] = 1;
              bitCnfg_size[1] = d_loop_ub;
              bitCnfg_size[2] = Pac2Vid0All_size[2];
              for (i2 = 0; i2 < d_loop_ub; i2++) {
                for (i3 = 0; i3 < d_loop_ub; i3++) {
                  b_bitCnfg_data[i3 + d_loop_ub * i2] = Pac2Vid0All_data[(((int)
                    VecIna219_data[f_tmp_data[k0]] + Pac2Vid0All_size[0] * i3) +
                    Pac2Vid0All_size[0] * d_loop_ub * i2) - 1];
                }
              }

              c_squeeze(b_bitCnfg_data, bitCnfg_size, id0_data, id2Bypass_data);
              id2Bypass_size = id2Bypass_data[0] * id2Bypass_data[1] - 1;
              b_trueCount = 0;
              partialTrueCount = 0;
              for (loop_ub = 0; loop_ub <= id2Bypass_size; loop_ub++) {
                if (id0_data[loop_ub] > 0) {
                  b_trueCount++;
                  i_tmp_data[partialTrueCount] = (unsigned char)loop_ub;
                  partialTrueCount++;
                }
              }

              Ibrd_size[0] = 1;
              Ibrd_size[1] = 1;
              Ibrd_size[2] = 1;
              Ibrd_size[3] = b_trueCount;
              for (i2 = 0; i2 < b_trueCount; i2++) {
                VmV_data[i2] = IshuntTest2_data[((k_t0 + Ibrd->size[0] * ((int)
                  VecIna219_data[f_tmp_data[k0]] - 1)) + Ibrd->size[0] *
                  Ibrd->size[1] * Ibrd->size[2] * (id0_data[i_tmp_data[i2]] - 1))
                  + Ibrd->size[0] * Ibrd->size[1] * Ibrd->size[2] * Ibrd->size[3]
                  * state_k];
              }

              b_dv0 = VecIna219_data[f_tmp_data[k0]];
              ImKp184Test2_data[(k_t0 + meanIbrd->size[0] * ((int)b_dv0 - 1)) +
                meanIbrd->size[0] * meanIbrd->size[1] * meanIbrd->size[2] *
                state_k] = b_mean(VmV_data, Ibrd_size);
              b_meanIbrd0 = ImKp184Test2_data[(k_t0 + meanIbrd->size[0] * ((int)
                b_dv0 - 1)) + meanIbrd->size[0] * meanIbrd->size[1] *
                meanIbrd->size[2] * state_k];
              i2 = k_tstState + (state_k << 3);
              if (prm->seq.bit.chr[i2] != 0) {
                b_meanIbrd0 = -b_meanIbrd0;
              }

              showVdiff = true;
              f = prm->seq.bit.IdisChr[i2];
              if ((float)fabs((float)b_meanIbrd0 - f) > prm->seq.bit.dIthr) {
                d_sprintf(b_meanIbrd0, meanIbrd0);
                k_sprintf(f, r14);
                k_sprintf(f, r15);
                if (b_dv0 < 2.147483648E+9) {
                  i2 = (int)b_dv0;
                } else {
                  i2 = MAX_int32_T;
                }

                b_sprintf(i2, r16);
                for (id2Bypass_size = 0; id2Bypass_size < b_trueCount;
                     id2Bypass_size++) {
                  printf("%d\n", (int)id0_data[i_tmp_data[id2Bypass_size]]);
                  fflush(stdout);
                }

                showVdiff = false;
              }

              Ibrd_size[0] = 1;
              Ibrd_size[1] = 1;
              Ibrd_size[2] = 1;
              Ibrd_size[3] = b_trueCount;
              for (i2 = 0; i2 < b_trueCount; i2++) {
                VmV_data[i2] = VbusTest2_data[((k_t0 + Vbrd->size[0] * ((int)
                  b_dv0 - 1)) + Vbrd->size[0] * Vbrd->size[1] * Vbrd->size[2] *
                  (id0_data[i_tmp_data[i2]] - 1)) + Vbrd->size[0] * Vbrd->size[1]
                  * Vbrd->size[2] * Vbrd->size[3] * state_k];
              }

              b_dv0 = sum(VmV_data, Ibrd_size) - Iacs758_cal_data[(k_t0 +
                VbitInsMeas->size[0] * ((int)b_dv0 - 1)) + VbitInsMeas->size[0] *
                VbitInsMeas->size[1] * VbitInsMeas->size[2] * state_k];
              if ((fabs(b_dv0) > prm->seq.bit.dVthr) && showVdiff) {
                d_sprintf(b_dv0, dv0);
                d_tmp_data = VecIna219_data[f_tmp_data[k0]];
                if (d_tmp_data < 2.147483648E+9) {
                  i2 = (int)d_tmp_data;
                } else {
                  i2 = MAX_int32_T;
                }

                b_sprintf(i2, r17);
                for (id2Bypass_size = 0; id2Bypass_size < b_trueCount;
                     id2Bypass_size++) {
                  printf("%d\n", (int)id0_data[i_tmp_data[id2Bypass_size]]);
                  fflush(stdout);
                }
              }

              /*  for k_bitI = 1:N_bitI */
            }

            /*  for k_ina219 = VecIna219_k */
          }

          /*  for k_groups = 1:length(uGroups) */
        }

        /*  for k_bitState = 1:NstBit */
      }

      /*  for k_bitCnfg = 1:N_bitCnfg */
    }

    /*  if prm.bit.bit_flag */
    /*  End - Bit */
    /*  Run parameters */
    /*  = 1;%[V] */
    /*      = 2e4; */
    N_bitCnfg = prm->run.Nt0;

    /*      = 2e4; */
    /* ,[8 1024 16],[1 1 1]); */
    /*  SelVsT = zeros(Nt0,1); */
    /*  SelDualVsT = zeros(Nina219,Nt0); */
    /* [16 32 1024],[1 1 1]); */
    /* [512 1024],[1 1]); */
    /* [16 32 1024],[1 1 1]); */
    i = (int)(prm->brd.Nina219 * (double)prm->brd.N_bat);
    i1 = b_Vbat->size[0] * b_Vbat->size[1];
    b_Vbat->size[0] = i;
    b_Vbat->size[1] = prm->run.Nt0;
    emxEnsureCapacity_int8_T(b_Vbat, i1);
    Vbat_data = b_Vbat->data;
    id2Bypass_size = i * prm->run.Nt0;
    for (i1 = 0; i1 < id2Bypass_size; i1++) {
      Vbat_data[i1] = 0;
    }

    i1 = Vbat->size[0] * Vbat->size[1];
    Vbat->size[0] = b_Vbat->size[0];
    Vbat->size[1] = b_Vbat->size[1];
    emxEnsureCapacity_real_T(Vbat, i1);
    ImKp184Test2_data = Vbat->data;
    for (i1 = 0; i1 < id2Bypass_size; i1++) {
      ImKp184Test2_data[i1] = 0.0;
    }

    i1 = IbatMat->size[0] * IbatMat->size[1] * IbatMat->size[2];
    IbatMat->size[0] = (int)prm->brd.Nina219;
    IbatMat->size[1] = prm->brd.N_bat;
    IbatMat->size[2] = prm->run.Nt0;
    emxEnsureCapacity_real_T(IbatMat, i1);
    Iacs758_cal_data = IbatMat->data;
    c_loop_ub_tmp *= prm->run.Nt0;
    for (i1 = 0; i1 < c_loop_ub_tmp; i1++) {
      Iacs758_cal_data[i1] = 0.0;
    }

    i1 = VbatMat->size[0] * VbatMat->size[1] * VbatMat->size[2];
    VbatMat->size[0] = (int)prm->brd.Nina219;
    VbatMat->size[1] = prm->brd.N_bat;
    VbatMat->size[2] = prm->run.Nt0;
    emxEnsureCapacity_real_T(VbatMat, i1);
    VbatMat_data = VbatMat->data;
    for (i1 = 0; i1 < c_loop_ub_tmp; i1++) {
      VbatMat_data[i1] = 0.0;
    }

    i1 = VbatMat0->size[0] * VbatMat0->size[1] * VbatMat0->size[2];
    VbatMat0->size[0] = (int)prm->brd.Nina219;
    VbatMat0->size[1] = prm->brd.N_bat;
    VbatMat0->size[2] = prm->run.Nt0;
    emxEnsureCapacity_real_T(VbatMat0, i1);
    VbatMat0_data = VbatMat0->data;
    for (i1 = 0; i1 < c_loop_ub_tmp; i1++) {
      VbatMat0_data[i1] = 0.0;
    }

    i1 = b_Vbat->size[0] * b_Vbat->size[1];
    b_Vbat->size[0] = i;
    b_Vbat->size[1] = prm->run.Nt0;
    emxEnsureCapacity_int8_T(b_Vbat, i1);
    Vbat_data = b_Vbat->data;
    for (i = 0; i < id2Bypass_size; i++) {
      Vbat_data[i] = 0;
    }

    i = tV1->size[0] * tV1->size[1];
    tV1->size[0] = b_Vbat->size[0];
    tV1->size[1] = b_Vbat->size[1];
    emxEnsureCapacity_real_T(tV1, i);
    tV1_data = tV1->data;
    for (i = 0; i < id2Bypass_size; i++) {
      tV1_data[i] = 0.0;
    }

    i = tV->size[0] * tV->size[1] * tV->size[2];
    tV->size[0] = (int)prm->brd.Nina219;
    tV->size[1] = prm->brd.N_bat;
    tV->size[2] = prm->run.Nt0;
    emxEnsureCapacity_real_T(tV, i);
    tV_data = tV->data;
    for (i = 0; i < c_loop_ub_tmp; i++) {
      tV_data[i] = 0.0;
    }

    /*  Ishunt = zeros(Nina219,N_bat,Nt); */
    /* [1 1024],[1 1]); */
    /* ,[16 1024],[1 1]); */
    /*  coder.varsize('Pac2Vid0All',[16 32 32],[1 1 1]); */
    Pac2Vid0All_size[0] = (int)prm->brd.Nina219;
    Pac2Vid0All_size[1] = prm->brd.N_bat;
    Pac2Vid0All_size[2] = prm->brd.N_bat;
    if (end - 1 >= 0) {
      memset(&Pac2Vid0All_data[0], 0, (unsigned int)end * sizeof(unsigned char));
    }

    /*  RegStateMat = zeros(1,Nt0); */
    /*  strabcd = char(uint32('A')+uint32([0:N_bat-1]')); */
    /*  ina219State  = 0; */
    /*  kp184State   = 0; */
    /*  i_in = repmat(5,1,Nt);%[A] */
    /*  t = [0:50e3]; */
    /*  i = 6*abs(sin(2*pi/500*t)); */
    /*  if true */
    /*      bl = fir1(34,0.02,'low',chebwin(35,30)); */
    /*      %figure;freqz(bhi,1) */
    /*      i_in = filter(bl,1,i);%i_in_read(1:1370,2)); */
    /*  else */
    /*      i_in = i; */
    /*  end */
    /*  if juntek_Flag */
    /*      i_in = ImaxAcDC*ones(size(i_in)); */
    /*  end */
    /*  i_in = round(i_in*1000)/1000; */
    /*  */
    /*  if juntekOnlyChr_Flag */
    /*      i_in = ImaxAcDC*ones(size(i_in)); */
    /*  end */
    ImaxDis = prm->bat.ImaxDis;

    /* 15;%35;%maximum current from discharge bat */
    Icharge = prm->bat.Icharge;

