romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
    /* 5;%15;%;25;%5;%[A] */
    IchargePhase2_tmp_tmp = prm->bat.IchargePhase2;

    /* 2.5;%;15;%2.5;%2.5;%2.5;%[A] */
    IchargePhase2t = prm->bat.IchargePhase2;

    /* prm.bat.IchargePhase2t;%IchargePhase2; */
    IchargePhase3 = prm->bat.IchargePhase3;

    /* 2;%0.5;%0.3;%0.2;%[A] */
    /* 2;%4;%7;%0.4;%6.5*0.03; */
    /* 0.5;%3;%0.2; */
    /* 2.8;%2.7;%3.0;%2.8;%[V] */
    /* 4.1;%3.6;%4.1;%25;%4.1;%[V] */
    /*  seq            = prm.seq(prm.run.seq); */
    i = SelDual->size[0] * SelDual->size[1];
    SelDual->size[0] = 1;
    SelDual->size[1] = (int)prm->brd.Nina219;
    emxEnsureCapacity_real_T(SelDual, i);
    SelDual_data = SelDual->data;
    for (i = 0; i < b_loop_ub_tmp; i++) {
      SelDual_data[i] = 0.0;
    }

    i = SelDualHelp->size[0] * SelDualHelp->size[1];
    SelDualHelp->size[0] = 1;
    SelDualHelp->size[1] = (int)prm->brd.Nina219;
    emxEnsureCapacity_real_T(SelDualHelp, i);
    SelDualHelp_data = SelDualHelp->data;
    for (i = 0; i < b_loop_ub_tmp; i++) {
      SelDualHelp_data[i] = 0.0;
    }

    for (id2Bypass_size = 0; id2Bypass_size < b_size; id2Bypass_size++) {
      for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
        if (b_data[id2Bypass_size] == prm->ser.com.grp[tmp_data[loop_ub]]) {
          SelDual_data[loop_ub] = prm->seq.chr[id2Bypass_size];
        }
      }
    }

    /* display V & I on command window */
    /* %%%%%%% read voltage and current %%%%%%%%%%% */
    i = tLastToggle->size[0] * tLastToggle->size[1];
    tLastToggle->size[0] = 1;
    tLastToggle->size[1] = (int)prm->brd.Nina219;
    emxEnsureCapacity_real_T(tLastToggle, i);
    tLastToggle_data = tLastToggle->data;
    for (i = 0; i < b_loop_ub_tmp; i++) {
      tLastToggle_data[i] = 0.0;
    }

    k_t = 1.0;
    k_t0 = 0;
    i = switchFlag->size[0] * switchFlag->size[1];
    switchFlag->size[0] = 1;
    switchFlag->size[1] = (int)prm->brd.Nina219;
    emxEnsureCapacity_boolean_T(switchFlag, i);
    switchFlag_data = switchFlag->data;
    for (i = 0; i < b_loop_ub_tmp; i++) {
      switchFlag_data[i] = true;
    }

    i = switchFlagHelp->size[0] * switchFlagHelp->size[1];
    switchFlagHelp->size[0] = 1;
    switchFlagHelp->size[1] = (int)prm->brd.Nina219;
    emxEnsureCapacity_boolean_T(switchFlagHelp, i);
    switchFlagHelp_data = switchFlagHelp->data;
    for (i = 0; i < b_loop_ub_tmp; i++) {
      switchFlagHelp_data[i] = false;
    }

    i = changeConfigFlag->size[0] * changeConfigFlag->size[1];
    changeConfigFlag->size[0] = 1;
    changeConfigFlag->size[1] = (int)prm->brd.Nina219;
    emxEnsureCapacity_boolean_T(changeConfigFlag, i);
    changeConfigFlag_data = changeConfigFlag->data;
    for (i = 0; i < b_loop_ub_tmp; i++) {
      changeConfigFlag_data[i] = false;
    }

    tic();
    keepMeas = true;
    toc();
    onPowerFlag = false;
    state_k = 0;
    g_IchargeAct = 0.0;
    if (prm->seq.Nst == 0) {
      /*      coder.varsize('outStruct.VbusTest','outStruct.VmKp184Test',[Nmax.NbrdMax,Nmax.NbatMax],[1 1]); */
      if (prm->brd.Nina219 < 1.0) {
        loop_ub_tmp = 0;
      } else {
        loop_ub_tmp = (int)prm->brd.Nina219;
      }

      i = outStruct->VbusTest->size[0] * outStruct->VbusTest->size[1];
      outStruct->VbusTest->size[0] = loop_ub_tmp;
      outStruct->VbusTest->size[1] = prm->brd.N_bat;
      emxEnsureCapacity_real_T(outStruct->VbusTest, i);
      for (i = 0; i < N_bat_tmp_tmp_tmp; i++) {
        for (i1 = 0; i1 < loop_ub_tmp; i1++) {
          outStruct->VbusTest->data[i1 + outStruct->VbusTest->size[0] * i] =
            VbusTest_data[i1 + (int)Nina219_tmp_tmp * i];
        }
      }

      i = outStruct->VmKp184Test->size[0] * outStruct->VmKp184Test->size[1];
      outStruct->VmKp184Test->size[0] = loop_ub_tmp;
      outStruct->VmKp184Test->size[1] = VmKp184Test_size_idx_1;
      emxEnsureCapacity_real_T(outStruct->VmKp184Test, i);
      for (i = 0; i < VmKp184Test_size_idx_1; i++) {
        for (i1 = 0; i1 < loop_ub_tmp; i1++) {
          outStruct->VmKp184Test->data[i1 + outStruct->VmKp184Test->size[0] * i]
            = VmKp184Test_data[i1 + VmKp184Test_size_idx_0 * i];
        }
      }
    } else {
      /* Init Plots */
      if (end - 1 >= 0) {
        memset(&BattConfigPerIna_data[0], 0, (unsigned int)end * sizeof(double));
      }

      /* nadav coder */
      if ((prm->seq.pwr.VthFlag[0] == 1) || (prm->seq.pwr.VthFlag[0] == 2)) {
        i = r2->size[0] * r2->size[1] * r2->size[2];
        r2->size[0] = (int)prm->brd.Nina219;
        r2->size[1] = prm->brd.N_bat;
        r2->size[2] = prm->brd.N_bat;
        emxEnsureCapacity_uint8_T(r2, i);
        r31 = r2->data;
        for (i = 0; i < end; i++) {
          r31[i] = 0U;
        }

        b_ReadVI(prm->brd.Nina219, prm->ins.ProjectFlag, prm->brd.pac.VIpacId,
                 (unsigned char *)r2->data, r2->size, prm->brd.N_bat1,
                 prm->brd.N_bat, pIacs758_data, pIacs758_size,
                 prm->brd.pac.Iacs758Flag, kEst_data, kEst_size, Rwire_data,
                 Rwire_size, a__64_data, b_VdebugVec_data, &id2Bypass_size,
                 VbusTest_data, &k_ina219_, Rtot_data, Rtot_size, a__38_data,
                 id2Bypass_data, a__39_data, b_VmV_size, a__40_data, tii_size,
                 VmKp184Test_data, &c_loop_ub, a__42_data, a__4_size, a__72_data,
                 &partialTrueCount, outVI, b_tmp_size, VdebugVec_data,
                 VdebugVec_size, &showVdiff, (double *)&b_dv0, errI2C_size);

        /*  read V,I */
        if ((int)prm->brd.Nina219 - 1 >= 0) {
          if (prm->brd.N_bat < 1) {
            y->size[0] = 1;
            y->size[1] = 0;
          } else {
            i = y->size[0] * y->size[1];
            y->size[0] = 1;
            y->size[1] = prm->brd.N_bat;
            emxEnsureCapacity_real_T(y, i);
            y_data = y->data;
            loop_ub = prm->brd.N_bat - 1;
            for (i = 0; i <= loop_ub; i++) {
              y_data[i] = (double)i + 1.0;
            }
          }

          e_loop_ub = y->size[1];
        }

        for (c_loop_ub = 0; c_loop_ub < b_loop_ub_tmp; c_loop_ub++) {
          b_dv0 = (((double)c_loop_ub + 1.0) - 1.0) * (double)N_bat_tmp_tmp_tmp;
          VdebugVec_size_tmp = y->size[1];
          for (i = 0; i < e_loop_ub; i++) {
            j_tmp_data[i] = (signed char)((signed char)(b_dv0 + y_data[i]) - 1);
          }

