romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
          for (i = 0; i < VdebugVec_size_tmp; i++) {
            ImKp184Test2_data[j_tmp_data[i]] = a__38_data[c_loop_ub +
              id2Bypass_data[0] * i];
          }

          i = (int)SelDual_data[c_loop_ub];
          if (i == 0) {
            e_padArrUint8(prm->cnfg.BattConfigDis1, N_bat_tmp_tmp_tmp,
                          N_bat_tmp_tmp_tmp, r3);
            r31 = r3->data;
            i = r->size[0] * r->size[1];
            r->size[0] = r3->size[0];
            r->size[1] = r3->size[1];
            emxEnsureCapacity_real_T(r, i);
            b_y_data = r->data;
            loop_ub = r3->size[0] * r3->size[1];
            for (i = 0; i < loop_ub; i++) {
              b_y_data[i] = r31[i];
            }

            for (i = 0; i < d_loop_ub; i++) {
              for (i1 = 0; i1 < d_loop_ub; i1++) {
                BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                  b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub * i];
              }
            }

            /* nadav coder */
            /*  BattConfigPerIna{k_ina219} = prm.cnfg.BattConfigDis1;%BattConfigPerInaHelp{k_ina219}; */
            /*  BattConfig{k_ina219}       = BattConfigPerIna{k_ina219} + (k_ina219-1)*N_bat; */
          } else if (i == 1) {
            e_padArrUint8(prm->cnfg.BattConfigChr1, N_bat_tmp_tmp_tmp,
                          N_bat_tmp_tmp_tmp, r3);
            r31 = r3->data;
            i = r->size[0] * r->size[1];
            r->size[0] = r3->size[0];
            r->size[1] = r3->size[1];
            emxEnsureCapacity_real_T(r, i);
            b_y_data = r->data;
            loop_ub = r3->size[0] * r3->size[1];
            for (i = 0; i < loop_ub; i++) {
              b_y_data[i] = r31[i];
            }

            for (i = 0; i < d_loop_ub; i++) {
              for (i1 = 0; i1 < d_loop_ub; i1++) {
                BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                  b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub * i];
              }
            }

            /* nadav coder */
            /*  BattConfigPerIna{k_ina219} = prm.cnfg.BattConfigChr1;%BattConfigPerInaHelp{k_ina219}; */
            /*  BattConfig{k_ina219}       = BattConfigPerIna{k_ina219} + (k_ina219-1)*N_bat; */
          }
        }
      }

      if (end - 1 >= 0) {
        memcpy(&BattConfigPerInaHelp_data[0], &BattConfigPerIna_data[0],
               (unsigned int)end * sizeof(double));
      }

      /*  main while */
      exitg1 = false;
      while ((!exitg1) && keepMeas) {
        /*      try */
        toc00 = toc();
        i = b_changeConfigFlag->size[0] * b_changeConfigFlag->size[1];
        b_changeConfigFlag->size[0] = 1;
        if (switchFlag->size[1] == 1) {
          loop_ub = changeConfigFlag->size[1];
        } else {
          loop_ub = switchFlag->size[1];
        }

        b_changeConfigFlag->size[1] = loop_ub;
        emxEnsureCapacity_boolean_T(b_changeConfigFlag, i);
        b_changeConfigFlag_data = b_changeConfigFlag->data;
        b_trueCount = (changeConfigFlag->size[1] != 1);
        for (i = 0; i < loop_ub; i++) {
          id2Bypass_size = i * b_trueCount;
          b_changeConfigFlag_data[i] = (changeConfigFlag_data[id2Bypass_size] ||
            switchFlag_data[id2Bypass_size]);
        }

        if (b_any(b_changeConfigFlag)) {
          /* Off power and load */
          pause(0.1);
          onPowerFlag = true;
          pause(0.1);
        }

        /*  if change: limit Vchr calculation + Off power and load - End */
        b_guard1 = false;
        if ((prm->seq.pwr.VthFlag[state_k] == 1) || (prm->
             seq.pwr.VthFlag[state_k] == 2)) {
          /*  BattConfigAct = BattConfigAct(:); */
          if (Nina219_tmp_tmp < 1.0) {
            y->size[0] = 1;
            y->size[1] = 0;
          } else {
            i = y->size[0] * y->size[1];
            y->size[0] = 1;
            y->size[1] = (int)(Nina219_tmp_tmp - 1.0) + 1;
            emxEnsureCapacity_real_T(y, i);
            y_data = y->data;
            loop_ub = (int)(Nina219_tmp_tmp - 1.0);
            for (i = 0; i <= loop_ub; i++) {
              y_data[i] = (double)i + 1.0;
            }
          }

          i = b_y->size[0];
          b_y->size[0] = y->size[1];
          emxEnsureCapacity_real_T(b_y, i);
          b_y_data = b_y->data;
          loop_ub = y->size[1];
          for (i = 0; i < loop_ub; i++) {
            b_y_data[i] = y_data[i];
          }

          loop_ub = y->size[1];
          for (i = 0; i < loop_ub; i++) {
            VecIna219_data[i] = b_y_data[i];
          }

          if (b_size - 1 >= 0) {
            b_end = ipos_size - 1;
          }

          for (k_tstState = 0; k_tstState < b_size; k_tstState++) {
            trueCount = 0;
            partialTrueCount = 0;
            for (loop_ub = 0; loop_ub <= b_end; loop_ub++) {
              if (k_tstState + 1 == ipos_data[loop_ub]) {
                trueCount++;
                k_tmp_data[partialTrueCount] = (signed char)loop_ub;
                partialTrueCount++;
              }
            }

            /* VecIna219_k = find(k_groups == uGroupId); */
            AllBypassPerGroup_size[0] = 1;
            AllBypassPerGroup_size[1] = trueCount;
            for (i = 0; i < trueCount; i++) {
              AllBypassPerGroup_data[i] = switchFlag_data[(int)
                VecIna219_data[k_tmp_data[i]] - 1];
            }

            b_AllBypassPerGroup_data.data = &AllBypassPerGroup_data[0];
            b_AllBypassPerGroup_data.size = &AllBypassPerGroup_size[0];
            b_AllBypassPerGroup_data.allocatedSize = 2;
            b_AllBypassPerGroup_data.numDimensions = 2;
            b_AllBypassPerGroup_data.canFreeData = false;
            if (b_any(&b_AllBypassPerGroup_data)) {
              for (i = 0; i < trueCount; i++) {
                id2Bypass_data[i] = (int)VecIna219_data[k_tmp_data[i]];
              }

              loop_ub = trueCount - 1;
              for (i = 0; i <= loop_ub; i++) {
                switchFlagHelp_data[id2Bypass_data[i] - 1] = true;
              }

              if (N_bat_tmp_tmp_tmp < 1) {
                y->size[0] = 1;
                y->size[1] = 0;
              } else {
                i = y->size[0] * y->size[1];
                y->size[0] = 1;
                y->size[1] = N_bat_tmp_tmp_tmp;
                emxEnsureCapacity_real_T(y, i);
                y_data = y->data;
                loop_ub = N_bat_tmp_tmp_tmp - 1;
                for (i = 0; i <= loop_ub; i++) {
                  y_data[i] = (double)i + 1.0;
                }
              }

              if (trueCount == y->size[1]) {
                i = indVperGrp->size[0];
                indVperGrp->size[0] = y->size[1];
                emxEnsureCapacity_real_T(indVperGrp, i);
                VbusTest2_data = indVperGrp->data;
                loop_ub = y->size[1];
                for (i = 0; i < loop_ub; i++) {
                  VbusTest2_data[i] = y_data[i] + (VecIna219_data[k_tmp_data[i]]
                    - 1.0) * (double)N_bat_tmp_tmp_tmp;
                }
              } else {
                binary_expand_op_3(indVperGrp, y, VecIna219_data, k_tmp_data,
                                   &trueCount, N_bat_tmp_tmp_tmp);
                VbusTest2_data = indVperGrp->data;
              }

              c_tmp_size[0] = trueCount;
              c_tmp_size[1] = d_loop_ub;
              c_tmp_size[2] = d_loop_ub;
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  for (i2 = 0; i2 < trueCount; i2++) {
                    n_tmp_data[(i2 + trueCount * i1) + trueCount * d_loop_ub * i]
                      = BattConfigPerIna_data[(((int)
                      VecIna219_data[k_tmp_data[i2]] + b_loop_ub_tmp * i1) +
                      b_loop_ub_tmp * d_loop_ub * i) - 1];
                  }
                }
              }

              d_tmp_size[0] = 1;
              d_tmp_size[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                outVI[i] = SelDual_data[(int)VecIna219_data[k_tmp_data[i]] - 1];
              }

