romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
              e_tmp_size[0] = 1;
              e_tmp_size[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                o_tmp_data[i] = tLastToggle_data[(int)
                  VecIna219_data[k_tmp_data[i]] - 1];
              }

              f_tmp_size[0] = N_bat_tmp_tmp_tmp;
              f_tmp_size[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                for (i1 = 0; i1 < N_bat_tmp_tmp_tmp; i1++) {
                  c_VbusTest_data[i1 + N_bat_tmp_tmp_tmp * i] =
                    BattConfigAct_data[i1 + N_bat_tmp_tmp_tmp * ((int)
                    VecIna219_data[k_tmp_data[i]] - 1)];
                }
              }

              b_k_t0[0] = (double)(k_t0 + 1) - 1.0;
              b_k_t0[1] = 1.0;
              i = (int)b_maximum(b_k_t0);
              partialTrueCount = indVperGrp->size[0];
              loop_ub = indVperGrp->size[0];
              for (i1 = 0; i1 < loop_ub; i1++) {
                c_VmKp184Test_data[i1] = ImKp184Test2_data[((int)
                  VbusTest2_data[i1] + Vbat->size[0] * (i - 1)) - 1];
              }

              tLastToggle_size[0] = 1;
              tLastToggle_size[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                i_prm[i] = ((float)tLastToggle_data[(int)
                            VecIna219_data[k_tmp_data[i]] - 1] +
                            prm->cnfg.Ttoggle) + 1.0F;
              }

              i = (int)prm->seq.vth[state_k] - 1;
              showVdiff = c_Esp32StepSwitchToggleCombAll_(outVI, d_tmp_size,
                prm->bat.CutOffChrV[i], prm->bat.CutOffDisV[i], n_tmp_data,
                c_tmp_size, c_VmKp184Test_data, partialTrueCount, trueCount,
                prm->brd.Nbat, prm->brd.spi.disconnect, prm->brd.spi.bypass,
                prm->cnfg.Ttoggle, prm->cnfg.NtoggleDrop, prm->cnfg.minLenIna219,
                prm->seq.pwr, prm->seq.pwr.VthFlag[state_k], i_prm,
                tLastToggle_size, o_tmp_data, e_tmp_size, c_VbusTest_data,
                f_tmp_size, AllBypassPerGroup_data, AllBypassPerGroup_size);
              for (i = 0; i < trueCount; i++) {
                id2Bypass_data[i] = (int)VecIna219_data[k_tmp_data[i]] - 1;
              }

              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  for (i2 = 0; i2 < trueCount; i2++) {
                    BattConfigPerInaHelp_data[(id2Bypass_data[i2] +
                      b_loop_ub_tmp * i1) + b_loop_ub_tmp * d_loop_ub * i] =
                      n_tmp_data[(i2 + trueCount * i1) + trueCount * d_loop_ub *
                      i];
                  }
                }
              }

              for (i = 0; i < trueCount; i++) {
                id2Bypass_data[i] = (int)VecIna219_data[k_tmp_data[i]];
              }

              c_loop_ub_tmp = trueCount - 1;
              for (i = 0; i <= c_loop_ub_tmp; i++) {
                SelDualHelp_data[id2Bypass_data[i] - 1] = outVI[i];
              }

              for (i = 0; i < trueCount; i++) {
                id2Bypass_data[i] = (int)VecIna219_data[k_tmp_data[i]];
              }

              for (i = 0; i <= c_loop_ub_tmp; i++) {
                switchFlagHelp_data[id2Bypass_data[i] - 1] = showVdiff;
              }

              Nina219[0] = N_bat_tmp_tmp_tmp;
              Nina219[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                id2Bypass_data[i] = (int)VecIna219_data[k_tmp_data[i]] - 1;
                loop_ub = Nina219[0];
                for (i1 = 0; i1 < loop_ub; i1++) {
                  BattConfigAct_data[i1 + N_bat_tmp_tmp_tmp * id2Bypass_data[i]]
                    = c_VbusTest_data[i1 + Nina219[0] * i];
                }
              }

              /* %squeeze(VbatMat(k_ina219,:,k_t))',... */
              /*  %t to initiate toggle */
            }

            /*                  for k_inaPerGroup = 1:length(VecIna219_k) */
            /*                      if BattConfigPerIna{VecIna219_k(k_inaPerGroup)}~=prm.brd.spi.bypass|BattConfigPerIna{VecIna219_k(k_inaPerGroup)}~=prm.brd.spi.disconnect */
            /*                          BattConfig{VecIna219_k(k_inaPerGroup)} = BattConfigPerIna{VecIna219_k(k_inaPerGroup)} + (VecIna219_k(k_inaPerGroup)-1)*N_bat; */
            /*                      else */
            /*                          BattConfig{VecIna219_k(k_inaPerGroup)} = BattConfigPerIna{VecIna219_k(k_inaPerGroup)}; */
            /*                      end */
            /*                  end */
            /*              end */
          }

          if (b_isequal(SelDualHelp, SelDual)) {
            i = x->size[0] * x->size[1];
            x->size[0] = 1;
            x->size[1] = switchFlagHelp->size[1];
            emxEnsureCapacity_boolean_T(x, i);
            b_changeConfigFlag_data = x->data;
            loop_ub = switchFlagHelp->size[1];
            for (i = 0; i < loop_ub; i++) {
              b_changeConfigFlag_data[i] = !switchFlagHelp_data[i];
            }

            showVdiff = true;
            b_trueCount = 1;
            exitg2 = false;
            while ((!exitg2) && (b_trueCount <= x->size[1])) {
              if (!b_changeConfigFlag_data[b_trueCount - 1]) {
                showVdiff = false;
                exitg2 = true;
              } else {
                b_trueCount++;
              }
            }

            if (showVdiff) {
              for (c_loop_ub = 0; c_loop_ub < VbusTest_size_idx_0; c_loop_ub++)
              {
                /* Start new mode */
                if (switchFlag_data[c_loop_ub]) {
                  /* nadav Coder */
                  d_tmp_data = SelDual_data[c_loop_ub];
                  if (d_tmp_data == 0.0) {
                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i] =
                          BattConfigPerInaHelp_data[(c_loop_ub + b_loop_ub_tmp *
                          i1) + b_loop_ub_tmp * d_loop_ub * i];
                      }
                    }

                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                          b_loop_ub_tmp * d_loop_ub * i] =
                          b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i];
                      }
                    }
                  } else if (d_tmp_data == 1.0) {
                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i] =
                          BattConfigPerInaHelp_data[(c_loop_ub + b_loop_ub_tmp *
                          i1) + b_loop_ub_tmp * d_loop_ub * i];
                      }
                    }

                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                          b_loop_ub_tmp * d_loop_ub * i] =
                          b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i];
                      }
                    }
                  } else if (d_tmp_data == 1.5) {
                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i] =
                          BattConfigPerInaHelp_data[(c_loop_ub + b_loop_ub_tmp *
                          i1) + b_loop_ub_tmp * d_loop_ub * i];
                      }
                    }

                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                          b_loop_ub_tmp * d_loop_ub * i] =
                          b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i];
                      }
                    }
                  } else if (d_tmp_data == 1.6) {
                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i] =
                          BattConfigPerInaHelp_data[(c_loop_ub + b_loop_ub_tmp *
                          i1) + b_loop_ub_tmp * d_loop_ub * i];
                      }
                    }

                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                          b_loop_ub_tmp * d_loop_ub * i] =
                          b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i];
                      }
                    }
                  } else if (d_tmp_data == prm->brd.spi.disconnect) {
                    b_padArr(prm->brd.spi.disconnect, N_bat_tmp_tmp_tmp,
                             N_bat_tmp_tmp_tmp, r);
                    b_y_data = r->data;
                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                          b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 +
                          d_loop_ub * i];
                      }
                    }
                  } else if (d_tmp_data == prm->brd.spi.bypass) {
                    b_padArr(prm->brd.spi.bypass, N_bat_tmp_tmp_tmp,
                             N_bat_tmp_tmp_tmp, r);
                    b_y_data = r->data;
                    for (i = 0; i < d_loop_ub; i++) {
                      for (i1 = 0; i1 < d_loop_ub; i1++) {
                        BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                          b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 +
                          d_loop_ub * i];
                      }
                    }
                  }

                  /* nadav Coder End */
                  /*  if SelDual(k_ina219)==0 */
                  /*      BattConfigPerIna{k_ina219} = BattConfigPerInaHelp{k_ina219}; */
                  /*      BattConfig{k_ina219}       = BattConfigPerIna{k_ina219} + (k_ina219-1)*N_bat; */
                  /*  elseif SelDual(k_ina219)==1 */
                  /*      BattConfigPerIna{k_ina219} = BattConfigPerInaHelp{k_ina219}; */
                  /*      BattConfig{k_ina219}       = BattConfigPerIna{k_ina219} + (k_ina219-1)*N_bat; */
                  /*  elseif SelDual(k_ina219)==1.5 */
                  /*      BattConfigPerIna{k_ina219} = BattConfigPerInaHelp{k_ina219}; */
                  /*      BattConfig{k_ina219}       = BattConfigPerIna{k_ina219} + (k_ina219-1)*N_bat; */
                  /*  elseif SelDual(k_ina219)==1.6 */
                  /*      BattConfigPerIna{k_ina219} = BattConfigPerInaHelp{k_ina219}; */
                  /*      BattConfig{k_ina219}       = BattConfigPerIna{k_ina219} + (k_ina219-1)*N_bat; */
                  /*  elseif SelDual(k_ina219)==prm.brd.spi.disconnect */
                  /*      BattConfigPerIna{k_ina219} = prm.brd.spi.disconnect; */
                  /*      BattConfig{k_ina219}       = prm.brd.spi.disconnect; */
                  /*  elseif SelDual(k_ina219)==prm.brd.spi.bypass */
                  /*      BattConfigPerIna{k_ina219} = prm.brd.spi.bypass; */
                  /*      BattConfig{k_ina219}       = prm.brd.spi.bypass; */
                  /*  end */
                }
              }

              b_guard1 = true;
            } else {
              exitg1 = true;
            }
          } else {
            exitg1 = true;
          }
        } else {
          for (c_loop_ub = 0; c_loop_ub < VbusTest_size_idx_0; c_loop_ub++) {
            /* Start new mode */
            if (switchFlag_data[c_loop_ub]) {
              d_tmp_data = SelDual_data[c_loop_ub];
              if (d_tmp_data == 0.0) {
                e_padArrUint8(prm->cnfg.BattConfigDis1, N_bat_tmp_tmp_tmp,
                              N_bat_tmp_tmp_tmp, r3);
                r31 = r3->data;
                i = r->size[0] * r->size[1];
                r->size[0] = r3->size[0];
                r->size[1] = r3->size[1];
                emxEnsureCapacity_real_T(r, i);
                b_y_data = r->data;
                loop_ub = r3->size[0] * r3->size[1];
                for (i = 0; i < loop_ub; i++) {
                  b_y_data[i] = r31[i];
                }

                for (i = 0; i < d_loop_ub; i++) {
                  for (i1 = 0; i1 < d_loop_ub; i1++) {
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                      b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub *
                      i];
                  }
                }
              } else if (d_tmp_data == 1.0) {
                e_padArrUint8(prm->cnfg.BattConfigChr1, N_bat_tmp_tmp_tmp,
                              N_bat_tmp_tmp_tmp, r3);
                r31 = r3->data;
                i = r->size[0] * r->size[1];
                r->size[0] = r3->size[0];
                r->size[1] = r3->size[1];
                emxEnsureCapacity_real_T(r, i);
                b_y_data = r->data;
                loop_ub = r3->size[0] * r3->size[1];
                for (i = 0; i < loop_ub; i++) {
                  b_y_data[i] = r31[i];
                }

                for (i = 0; i < d_loop_ub; i++) {
                  for (i1 = 0; i1 < d_loop_ub; i1++) {
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                      b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub *
                      i];
                  }
                }
              } else if (d_tmp_data == 1.5) {
                e_padArrUint8(prm->cnfg.BattConfigChr2, N_bat_tmp_tmp_tmp,
                              N_bat_tmp_tmp_tmp, r3);
                r31 = r3->data;
                i = r->size[0] * r->size[1];
                r->size[0] = r3->size[0];
                r->size[1] = r3->size[1];
                emxEnsureCapacity_real_T(r, i);
                b_y_data = r->data;
                loop_ub = r3->size[0] * r3->size[1];
                for (i = 0; i < loop_ub; i++) {
                  b_y_data[i] = r31[i];
                }

                for (i = 0; i < d_loop_ub; i++) {
                  for (i1 = 0; i1 < d_loop_ub; i1++) {
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                      b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub *
                      i];
                  }
                }
              } else if (d_tmp_data == 1.6) {
                e_padArrUint8(prm->cnfg.BattConfigChr3, N_bat_tmp_tmp_tmp,
                              N_bat_tmp_tmp_tmp, r3);
                r31 = r3->data;
                i = r->size[0] * r->size[1];
                r->size[0] = r3->size[0];
                r->size[1] = r3->size[1];
                emxEnsureCapacity_real_T(r, i);
                b_y_data = r->data;
                loop_ub = r3->size[0] * r3->size[1];
                for (i = 0; i < loop_ub; i++) {
                  b_y_data[i] = r31[i];
                }

                for (i = 0; i < d_loop_ub; i++) {
                  for (i1 = 0; i1 < d_loop_ub; i1++) {
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                      b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub *
                      i];
                  }
                }
              } else if (d_tmp_data == prm->brd.spi.disconnect) {
                f_padArrUint8(prm->brd.spi.disconnect, N_bat_tmp_tmp_tmp,
                              N_bat_tmp_tmp_tmp, r3);
                r31 = r3->data;
                i = r->size[0] * r->size[1];
                r->size[0] = r3->size[0];
                r->size[1] = r3->size[1];
                emxEnsureCapacity_real_T(r, i);
                b_y_data = r->data;
                loop_ub = r3->size[0] * r3->size[1];
                for (i = 0; i < loop_ub; i++) {
                  b_y_data[i] = r31[i];
                }

                for (i = 0; i < d_loop_ub; i++) {
                  for (i1 = 0; i1 < d_loop_ub; i1++) {
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                      b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub *
                      i];
                  }
                }
              } else if (d_tmp_data == prm->brd.spi.bypass) {
                f_padArrUint8(prm->brd.spi.bypass, N_bat_tmp_tmp_tmp,
                              N_bat_tmp_tmp_tmp, r3);
                r31 = r3->data;
                i = r->size[0] * r->size[1];
                r->size[0] = r3->size[0];
                r->size[1] = r3->size[1];
                emxEnsureCapacity_real_T(r, i);
                b_y_data = r->data;
                loop_ub = r3->size[0] * r3->size[1];
                for (i = 0; i < loop_ub; i++) {
                  b_y_data[i] = r31[i];
                }

                for (i = 0; i < d_loop_ub; i++) {
                  for (i1 = 0; i1 < d_loop_ub; i1++) {
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                      b_loop_ub_tmp * d_loop_ub * i] = b_y_data[i1 + d_loop_ub *
                      i];
                  }
                }
              }

              /*  if SelDual(k_ina219)==0 */
              /*      BattConfigPerIna{k_ina219} = BattConfigDis1; */
              /*      BattConfig{k_ina219}       = BattConfigDis1 + (k_ina219-1)*N_bat; */
              /*  elseif SelDual(k_ina219)==1 */
              /*      BattConfigPerIna{k_ina219} = BattConfigChr1; */
              /*      BattConfig{k_ina219}       = BattConfigChr1 + (k_ina219-1)*N_bat; */
              /*  elseif SelDual(k_ina219)==1.5 */
              /*      BattConfigPerIna{k_ina219} = BattConfigChr2; */
              /*      BattConfig{k_ina219}       = BattConfigChr2 + (k_ina219-1)*N_bat; */
              /*  elseif SelDual(k_ina219)==1.6 */
              /*      BattConfigPerIna{k_ina219} = BattConfigChr3; */
              /*      BattConfig{k_ina219}       = BattConfigChr3 + (k_ina219-1)*N_bat; */
              /*  elseif SelDual(k_ina219)==prm.brd.spi.disconnect */
              /*      BattConfigPerIna{k_ina219} = prm.brd.spi.disconnect; */
              /*      BattConfig{k_ina219}       = prm.brd.spi.disconnect; */
              /*  elseif SelDual(k_ina219)==prm.brd.spi.bypass */
              /*      BattConfigPerIna{k_ina219} = prm.brd.spi.bypass; */
              /*      BattConfig{k_ina219}       = prm.brd.spi.bypass; */
              /*  end */
            }
          }

          b_guard1 = true;
        }

        if (b_guard1) {
          for (c_loop_ub = 0; c_loop_ub < VbusTest_size_idx_0; c_loop_ub++) {
            /*              %Start new mode */
            /*              if switchFlag(k_ina219) */
            /*                  if SelDual(k_ina219)==0 */
            /*                      BattConfigPerIna{k_ina219} = BattConfigDis1; */
            /*                      BattConfig{k_ina219}       = BattConfigDis1 + (k_ina219-1)*N_bat; */
            /*                  elseif SelDual(k_ina219)==1 */
            /*                      BattConfigPerIna{k_ina219} = BattConfigChr1; */
            /*                      BattConfig{k_ina219}       = BattConfigChr1 + (k_ina219-1)*N_bat; */
            /*                  elseif SelDual(k_ina219)==1.5 */
            /*                      BattConfigPerIna{k_ina219} = BattConfigChr2; */
            /*                      BattConfig{k_ina219}       = BattConfigChr2 + (k_ina219-1)*N_bat; */
            /*                  elseif SelDual(k_ina219)==1.6 */
            /*                      BattConfigPerIna{k_ina219} = BattConfigChr3; */
            /*                      BattConfig{k_ina219}       = BattConfigChr3 + (k_ina219-1)*N_bat; */
            /*                  elseif SelDual(k_ina219)==prm.brd.spi.disconnect */
            /*                      BattConfigPerIna{k_ina219} = prm.brd.spi.disconnect; */
            /*                      BattConfig{k_ina219}       = prm.brd.spi.disconnect; */
            /*                  elseif SelDual(k_ina219)==prm.brd.spi.bypass */
            /*                      BattConfigPerIna{k_ina219} = prm.brd.spi.bypass; */
            /*                      BattConfig{k_ina219}       = prm.brd.spi.bypass; */
            /*                  end */
            /*              end */
            /* Start new mode - End */
            if (changeConfigFlag_data[c_loop_ub] || switchFlag_data[c_loop_ub])
            {
              /* [SpiPortRow0,ina219State,Pac2Vid0] = CalcPortSpi(SwitchMat_esp,SwitchMat_esp2,PortSpiRow_esp,PortSpiRow_esp2,Pac2Vid,Pac2Vid2,BattConfigPerIna{k_ina219}); */
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i] =
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                    b_loop_ub_tmp * d_loop_ub * i];
                }
              }

