romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
              b_trueCount = prm->Nmax.NbatMax;
              Nina219[0] = prm->Nmax.NbatMax;
              Nina219[1] = prm->Nmax.NbatMax;
              c_BattConfigPerInaHelp_data.data = &b_BattConfigPerInaHelp_data[0];
              c_BattConfigPerInaHelp_data.size = &Nina219[0];
              c_BattConfigPerInaHelp_data.allocatedSize = 256;
              c_BattConfigPerInaHelp_data.numDimensions = 2;
              c_BattConfigPerInaHelp_data.canFreeData = false;
              d_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                               prm->brd.spi.PortSpiRow_esp,
                               prm->brd.spi.SwitchMat_esp,
                               prm->brd.spi.PortSpiRow_esp2,
                               prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                               prm->brd.spi.Pac2Vid2,
                               &c_BattConfigPerInaHelp_data, SpiPortRowBypass,
                               a__1_data, a__1_size, id0_data);
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  Pac2Vid0All_data[(c_loop_ub + Pac2Vid0All_size[0] * i1) +
                    Pac2Vid0All_size[0] * d_loop_ub * i] = id0_data[i1 + (i << 4)];
                }
              }

              if (prm->seq.BrdBeforePSflag[state_k]) {
                switch (ProjectFlag) {
                 case 2:
                  break;

                 case 3:
                  writePortToSpi4RowMask_ser(SpiPortRowBypass);
                  break;
                }

                /*                      disp([sprintf('%d',int32(k_ina219)) ':',num2str(Pac2Vid0(:,1)')]); */
                if ((unsigned int)c_loop_ub + 1U < 2147483648U) {
                  i = c_loop_ub + 1;
                } else {
                  i = MAX_int32_T;
                }

                b_sprintf(i, r19);
                for (id2Bypass_size = 0; id2Bypass_size < b_trueCount;
                     id2Bypass_size++) {
                  NstTst_tmp_tmp = id0_data[id2Bypass_size];
                  if (NstTst_tmp_tmp > 127) {
                    NstTst_tmp_tmp = 127U;
                  }

                  printf(" %d", (signed char)NstTst_tmp_tmp);
                  fflush(stdout);
                }

                changeConfigFlag_data[c_loop_ub] = false;
                switchFlag_data[c_loop_ub] = false;
                pause(0.05);
              }
            }
          }

          /* for k_ina219 */
          /*  change switch - End */
          b_dv0 = 0.0;
          V_dis_all = 0.0;

          /*  IchrPerPhase = zeros(1,sum(SelDual)); */
          /*  k0 = 1; */
          b_meanIbrd0 = 0.0;
          N0 = 0.0;
          for (c_loop_ub = 0; c_loop_ub < VbusTest_size_idx_0; c_loop_ub++) {
            d_tmp_data = SelDual_data[c_loop_ub];
            if ((d_tmp_data >= 1.0) && (d_tmp_data < 2.0)) {
              bitCnfg_size[0] = 1;
              bitCnfg_size[1] = d_loop_ub;
              bitCnfg_size[2] = Pac2Vid0All_size[2];
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  b_bitCnfg_data[i1 + d_loop_ub * i] = Pac2Vid0All_data
                    [(c_loop_ub + Pac2Vid0All_size[0] * i1) + Pac2Vid0All_size[0]
                    * d_loop_ub * i];
                }
              }

              c_squeeze(b_bitCnfg_data, bitCnfg_size, id0_data, id2Bypass_data);

              /* Pac2Vid3(:,1); */
              if (k_t0 >= 1) {
                k_ina219_ = k_t0;
              } else {
                k_ina219_ = 1;
              }

              /* ins */
              id2Bypass_size = id2Bypass_data[0] * id2Bypass_data[1] - 1;
              trueCount = 0;
              partialTrueCount = 0;
              for (loop_ub = 0; loop_ub <= id2Bypass_size; loop_ub++) {
                if (id0_data[loop_ub] > 0) {
                  trueCount++;
                  l_tmp_data[partialTrueCount] = (unsigned char)loop_ub;
                  partialTrueCount++;
                }
              }

              VmKp184Test_size[0] = 1;
              VmKp184Test_size[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                c_VmKp184Test_data[i] = VbatMat0_data[(c_loop_ub +
                  VbatMat0->size[0] * (id0_data[l_tmp_data[i]] - 1)) +
                  VbatMat0->size[0] * VbatMat0->size[1] * (k_ina219_ - 1)];
              }

              b_dv0 += c_sum(c_VmKp184Test_data, VmKp184Test_size);

              /* +I0'*Rwire(k_ina219,:);%prm.brd.Rint; */
              /*  limit Vchr calculation */
              /*  if SelDual(k_ina219)>=1&&SelDual(k_ina219)<2 */
              BattConfigPerInaHelp_size[0] = 1;
              BattConfigPerInaHelp_size[1] = d_loop_ub;
              BattConfigPerInaHelp_size[2] = d_loop_ub;
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i] =
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                    b_loop_ub_tmp * d_loop_ub * i];
                }
              }

              remPadArr(b_BattConfigPerInaHelp_data, BattConfigPerInaHelp_size,
                        VmV_data, b_tmp_size);
              N0 += (double)(unsigned short)b_tmp_size[0];

              /* size(BattConfigPerIna{k_ina0},1);%N_row(ina219StateAll(k_ina0)); */
              /*  end */
              IbatMat_size[0] = 1;
              IbatMat_size[1] = IbatMat->size[1];
              loop_ub = IbatMat->size[1];
              for (i = 0; i < loop_ub; i++) {
                b_VmV_data[i] = Iacs758_cal_data[(c_loop_ub + IbatMat->size[0] *
                  i) + IbatMat->size[0] * IbatMat->size[1] * (k_ina219_ - 1)];
              }

              b_abs(b_VmV_data, IbatMat_size, c_VmKp184Test_data,
                    VmKp184Test_size);
              d_tmp_data = 0.0;
              loop_ub = VmKp184Test_size[1];
              for (i = 0; i < loop_ub; i++) {
                a__4_data = c_VmKp184Test_data[i];
                if ((g_IchargeAct >= a__4_data) || rtIsNaN(a__4_data)) {
                  d = g_IchargeAct;
                } else {
                  d = a__4_data;
                }

                d_tmp_data += d * Rwire_data[c_loop_ub + Rwire_size[0] * i];
              }

