romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
              b_meanIbrd0 += d_tmp_data;

              /* prm.brd.Rint; */
            }

            d_tmp_data = SelDual_data[c_loop_ub];
            if ((d_tmp_data >= 0.0) && (d_tmp_data < 1.0)) {
              bitCnfg_size[0] = 1;
              bitCnfg_size[1] = d_loop_ub;
              bitCnfg_size[2] = Pac2Vid0All_size[2];
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  b_bitCnfg_data[i1 + d_loop_ub * i] = Pac2Vid0All_data
                    [(c_loop_ub + Pac2Vid0All_size[0] * i1) + Pac2Vid0All_size[0]
                    * d_loop_ub * i];
                }
              }

              c_squeeze(b_bitCnfg_data, bitCnfg_size, id0_data, id2Bypass_data);

              /* Pac2Vid3(:,1); */
              if (k_t0 >= 1) {
                b_trueCount = k_t0;
              } else {
                b_trueCount = 1;
              }

              id2Bypass_size = id2Bypass_data[0] * id2Bypass_data[1] - 1;
              trueCount = 0;
              partialTrueCount = 0;
              for (loop_ub = 0; loop_ub <= id2Bypass_size; loop_ub++) {
                if (id0_data[loop_ub] > 0) {
                  trueCount++;
                  m_tmp_data[partialTrueCount] = (unsigned char)loop_ub;
                  partialTrueCount++;
                }
              }

              VmKp184Test_size[0] = 1;
              VmKp184Test_size[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                c_VmKp184Test_data[i] = VbatMat0_data[(c_loop_ub +
                  VbatMat0->size[0] * (id0_data[m_tmp_data[i]] - 1)) +
                  VbatMat0->size[0] * VbatMat0->size[1] * (b_trueCount - 1)];
              }

              V_dis_all += c_sum(c_VmKp184Test_data, VmKp184Test_size);

              /* -I0'*Rwire(k_ina219,:);%prm.brd.Rint; */
            }
          }

          e_Vcharge0 = (prm->bat.Vd + (c_maximum(prm->bat.CutOffChrV) + 0.1F) *
                        (float)N0) + (float)b_meanIbrd0;
          if (b_dv0 > 0.0) {
            ImaxChrB2B = (float)(V_dis_all / b_dv0) * ImaxDis *
              juntekEfficencyFactor;
          } else {
            /* k_t = 1; */
            V_dis_all = prm->ins.prm.jun.minVjuntekInput + 1.0;
            ImaxChrB2B = ImaxDis * juntekEfficencyFactor;
          }

          /* calc max I allowed & V discharge - End */
          b_dv0 = toc();
          f = b_mod(b_dv0, prm->bat.T);
          for (id2Bypass_size = 0; id2Bypass_size < 1024; id2Bypass_size++) {
            varargin_1[id2Bypass_size] = (float)fabs(prm->bat.t[id2Bypass_size]
              - f);
          }

          c_minimum(varargin_1, &b_trueCount);
          c_vSumMax = rt_roundf_snf(1000.0F * prm->bat.i_in[b_trueCount - 1]) /
            1000.0F;

          /* calc I to discharge- End */
          if (onPowerFlag) {
            /*  if prm.ins.juntek */
            /*      controlJuntekDPH8920(prm.ser.s_juntek,'ON'); */
            /*  end */
            /*  if prm.ins.ka6005p */
            /*      ControlKa6005P(prm.ser.s_ka6005p,'On'); */
            /*  end */
            for (i = 0; i < 8; i++) {
              VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 1);
            }

            if (vectorAny(VbusTest0_data)) {
              /* prm.ins.kp184 */
              pause(0.05);
            }

            for (i = 0; i < 8; i++) {
              VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 2);
            }

            if (vectorAny(VbusTest0_data)) {
              /* prm.ins.ka6005p */
              c_loop_ub = 0;
              exitg2 = false;
              while ((!exitg2) && (c_loop_ub <= (int)Nina219_tmp_tmp - 1)) {
                if (SelDual_data[c_loop_ub] == 1.0) {
                  b_trueCount = 0;
                } else if (SelDual_data[c_loop_ub] == 1.5) {
                  b_trueCount = 1;
                } else if (SelDual_data[c_loop_ub] == 1.6) {
                  b_trueCount = 2;
                } else {
                  b_trueCount = -1;
                }

                switch (b_trueCount) {
                 case 0:
                  g_IchargeAct = Icharge;
                  exitg2 = true;
                  break;

                 case 1:
                  g_IchargeAct = IchargePhase2t;
                  exitg2 = true;
                  break;

                 case 2:
                  g_IchargeAct = IchargePhase3;
                  exitg2 = true;
                  break;

                 default:
                  c_loop_ub++;
                  break;
                }
              }

              e_sprintf(e_Vcharge0, Vcharge0);

              /* ['VSET',num2str(ch),':',num2str(Val)];%[V] */
              k_sprintf(e_Vcharge0, b_Vcharge0);
              pause(0.05);
              l_sprintf(g_IchargeAct, IchargeAct);

              /* ['ISET',num2str(ch),':',num2str(Val)];%[A] */
              d_sprintf(g_IchargeAct, b_IchargeAct);
              pause(0.05);
            }

            for (i = 0; i < 8; i++) {
              VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 3);
            }

            if (vectorAny(VbusTest0_data)) {
              /*  3-juntek+ACDC */
              c_loop_ub = 0;
              exitg2 = false;
              while ((!exitg2) && (c_loop_ub <= (int)Nina219_tmp_tmp - 1)) {
                if (SelDual_data[c_loop_ub] == 1.0) {
                  b_trueCount = 0;
                } else if (SelDual_data[c_loop_ub] == 1.5) {
                  b_trueCount = 1;
                } else if (SelDual_data[c_loop_ub] == 1.6) {
                  b_trueCount = 2;
                } else {
                  b_trueCount = -1;
                }

                switch (b_trueCount) {
                 case 0:
                  g_IchargeAct = Icharge;
                  exitg2 = true;
                  break;

                 case 1:
                  g_IchargeAct = IchargePhase2t;
                  exitg2 = true;
                  break;

