romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
                 case 2:
                  g_IchargeAct = IchargePhase3;
                  exitg2 = true;
                  break;

                 default:
                  c_loop_ub++;
                  break;
                }
              }

              /* Imax); */
              b_k_t0[0] = g_IchargeAct;
              b_k_t0[1] = ImaxAcDC;
              g_IchargeAct = rt_roundd_snf(1000.0 * d_minimum(b_k_t0)) / 1000.0;
              d_tmp_data = rt_roundd_snf(g_IchargeAct * 1000.0);
              if (d_tmp_data < 2.147483648E+9) {
                if (d_tmp_data >= -2.147483648E+9) {
                  i = (int)d_tmp_data;
                } else {
                  i = MIN_int32_T;
                }
              } else if (d_tmp_data >= 2.147483648E+9) {
                i = MAX_int32_T;
              } else {
                i = 0;
              }

              g_sprintf(i, r23);

              /* [':',juntek_address,'w11=',num2str(uint32(Val*1000),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
              d_sprintf(g_IchargeAct, d_IchargeAct);
              pause(0.1);
              f = rt_roundf_snf(e_Vcharge0 * 100.0F);
              if (f < 2.14748365E+9F) {
                if (f >= -2.14748365E+9F) {
                  i = (int)f;
                } else {
                  i = MIN_int32_T;
                }
              } else if (f >= 2.14748365E+9F) {
                i = MAX_int32_T;
              } else {
                i = 0;
              }

              g_sprintf(i, r26);

              /* [':',juntek_address,'w10=',num2str(uint32(Val*100),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
              k_sprintf(e_Vcharge0, c_Vcharge0);
              pause(0.1);
            }

            for (i = 0; i < 8; i++) {
              VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 4);
            }

            if (vectorAny(VbusTest0_data)) {
              /*  4-juntek B2B */
              c_loop_ub = 0;
              exitg2 = false;
              while ((!exitg2) && (c_loop_ub <= (int)Nina219_tmp_tmp - 1)) {
                if (SelDual_data[c_loop_ub] == 1.0) {
                  b_trueCount = 0;
                } else if (SelDual_data[c_loop_ub] == 1.5) {
                  b_trueCount = 1;
                } else if (SelDual_data[c_loop_ub] == 1.6) {
                  b_trueCount = 2;
                } else {
                  b_trueCount = -1;
                }

                switch (b_trueCount) {
                 case 0:
                  g_IchargeAct = c_vSumMax;
                  exitg2 = true;
                  break;

                 case 1:
                  g_IchargeAct = IchargePhase2t;
                  exitg2 = true;
                  break;

                 case 2:
                  g_IchargeAct = IchargePhase3;
                  exitg2 = true;
                  break;

                 default:
                  c_loop_ub++;
                  break;
                }
              }

              /* Imax); */
              b_k_t0[0] = g_IchargeAct;
              b_k_t0[1] = ImaxChrB2B;
              g_IchargeAct = rt_roundd_snf(1000.0 * d_minimum(b_k_t0)) / 1000.0;
              d_tmp_data = rt_roundd_snf(g_IchargeAct * 1000.0);
              if (d_tmp_data < 2.147483648E+9) {
                if (d_tmp_data >= -2.147483648E+9) {
                  i = (int)d_tmp_data;
                } else {
                  i = MIN_int32_T;
                }
              } else if (d_tmp_data >= 2.147483648E+9) {
                i = MAX_int32_T;
              } else {
                i = 0;
              }

              g_sprintf(i, r25);

              /* [':',juntek_address,'w11=',num2str(uint32(Val*1000),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
              d_sprintf(g_IchargeAct, f_IchargeAct);
              pause(0.1);
              f = rt_roundf_snf(e_Vcharge0 * 100.0F);
              if (f < 2.14748365E+9F) {
                if (f >= -2.14748365E+9F) {
                  i = (int)f;
                } else {
                  i = MIN_int32_T;
                }
              } else if (f >= 2.14748365E+9F) {
                i = MAX_int32_T;
              } else {
                i = 0;
              }

              g_sprintf(i, r28);

              /* [':',juntek_address,'w10=',num2str(uint32(Val*100),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
              k_sprintf(e_Vcharge0, d_Vcharge0);
              pause(0.1);
            }
          } else {
            /*  if onPowerFlag == true; */
            for (i = 0; i < 8; i++) {
              k_groups_tmp = prm->seq.ins[i + (state_k << 3)];
              iv[i] = k_groups_tmp;
              VbusTest0_data[i] = (k_groups_tmp == 3);
            }

            if (vectorAny(VbusTest0_data)) {
              /*  3-juntek ACDC */
              i = b_changeConfigFlag->size[0] * b_changeConfigFlag->size[1];
              b_changeConfigFlag->size[0] = 1;
              b_changeConfigFlag->size[1] = SelDual->size[1];
              emxEnsureCapacity_boolean_T(b_changeConfigFlag, i);
              b_changeConfigFlag_data = b_changeConfigFlag->data;
              loop_ub = SelDual->size[1];
              for (i = 0; i < loop_ub; i++) {
                d_tmp_data = SelDual_data[i];
                b_changeConfigFlag_data[i] = ((d_tmp_data >= 1.0) && (d_tmp_data
                  < 2.0));
              }

              if (b_any(b_changeConfigFlag)) {
                c_loop_ub = 0;
                exitg2 = false;
                while ((!exitg2) && (c_loop_ub <= (int)Nina219_tmp_tmp - 1)) {
                  if (SelDual_data[c_loop_ub] == 1.0) {
                    b_trueCount = 0;
                  } else if (SelDual_data[c_loop_ub] == 1.5) {
                    b_trueCount = 1;
                  } else if (SelDual_data[c_loop_ub] == 1.6) {
                    b_trueCount = 2;
                  } else {
                    b_trueCount = -1;
                  }

                  switch (b_trueCount) {
                   case 0:
                    g_IchargeAct = Icharge;
                    exitg2 = true;
                    break;

                   case 1:
                    g_IchargeAct = IchargePhase2t;
                    exitg2 = true;
                    break;

