romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
                   case 2:
                    g_IchargeAct = IchargePhase3;
                    exitg2 = true;
                    break;

                   default:
                    c_loop_ub++;
                    break;
                  }
                }

                /* Imax); */
                b_k_t0[0] = g_IchargeAct;
                b_k_t0[1] = ImaxAcDC;
                g_IchargeAct = rt_roundd_snf(1000.0 * d_minimum(b_k_t0)) /
                  1000.0;
                f = rt_roundf_snf(e_Vcharge0 * 100.0F);
                if (f < 2.14748365E+9F) {
                  if (f >= -2.14748365E+9F) {
                    i = (int)f;
                  } else {
                    i = MIN_int32_T;
                  }
                } else if (f >= 2.14748365E+9F) {
                  i = MAX_int32_T;
                } else {
                  i = 0;
                }

                g_sprintf(i, r20);

                /* [':',juntek_address,'w10=',num2str(uint32(Val*100),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                d_tmp_data = rt_roundd_snf(g_IchargeAct * 1000.0);
                if (d_tmp_data < 2.147483648E+9) {
                  if (d_tmp_data >= -2.147483648E+9) {
                    i = (int)d_tmp_data;
                  } else {
                    i = MIN_int32_T;
                  }
                } else if (d_tmp_data >= 2.147483648E+9) {
                  i = MAX_int32_T;
                } else {
                  i = 0;
                }

                g_sprintf(i, r22);

                /* [':',juntek_address,'w11=',num2str(uint32(Val*1000),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                d_sprintf(g_IchargeAct, c_IchargeAct);
                pause(0.1);
              }
            }

            for (i = 0; i < 8; i++) {
              VbusTest0_data[i] = (iv[i] == 4);
            }

            if (vectorAny(VbusTest0_data)) {
              /*  4-juntek B2B */
              i = b_changeConfigFlag->size[0] * b_changeConfigFlag->size[1];
              b_changeConfigFlag->size[0] = 1;
              b_changeConfigFlag->size[1] = SelDual->size[1];
              emxEnsureCapacity_boolean_T(b_changeConfigFlag, i);
              b_changeConfigFlag_data = b_changeConfigFlag->data;
              loop_ub = SelDual->size[1];
              for (i = 0; i < loop_ub; i++) {
                d_tmp_data = SelDual_data[i];
                b_changeConfigFlag_data[i] = ((d_tmp_data >= 1.0) && (d_tmp_data
                  < 2.0));
              }

              if (b_any(b_changeConfigFlag)) {
                /* Imax); */
                b_k_t0[0] = c_vSumMax;
                b_k_t0[1] = ImaxChrB2B;
                g_IchargeAct = rt_roundd_snf(1000.0 * d_minimum(b_k_t0)) /
                  1000.0;
                f = rt_roundf_snf(e_Vcharge0 * 100.0F);
                if (f < 2.14748365E+9F) {
                  if (f >= -2.14748365E+9F) {
                    i = (int)f;
                  } else {
                    i = MIN_int32_T;
                  }
                } else if (f >= 2.14748365E+9F) {
                  i = MAX_int32_T;
                } else {
                  i = 0;
                }

                g_sprintf(i, r21);

                /* [':',juntek_address,'w10=',num2str(uint32(Val*100),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                d_tmp_data = rt_roundd_snf(g_IchargeAct * 1000.0);
                if (d_tmp_data < 2.147483648E+9) {
                  if (d_tmp_data >= -2.147483648E+9) {
                    i = (int)d_tmp_data;
                  } else {
                    i = MIN_int32_T;
                  }
                } else if (d_tmp_data >= 2.147483648E+9) {
                  i = MAX_int32_T;
                } else {
                  i = 0;
                }

                g_sprintf(i, r24);

                /* [':',juntek_address,'w11=',num2str(uint32(Val*1000),'%04d'),',',newline];%['VSET',num2str(ch),':',num2str(Val)];%[V] */
                d_sprintf(g_IchargeAct, e_IchargeAct);
                pause(0.1);
              }
            }

            for (i = 0; i < 8; i++) {
              VbusTest0_data[i] = (iv[i] == 1);
            }

            if (vectorAny(VbusTest0_data)) {
              /* prm.ins.kp184 */
              pause(0.05);

              /*  ControlKp184(prm.ser.s_kp184,'On'); */
            }
          }

          onPowerFlag = false;
          pause(0.1);
          for (c_loop_ub = 0; c_loop_ub < VbusTest_size_idx_0; c_loop_ub++) {
            if (!prm->seq.BrdBeforePSflag[state_k]) {
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  b_BattConfigPerInaHelp_data[i1 + d_loop_ub * i] =
                    BattConfigPerIna_data[(c_loop_ub + b_loop_ub_tmp * i1) +
                    b_loop_ub_tmp * d_loop_ub * i];
                }
              }

              b_trueCount = prm->Nmax.NbatMax;
              Nina219[0] = prm->Nmax.NbatMax;
              Nina219[1] = prm->Nmax.NbatMax;
              d_BattConfigPerInaHelp_data.data = &b_BattConfigPerInaHelp_data[0];
              d_BattConfigPerInaHelp_data.size = &Nina219[0];
              d_BattConfigPerInaHelp_data.allocatedSize = 256;
              d_BattConfigPerInaHelp_data.numDimensions = 2;
              d_BattConfigPerInaHelp_data.canFreeData = false;
              d_CalcPortSpiPrm(prm->brd.spi.disconnect, prm->brd.spi.bypass,
                               prm->brd.spi.PortSpiRow_esp,
                               prm->brd.spi.SwitchMat_esp,
                               prm->brd.spi.PortSpiRow_esp2,
                               prm->brd.spi.SwitchMat_esp2, prm->brd.spi.Pac2Vid,
                               prm->brd.spi.Pac2Vid2,
                               &d_BattConfigPerInaHelp_data, SpiPortRowBypass,
                               a__1_data, a__1_size, id0_data);
              for (i = 0; i < d_loop_ub; i++) {
                for (i1 = 0; i1 < d_loop_ub; i1++) {
                  Pac2Vid0All_data[(c_loop_ub + Pac2Vid0All_size[0] * i1) +
                    Pac2Vid0All_size[0] * d_loop_ub * i] = id0_data[i1 + (i << 4)];
                }
              }

              if (changeConfigFlag_data[c_loop_ub] || switchFlag_data[c_loop_ub])
              {
                switch (ProjectFlag) {
                 case 2:
                  break;

                 case 3:
                  writePortToSpi4RowMask_ser(SpiPortRowBypass);
                  break;
                }

                /*  disp([num2str(k_ina219) ':',num2str(Pac2Vid0(:,1)')]); */
                if ((unsigned int)c_loop_ub + 1U < 2147483648U) {
                  i = c_loop_ub + 1;
                } else {
                  i = MAX_int32_T;
                }

                b_sprintf(i, r27);
                for (id2Bypass_size = 0; id2Bypass_size < b_trueCount;
                     id2Bypass_size++) {
                  NstTst_tmp_tmp = id0_data[id2Bypass_size];
                  if (NstTst_tmp_tmp > 127) {
                    NstTst_tmp_tmp = 127U;
                  }

                  printf(" %d", (signed char)NstTst_tmp_tmp);
                  fflush(stdout);
                }

                changeConfigFlag_data[c_loop_ub] = false;
                switchFlag_data[c_loop_ub] = false;
                pause(0.05);
              }
            }
          }

