romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
          /* On power and load - End */
          b_ReadVI(Nina219_tmp_tmp, ProjectFlag, prm->brd.pac.VIpacId,
                   Pac2Vid0All_data, Pac2Vid0All_size, N_bat1, N_bat_tmp_tmp_tmp,
                   pIacs758_data, pIacs758_size, Iacs758Flag, kEst_data,
                   kEst_size, Rwire_data, Rwire_size, a__64_data,
                   b_VdebugVec_data, &id2Bypass_size, VbusTest_data, &k_ina219_,
                   Rtot_data, Rtot_size, a__38_data, id2Bypass_data, a__39_data,
                   b_VmV_size, a__40_data, tii_size, VmKp184Test_data,
                   &c_loop_ub, a__42_data, a__4_size, a__72_data,
                   &partialTrueCount, outVI, b_tmp_size, VdebugVec_data,
                   VdebugVec_size, &keepMeas, (double *)&b_dv0, errI2C_size);
          loop_ub = Vbat->size[0];
          for (i = 0; i < loop_ub; i++) {
            ImKp184Test2_data[i + Vbat->size[0] * k_t0] = a__64_data[i];
          }

          Nina219[0] = VbatMat->size[0];
          Nina219[1] = VbatMat->size[1];
          loop_ub = VbatMat->size[1];
          for (i = 0; i < loop_ub; i++) {
            b_loop_ub = Nina219[0];
            for (i1 = 0; i1 < b_loop_ub; i1++) {
              VbatMat_data[(i1 + VbatMat->size[0] * i) + VbatMat->size[0] *
                VbatMat->size[1] * k_t0] = Rtot_data[i1 + Nina219[0] * i];
            }
          }

          Nina219[0] = VbatMat0->size[0];
          Nina219[1] = VbatMat0->size[1];
          loop_ub = VbatMat0->size[1];
          for (i = 0; i < loop_ub; i++) {
            b_loop_ub = Nina219[0];
            for (i1 = 0; i1 < b_loop_ub; i1++) {
              VbatMat0_data[(i1 + VbatMat0->size[0] * i) + VbatMat0->size[0] *
                VbatMat0->size[1] * k_t0] = a__38_data[i1 + Nina219[0] * i];
            }
          }

          Nina219[0] = IbatMat->size[0];
          Nina219[1] = IbatMat->size[1];
          loop_ub = IbatMat->size[1];
          for (i = 0; i < loop_ub; i++) {
            b_loop_ub = Nina219[0];
            for (i1 = 0; i1 < b_loop_ub; i1++) {
              Iacs758_cal_data[(i1 + IbatMat->size[0] * i) + IbatMat->size[0] *
                IbatMat->size[1] * k_t0] = a__39_data[i1 + Nina219[0] * i];
            }
          }

          Nina219[0] = tV->size[0];
          Nina219[1] = tV->size[1];
          loop_ub = tV->size[1];
          for (i = 0; i < loop_ub; i++) {
            b_loop_ub = Nina219[0];
            for (i1 = 0; i1 < b_loop_ub; i1++) {
              tV_data[(i1 + tV->size[0] * i) + tV->size[0] * tV->size[1] * k_t0]
                = a__40_data[i1 + Nina219[0] * i];
            }
          }

          loop_ub = tV1->size[0];
          for (i = 0; i < loop_ub; i++) {
            tV1_data[i + tV1->size[0] * k_t0] = VmKp184Test_data[i];
          }

          /*  read V,I */
          for (c_loop_ub = 0; c_loop_ub < VbusTest_size_idx_0; c_loop_ub++) {
            if (kalmanFlag) {
              VmKp184Test_size[0] = 1;
              loop_ub = tV->size[1];
              VmKp184Test_size[1] = tV->size[1];
              for (i = 0; i < loop_ub; i++) {
                c_VmKp184Test_data[i] = tV_data[(c_loop_ub + tV->size[0] * i) +
                  tV->size[0] * tV->size[1] * k_t0];
              }

              loop_ub = IbatMat->size[1];
              for (i = 0; i < loop_ub; i++) {
                b_VmV_data[i] = Iacs758_cal_data[(c_loop_ub + IbatMat->size[0] *
                  i) + IbatMat->size[0] * IbatMat->size[1] * k_t0];
              }

              loop_ub = VbatMat->size[1];
              for (i = 0; i < loop_ub; i++) {
                I_data[i] = VbatMat_data[(c_loop_ub + VbatMat->size[0] * i) +
                  VbatMat->size[0] * VbatMat->size[1] * k_t0];
              }

              b_CalcStructKalman(&prm->klm.b_struct[c_loop_ub], Ta,
                                 c_VmKp184Test_data, VmKp184Test_size,
                                 b_VmV_data, I_data);
            }
          }

          /* kalman - End */
          for (i = 0; i < 8; i++) {
            VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 3);
          }

          guard5 = false;
          if (vectorAny(VbusTest0_data)) {
            guard5 = true;
          } else {
            for (i = 0; i < 8; i++) {
              VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 4);
            }

            if (vectorAny(VbusTest0_data)) {
              guard5 = true;
            } else {
              for (i = 0; i < 8; i++) {
                VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 1);
              }

              if (vectorAny(VbusTest0_data)) {
                ControlKp184((double *)&N0, a__3_size, (double *)&a__4_data,
                             a__4_size, (double *)&d_tmp_data, b_tmp_size,
                             (double *)&a__16_data, id2Bypass_data);
              } else {
                for (i = 0; i < 8; i++) {
                  VbusTest0_data[i] = (prm->seq.ins[i + (state_k << 3)] == 2);
                }

                if (vectorAny(VbusTest0_data)) {
                  /* read I */
                  d_rand();

                  /* read I */
                  d_rand();
                }
              }
            }
          }

          if (guard5) {
            controlJuntekDPH8920(r30.data, r30.size);
            pause(0.1);
            b_controlJuntekDPH8920(r30.data, r30.size);
          }

          i = SelDual_nm1->size[0] * SelDual_nm1->size[1];
          SelDual_nm1->size[0] = 1;
          SelDual_nm1->size[1] = SelDual->size[1];
          emxEnsureCapacity_real_T(SelDual_nm1, i);
          IshuntTest2_data = SelDual_nm1->data;
          loop_ub = SelDual->size[1];
          for (i = 0; i < loop_ub; i++) {
            IshuntTest2_data[i] = SelDual_data[i];
          }

          /*  BattConfigAct = BattConfigAct(:); */
          if (Nina219_tmp_tmp < 1.0) {
            y->size[0] = 1;
            y->size[1] = 0;
          } else {
            i = y->size[0] * y->size[1];
            y->size[0] = 1;
            y->size[1] = (int)(Nina219_tmp_tmp - 1.0) + 1;
            emxEnsureCapacity_real_T(y, i);
            y_data = y->data;
            loop_ub = (int)(Nina219_tmp_tmp - 1.0);
            for (i = 0; i <= loop_ub; i++) {
              y_data[i] = (double)i + 1.0;
            }
          }

          i = b_y->size[0];
          b_y->size[0] = y->size[1];
          emxEnsureCapacity_real_T(b_y, i);
          b_y_data = b_y->data;
          loop_ub = y->size[1];
          for (i = 0; i < loop_ub; i++) {
            b_y_data[i] = y_data[i];
          }

          loop_ub = y->size[1];
          for (i = 0; i < loop_ub; i++) {
            VecIna219_data[i] = b_y_data[i];
          }

          if (b_size - 1 >= 0) {
            c_end = ipos_size - 1;
          }

          for (k_tstState = 0; k_tstState < b_size; k_tstState++) {
            trueCount = 0;
            partialTrueCount = 0;
            for (loop_ub = 0; loop_ub <= c_end; loop_ub++) {
              if (k_tstState + 1 == ipos_data[loop_ub]) {
                trueCount++;
                p_tmp_data[partialTrueCount] = (signed char)loop_ub;
                partialTrueCount++;
              }
            }

            /* VecIna219_k = find(k_groups == uGroupId); */
            if (N_bat_tmp_tmp_tmp < 1) {
              y->size[0] = 1;
              y->size[1] = 0;
            } else {
              i = y->size[0] * y->size[1];
              y->size[0] = 1;
              y->size[1] = N_bat_tmp_tmp_tmp;
              emxEnsureCapacity_real_T(y, i);
              y_data = y->data;
              loop_ub = N_bat_tmp_tmp_tmp - 1;
              for (i = 0; i <= loop_ub; i++) {
                y_data[i] = (double)i + 1.0;
              }
            }

            if (trueCount == y->size[1]) {
              i = indVperGrp->size[0];
              indVperGrp->size[0] = y->size[1];
              emxEnsureCapacity_real_T(indVperGrp, i);
              VbusTest2_data = indVperGrp->data;
              loop_ub = y->size[1];
              for (i = 0; i < loop_ub; i++) {
                VbusTest2_data[i] = y_data[i] + (VecIna219_data[p_tmp_data[i]] -
                  1.0) * (double)N_bat_tmp_tmp_tmp;
              }
            } else {
              binary_expand_op_3(indVperGrp, y, VecIna219_data, p_tmp_data,
                                 &trueCount, N_bat_tmp_tmp_tmp);
              VbusTest2_data = indVperGrp->data;
            }

            /*          for k_ina219 = 1:Nina219 */
            /*              if SelDual(k_ina219) ~= prm.brd.spi.bypass&&SelDual(k_ina219) ~= prm.brd.spi.disconnect */
            c_tmp_size[0] = trueCount;
            c_tmp_size[1] = d_loop_ub;
            c_tmp_size[2] = d_loop_ub;
            for (i = 0; i < d_loop_ub; i++) {
              for (i1 = 0; i1 < d_loop_ub; i1++) {
                for (i2 = 0; i2 < trueCount; i2++) {
                  n_tmp_data[(i2 + trueCount * i1) + trueCount * d_loop_ub * i] =
                    BattConfigPerIna_data[(((int)VecIna219_data[p_tmp_data[i2]]
                    + b_loop_ub_tmp * i1) + b_loop_ub_tmp * d_loop_ub * i) - 1];
                }
              }
            }

            d_tmp_size[0] = 1;
            d_tmp_size[1] = trueCount;
            for (i = 0; i < trueCount; i++) {
              outVI[i] = SelDual_data[(int)VecIna219_data[p_tmp_data[i]] - 1];
            }

