romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
            e_tmp_size[0] = 1;
            e_tmp_size[1] = trueCount;
            for (i = 0; i < trueCount; i++) {
              o_tmp_data[i] = tLastToggle_data[(int)VecIna219_data[p_tmp_data[i]]
                - 1];
            }

            f_tmp_size[0] = N_bat_tmp_tmp_tmp;
            f_tmp_size[1] = trueCount;
            for (i = 0; i < trueCount; i++) {
              for (i1 = 0; i1 < N_bat_tmp_tmp_tmp; i1++) {
                c_VbusTest_data[i1 + N_bat_tmp_tmp_tmp * i] =
                  BattConfigAct_data[i1 + N_bat_tmp_tmp_tmp * ((int)
                  VecIna219_data[p_tmp_data[i]] - 1)];
              }
            }

            loop_ub = indVperGrp->size[0];
            for (i = 0; i < loop_ub; i++) {
              indVperGrp_data[i] = (int)VbusTest2_data[i];
            }

            partialTrueCount = indVperGrp->size[0];
            loop_ub = indVperGrp->size[0];
            for (i = 0; i < loop_ub; i++) {
              c_VmKp184Test_data[i] = ImKp184Test2_data[(indVperGrp_data[i] +
                Vbat->size[0] * k_t0) - 1];
            }

            i = (int)prm->seq.vth[state_k] - 1;
            showVdiff = d_Esp32StepSwitchToggleCombAll_(outVI, d_tmp_size,
              prm->bat.CutOffChrV[i], prm->bat.CutOffDisV[i], n_tmp_data,
              c_tmp_size, c_VmKp184Test_data, partialTrueCount, trueCount,
              prm->brd.Nbat, prm->brd.spi.disconnect, prm->brd.spi.bypass,
              prm->cnfg.Ttoggle, prm->cnfg.NtoggleDrop, prm->cnfg.minLenIna219,
              prm->seq.pwr, prm->seq.pwr.VthFlag[state_k], tV_data[tV->size[0] *
              tV->size[1] * k_t0], o_tmp_data, e_tmp_size, c_VbusTest_data,
              f_tmp_size, AllBypassPerGroup_data, AllBypassPerGroup_size);
            for (i = 0; i < trueCount; i++) {
              id2Bypass_data[i] = (int)VecIna219_data[p_tmp_data[i]];
            }

            c_loop_ub_tmp = trueCount - 1;
            for (i = 0; i <= c_loop_ub_tmp; i++) {
              changeConfigFlag_data[id2Bypass_data[i] - 1] =
                AllBypassPerGroup_data[i];
            }

            for (i = 0; i < trueCount; i++) {
              id2Bypass_data[i] = (int)VecIna219_data[p_tmp_data[i]] - 1;
            }

            for (i = 0; i < d_loop_ub; i++) {
              for (i1 = 0; i1 < d_loop_ub; i1++) {
                for (i2 = 0; i2 < trueCount; i2++) {
                  BattConfigPerIna_data[(id2Bypass_data[i2] + b_loop_ub_tmp * i1)
                    + b_loop_ub_tmp * d_loop_ub * i] = n_tmp_data[(i2 +
                    trueCount * i1) + trueCount * d_loop_ub * i];
                }
              }
            }

            for (i = 0; i < trueCount; i++) {
              id2Bypass_data[i] = (int)VecIna219_data[p_tmp_data[i]];
            }

            for (i = 0; i <= c_loop_ub_tmp; i++) {
              SelDual_data[id2Bypass_data[i] - 1] = outVI[i];
            }

            for (i = 0; i < trueCount; i++) {
              id2Bypass_data[i] = (int)VecIna219_data[p_tmp_data[i]];
            }

            for (i = 0; i <= c_loop_ub_tmp; i++) {
              switchFlag_data[id2Bypass_data[i] - 1] = showVdiff;
            }

            for (i = 0; i < trueCount; i++) {
              id2Bypass_data[i] = (int)VecIna219_data[p_tmp_data[i]];
            }

            for (i = 0; i <= c_loop_ub_tmp; i++) {
              tLastToggle_data[id2Bypass_data[i] - 1] = o_tmp_data[i];
            }

            Nina219[0] = N_bat_tmp_tmp_tmp;
            Nina219[1] = trueCount;
            for (i = 0; i < trueCount; i++) {
              id2Bypass_data[i] = (int)VecIna219_data[p_tmp_data[i]] - 1;
              loop_ub = Nina219[0];
              for (i1 = 0; i1 < loop_ub; i1++) {
                BattConfigAct_data[i1 + N_bat_tmp_tmp_tmp * id2Bypass_data[i]] =
                  c_VbusTest_data[i1 + Nina219[0] * i];
              }
            }

            /* %squeeze(VbatMat(k_ina219,:,k_t0))',... */
            /* %(:,state_k),... */
          }

          /*          SelDual_nm1 = SelDual; */
          /*          vt_id_state_k = seq.vth(state_k); */
          /*          CutOffChrV_k = CutOffChrV(vt_id_state_k); */
          /*          CutOffDisV_k = CutOffDisV(vt_id_state_k); */
          /*          for k_ina219 = 1:Nina219 */
          /*              if SelDual(k_ina219) ~= prm.brd.spi.bypass&&SelDual(k_ina219) ~= prm.brd.spi.disconnect */
          /*                  [changeConfigFlag(k_ina219),... */
          /*                      BattConfig(k_ina219),... */
          /*                      BattConfigPerIna(k_ina219),... */
          /*                      SelDual(k_ina219),switchFlag(k_ina219),tLastToggle(k_ina219),... */
          /*                      BattConfigAct(k_ina219)] = ... */
          /*                      Esp32StepSwitchToggleCombAll_ESP(... */
          /*                      SelDual(k_ina219),CutOffChrV(seq.vth(state_k)),CutOffDisV(seq.vth(state_k)),... */
          /*                      BattConfigPerIna(k_ina219),... */
          /*                      Vbat((1:N_bat)+(k_ina219-1)*N_bat ,k_t),...%squeeze(VbatMat(k_ina219,:,k_t))',... */
          /*                      1,... */
          /*                      SwitchMat_esp,SwitchMat_esp2,PortSpiRow_esp,PortSpiRow_esp2,minLenIna219,... */
          /*                      ToggleFlag,NtoggleDrop,Ttoggle,tV(1,1,k_t),tLastToggle(k_ina219),N_bat,... */
          /*                      BattConfigAct(k_ina219)); */
          /*                  if ~isempty(BattConfig{k_ina219}) */
          /*                      BattConfig{k_ina219} = BattConfig{k_ina219} + (k_ina219-1)*N_bat; */
          /*                  end */
          /*              end */
          /*          end */
          /*          SelDualVsT(:,k_t) = SelDual; */
          /*  test toggle - End */
          newState = false;
          for (c_loop_ub = 0; c_loop_ub < VbusTest_size_idx_0; c_loop_ub++) {
            if (switchFlag_data[c_loop_ub]) {
              SelDual_data[c_loop_ub] = prm->brd.spi.bypass;

              /* bypass (short) */
              /*  BattConfigPerIna{k_ina219} = prm.brd.spi.bypass; */
              /*  BattConfig{k_ina219}       = prm.brd.spi.bypass; */
            }
          }

