romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
          /*  test all groups */
          AllBypassPerGroup_size[0] = 1;
          AllBypassPerGroup_size[1] = b_size;
          for (id2Bypass_size = 0; id2Bypass_size < b_size; id2Bypass_size++) {
            AllBypassPerGroup_data[id2Bypass_size] = false;
            trueCount = 0;
            for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
              if (b_data[id2Bypass_size] == prm->ser.com.grp[tmp_data[loop_ub]])
              {
                trueCount++;
              }
            }

            i = x->size[0] * x->size[1];
            x->size[0] = 1;
            x->size[1] = trueCount;
            emxEnsureCapacity_boolean_T(x, i);
            b_changeConfigFlag_data = x->data;
            partialTrueCount = 0;
            for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
              if (b_data[id2Bypass_size] == prm->ser.com.grp[tmp_data[loop_ub]])
              {
                b_changeConfigFlag_data[partialTrueCount] =
                  (SelDual_data[loop_ub] == prm->brd.spi.bypass);
                partialTrueCount++;
              }
            }

            showVdiff = true;
            b_trueCount = 1;
            exitg2 = false;
            while ((!exitg2) && (b_trueCount <= x->size[1])) {
              if (!b_changeConfigFlag_data[b_trueCount - 1]) {
                showVdiff = false;
                exitg2 = true;
              } else {
                b_trueCount++;
              }
            }

            if (showVdiff) {
              trueCount = 0;
              partialTrueCount = 0;
              for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                i4 = b_data[id2Bypass_size];
                i = prm->ser.com.grp[tmp_data[loop_ub]];
                if (i4 == i) {
                  trueCount++;
                  q_tmp_data[partialTrueCount] = (signed char)loop_ub;
                  partialTrueCount++;
                }
              }

              SelDual_nm1_size[0] = 1;
              SelDual_nm1_size[1] = trueCount;
              for (i = 0; i < trueCount; i++) {
                SelDual_nm1_data[i] = (IshuntTest2_data[q_tmp_data[i]] == 0.0);
              }

              b_SelDual_nm1_data.data = &SelDual_nm1_data[0];
              b_SelDual_nm1_data.size = &SelDual_nm1_size[0];
              b_SelDual_nm1_data.allocatedSize = 2;
              b_SelDual_nm1_data.numDimensions = 2;
              b_SelDual_nm1_data.canFreeData = false;
              if (b_any(&b_SelDual_nm1_data)) {
                AllBypassPerGroup_data[id2Bypass_size] = true;
                prm->seq.ins[id2Bypass_size + (state_k << 3)] = 0;
                for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                  if (b_data[id2Bypass_size] == prm->
                      ser.com.grp[tmp_data[loop_ub]]) {
                    SelDual_data[loop_ub] = prm->brd.spi.disconnect;
                  }
                }
              } else {
                trueCount = 0;
                partialTrueCount = 0;
                for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                  i4 = b_data[id2Bypass_size];
                  i = prm->ser.com.grp[tmp_data[loop_ub]];
                  if (i4 == i) {
                    trueCount++;
                    r_tmp_data[partialTrueCount] = (signed char)loop_ub;
                    partialTrueCount++;
                  }
                }

                SelDual_nm1_size[0] = 1;
                SelDual_nm1_size[1] = trueCount;
                for (i = 0; i < trueCount; i++) {
                  SelDual_nm1_data[i] = (IshuntTest2_data[r_tmp_data[i]] == 1.0);
                }

                c_SelDual_nm1_data.data = &SelDual_nm1_data[0];
                c_SelDual_nm1_data.size = &SelDual_nm1_size[0];
                c_SelDual_nm1_data.allocatedSize = 2;
                c_SelDual_nm1_data.numDimensions = 2;
                c_SelDual_nm1_data.canFreeData = false;
                if (b_any(&c_SelDual_nm1_data)) {
                  for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                    if (b_data[id2Bypass_size] == prm->
                        ser.com.grp[tmp_data[loop_ub]]) {
                      SelDual_data[loop_ub] = 1.5;
                    }
                  }

                  IchargePhase2t = IchargePhase2_tmp_tmp;
                } else {
                  trueCount = 0;
                  partialTrueCount = 0;
                  for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                    i4 = b_data[id2Bypass_size];
                    i = prm->ser.com.grp[tmp_data[loop_ub]];
                    if (i4 == i) {
                      trueCount++;
                      s_tmp_data[partialTrueCount] = (signed char)loop_ub;
                      partialTrueCount++;
                    }
                  }

                  SelDual_nm1_size[0] = 1;
                  SelDual_nm1_size[1] = trueCount;
                  for (i = 0; i < trueCount; i++) {
                    SelDual_nm1_data[i] = (IshuntTest2_data[s_tmp_data[i]] ==
                      1.5);
                  }

                  d_SelDual_nm1_data.data = &SelDual_nm1_data[0];
                  d_SelDual_nm1_data.size = &SelDual_nm1_size[0];
                  d_SelDual_nm1_data.allocatedSize = 2;
                  d_SelDual_nm1_data.numDimensions = 2;
                  d_SelDual_nm1_data.canFreeData = false;
                  if (b_any(&d_SelDual_nm1_data)) {
                    IchargePhase2t -= prm->bat.dIphase2;
                    if (IchargePhase2t < prm->bat.minIphase2) {
                      for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                        if (b_data[id2Bypass_size] == prm->
                            ser.com.grp[tmp_data[loop_ub]]) {
                          SelDual_data[loop_ub] = 1.6;
                        }
                      }

                      IchargePhase2t = IchargePhase2_tmp_tmp;
                    } else {
                      for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                        if (b_data[id2Bypass_size] == prm->
                            ser.com.grp[tmp_data[loop_ub]]) {
                          SelDual_data[loop_ub] = 1.5;
                        }
                      }
                    }
                  } else {
                    trueCount = 0;
                    partialTrueCount = 0;
                    for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                      i4 = b_data[id2Bypass_size];
                      i = prm->ser.com.grp[tmp_data[loop_ub]];
                      if (i4 == i) {
                        trueCount++;
                        t_tmp_data[partialTrueCount] = (signed char)loop_ub;
                        partialTrueCount++;
                      }
                    }

                    SelDual_nm1_size[0] = 1;
                    SelDual_nm1_size[1] = trueCount;
                    for (i = 0; i < trueCount; i++) {
                      SelDual_nm1_data[i] = (IshuntTest2_data[t_tmp_data[i]] ==
                        1.6);
                    }

                    e_SelDual_nm1_data.data = &SelDual_nm1_data[0];
                    e_SelDual_nm1_data.size = &SelDual_nm1_size[0];
                    e_SelDual_nm1_data.allocatedSize = 2;
                    e_SelDual_nm1_data.numDimensions = 2;
                    e_SelDual_nm1_data.canFreeData = false;
                    if (b_any(&e_SelDual_nm1_data)) {
                      AllBypassPerGroup_data[id2Bypass_size] = true;
                      prm->seq.ins[id2Bypass_size + (state_k << 3)] = 0;
                      for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                        if (b_data[id2Bypass_size] == prm->
                            ser.com.grp[tmp_data[loop_ub]]) {
                          SelDual_data[loop_ub] = prm->brd.spi.disconnect;
                        }
                      }
                    }
                  }
                }
              }
            }
          }

          showVdiff = true;
          b_trueCount = 1;
          exitg2 = false;
          while ((!exitg2) && (b_trueCount <= AllBypassPerGroup_size[1])) {
            if (!AllBypassPerGroup_data[b_trueCount - 1]) {
              showVdiff = false;
              exitg2 = true;
            } else {
              b_trueCount++;
            }
          }

          guard5 = false;
          if (showVdiff || ((V_dis_all < prm->ins.prm.jun.minVjuntekInput) &&
                            (prm->seq.VminDisFlag[state_k] != 0.0F))) {
            guard5 = true;
          } else {
            i = x->size[0] * x->size[1];
            x->size[0] = 1;
            x->size[1] = SelDual->size[1];
            emxEnsureCapacity_boolean_T(x, i);
            b_changeConfigFlag_data = x->data;
            loop_ub = SelDual->size[1];
            for (i = 0; i < loop_ub; i++) {
              b_changeConfigFlag_data[i] = (SelDual_data[i] ==
                prm->brd.spi.disconnect);
            }

            showVdiff = true;
            b_trueCount = 1;
            exitg2 = false;
            while ((!exitg2) && (b_trueCount <= x->size[1])) {
              if (!b_changeConfigFlag_data[b_trueCount - 1]) {
                showVdiff = false;
                exitg2 = true;
              } else {
                b_trueCount++;
              }
            }

            if (showVdiff) {
              guard5 = true;
            }
          }

          if (guard5) {
            state_k++;
            newState = true;
          }

          if (state_k + 1 > prm->seq.Nst) {
            /* size(seq.mod,2) */
            keepMeas = false;
          } else if (newState) {
            for (id2Bypass_size = 0; id2Bypass_size < b_size; id2Bypass_size++)
            {
              for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                if (b_data[id2Bypass_size] == prm->ser.com.grp[tmp_data[loop_ub]])
                {
                  SelDual_data[loop_ub] = prm->seq.chr[id2Bypass_size + (state_k
                    << 3)];
                }
              }

              for (loop_ub = 0; loop_ub <= end_tmp; loop_ub++) {
                if (b_data[id2Bypass_size] == prm->ser.com.grp[tmp_data[loop_ub]])
                {
                  switchFlag_data[loop_ub] = true;
                }
              }
            }
          }

          /*  decision - End */
          k_t++;
          k_t0++;
          while (!(toc() - toc00 >= prm->run.dt)) {
          }

          keepMeas = (((errI2C_size[0] == 0) || (errI2C_size[1] == 0)) &&
                      keepMeas);
          if (k_t == prm->run.Nt) {
            keepMeas = false;
          } else {
            b_trueCount = tV1->size[0];
            loop_ub = tV1->size[0];
            for (i = 0; i < loop_ub; i++) {
              c_VbusTest_data[i] = (tV1_data[i + tV1->size[0] * k_t0] >
                                    prm->run.MaxTime);
            }

            if (ifWhileCond(c_VbusTest_data, b_trueCount)) {
              keepMeas = false;
            }
          }

          if (k_t0 + 1 == N_bitCnfg) {
            t2_data = datetime_datetime();
            datetime_datevec(t2_data, dateVec);
            d_tmp_data = rt_roundd_snf(dateVec[0]);
            if (d_tmp_data < 2.147483648E+9) {
              if (d_tmp_data >= -2.147483648E+9) {
                i = (int)d_tmp_data;
              } else {
                i = MIN_int32_T;
              }
            } else if (d_tmp_data >= 2.147483648E+9) {
              i = MAX_int32_T;
            } else {
              i = 0;
            }

