romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
            d_tmp_data = rt_roundd_snf(dateVec[1]);
            if (d_tmp_data < 2.147483648E+9) {
              if (d_tmp_data >= -2.147483648E+9) {
                i1 = (int)d_tmp_data;
              } else {
                i1 = MIN_int32_T;
              }
            } else if (d_tmp_data >= 2.147483648E+9) {
              i1 = MAX_int32_T;
            } else {
              i1 = 0;
            }

            d_tmp_data = rt_roundd_snf(dateVec[2]);
            if (d_tmp_data < 2.147483648E+9) {
              if (d_tmp_data >= -2.147483648E+9) {
                i2 = (int)d_tmp_data;
              } else {
                i2 = MIN_int32_T;
              }
            } else if (d_tmp_data >= 2.147483648E+9) {
              i2 = MAX_int32_T;
            } else {
              i2 = 0;
            }

            d_tmp_data = rt_roundd_snf(dateVec[3]);
            if (d_tmp_data < 2.147483648E+9) {
              if (d_tmp_data >= -2.147483648E+9) {
                i3 = (int)d_tmp_data;
              } else {
                i3 = MIN_int32_T;
              }
            } else if (d_tmp_data >= 2.147483648E+9) {
              i3 = MAX_int32_T;
            } else {
              i3 = 0;
            }

            d_tmp_data = rt_roundd_snf(dateVec[4]);
            if (d_tmp_data < 2.147483648E+9) {
              if (d_tmp_data >= -2.147483648E+9) {
                c_loop_ub_tmp = (int)d_tmp_data;
              } else {
                c_loop_ub_tmp = MIN_int32_T;
              }
            } else if (d_tmp_data >= 2.147483648E+9) {
              c_loop_ub_tmp = MAX_int32_T;
            } else {
              c_loop_ub_tmp = 0;
            }

            d_tmp_data = rt_roundd_snf(dateVec[5]);
            if (d_tmp_data < 2.147483648E+9) {
              if (d_tmp_data >= -2.147483648E+9) {
                id2Bypass_size = (int)d_tmp_data;
              } else {
                id2Bypass_size = MIN_int32_T;
              }
            } else if (d_tmp_data >= 2.147483648E+9) {
              id2Bypass_size = MAX_int32_T;
            } else {
              id2Bypass_size = 0;
            }

            m_sprintf(i, i1, i2, i3, c_loop_ub_tmp, id2Bypass_size, r29);

            /* char(dateStr); */
            i = (int)(Nina219_tmp_tmp * (double)N_bat_tmp_tmp_tmp);
            i1 = c_Vbat->size[0] * c_Vbat->size[1];
            c_Vbat->size[0] = i;
            c_Vbat->size[1] = N_bitCnfg;
            emxEnsureCapacity_int8_T(c_Vbat, i1);
            Vbat_data = c_Vbat->data;
            c_loop_ub_tmp = i * N_bitCnfg;
            for (i1 = 0; i1 < c_loop_ub_tmp; i1++) {
              Vbat_data[i1] = 0;
            }

            i1 = Vbat->size[0] * Vbat->size[1];
            Vbat->size[0] = c_Vbat->size[0];
            Vbat->size[1] = c_Vbat->size[1];
            emxEnsureCapacity_real_T(Vbat, i1);
            ImKp184Test2_data = Vbat->data;
            for (i1 = 0; i1 < c_loop_ub_tmp; i1++) {
              ImKp184Test2_data[i1] = 0.0;
            }

            i1 = IbatMat->size[0] * IbatMat->size[1] * IbatMat->size[2];
            IbatMat->size[0] = (int)Nina219_tmp_tmp;
            IbatMat->size[1] = N_bat_tmp_tmp_tmp;
            IbatMat->size[2] = N_bitCnfg;
            emxEnsureCapacity_real_T(IbatMat, i1);
            Iacs758_cal_data = IbatMat->data;
            end = loop_ub_tmp * N_bitCnfg;
            i1 = VbatMat->size[0] * VbatMat->size[1] * VbatMat->size[2];
            VbatMat->size[0] = (int)Nina219_tmp_tmp;
            VbatMat->size[1] = N_bat_tmp_tmp_tmp;
            VbatMat->size[2] = N_bitCnfg;
            emxEnsureCapacity_real_T(VbatMat, i1);
            VbatMat_data = VbatMat->data;
            i1 = VbatMat0->size[0] * VbatMat0->size[1] * VbatMat0->size[2];
            VbatMat0->size[0] = (int)Nina219_tmp_tmp;
            VbatMat0->size[1] = N_bat_tmp_tmp_tmp;
            VbatMat0->size[2] = N_bitCnfg;
            emxEnsureCapacity_real_T(VbatMat0, i1);
            VbatMat0_data = VbatMat0->data;
            for (i1 = 0; i1 < end; i1++) {
              Iacs758_cal_data[i1] = 0.0;
              VbatMat_data[i1] = 0.0;
              VbatMat0_data[i1] = 0.0;
            }

            i1 = c_Vbat->size[0] * c_Vbat->size[1];
            c_Vbat->size[0] = i;
            c_Vbat->size[1] = N_bitCnfg;
            emxEnsureCapacity_int8_T(c_Vbat, i1);
            Vbat_data = c_Vbat->data;
            for (i = 0; i < c_loop_ub_tmp; i++) {
              Vbat_data[i] = 0;
            }

            i = tV1->size[0] * tV1->size[1];
            tV1->size[0] = c_Vbat->size[0];
            tV1->size[1] = c_Vbat->size[1];
            emxEnsureCapacity_real_T(tV1, i);
            tV1_data = tV1->data;
            for (i = 0; i < c_loop_ub_tmp; i++) {
              tV1_data[i] = 0.0;
            }

            i = tV->size[0] * tV->size[1] * tV->size[2];
            tV->size[0] = (int)Nina219_tmp_tmp;
            tV->size[1] = N_bat_tmp_tmp_tmp;
            tV->size[2] = N_bitCnfg;
            emxEnsureCapacity_real_T(tV, i);
            tV_data = tV->data;
            for (i = 0; i < end; i++) {
              tV_data[i] = 0.0;
            }

            /*  Ishunt = zeros(Nina219,N_bat,Nt); */
            k_t0 = 0;
          }

          /*      catch ME */
          /*          keepMeas = 0; */
          /*          disp(['Error:',ME.message]) */
          /*          disp(ME.stack) */
          /*      end */
        }
      }

      /*  End function */
      i = (int)prm->brd.Nina219;
      for (c_loop_ub = 0; c_loop_ub < i; c_loop_ub++) {
        switch (ProjectFlag) {
         case 2:
          /* esp32 */
          break;

         case 3:
          /* esp32 ser */
          writePortToSpi4RowMask_ser(disConAll);
          break;
        }
      }

      t2_data = datetime_datetime();
      datetime_datevec(t2_data, dateVec);
      d_tmp_data = rt_roundd_snf(dateVec[0]);
      if (d_tmp_data < 2.147483648E+9) {
        if (d_tmp_data >= -2.147483648E+9) {
          i = (int)d_tmp_data;
        } else {
          i = MIN_int32_T;
        }
      } else if (d_tmp_data >= 2.147483648E+9) {
        i = MAX_int32_T;
      } else {
        i = 0;
      }

