romanetsky/ev-olution-server/ev-olution-server/src/Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.cpp
      d_tmp_data = rt_roundd_snf(dateVec[1]);
      if (d_tmp_data < 2.147483648E+9) {
        if (d_tmp_data >= -2.147483648E+9) {
          i1 = (int)d_tmp_data;
        } else {
          i1 = MIN_int32_T;
        }
      } else if (d_tmp_data >= 2.147483648E+9) {
        i1 = MAX_int32_T;
      } else {
        i1 = 0;
      }

      d_tmp_data = rt_roundd_snf(dateVec[2]);
      if (d_tmp_data < 2.147483648E+9) {
        if (d_tmp_data >= -2.147483648E+9) {
          i2 = (int)d_tmp_data;
        } else {
          i2 = MIN_int32_T;
        }
      } else if (d_tmp_data >= 2.147483648E+9) {
        i2 = MAX_int32_T;
      } else {
        i2 = 0;
      }

      d_tmp_data = rt_roundd_snf(dateVec[3]);
      if (d_tmp_data < 2.147483648E+9) {
        if (d_tmp_data >= -2.147483648E+9) {
          i3 = (int)d_tmp_data;
        } else {
          i3 = MIN_int32_T;
        }
      } else if (d_tmp_data >= 2.147483648E+9) {
        i3 = MAX_int32_T;
      } else {
        i3 = 0;
      }

      d_tmp_data = rt_roundd_snf(dateVec[4]);
      if (d_tmp_data < 2.147483648E+9) {
        if (d_tmp_data >= -2.147483648E+9) {
          c_loop_ub_tmp = (int)d_tmp_data;
        } else {
          c_loop_ub_tmp = MIN_int32_T;
        }
      } else if (d_tmp_data >= 2.147483648E+9) {
        c_loop_ub_tmp = MAX_int32_T;
      } else {
        c_loop_ub_tmp = 0;
      }

      d_tmp_data = rt_roundd_snf(dateVec[5]);
      if (d_tmp_data < 2.147483648E+9) {
        if (d_tmp_data >= -2.147483648E+9) {
          id2Bypass_size = (int)d_tmp_data;
        } else {
          id2Bypass_size = MIN_int32_T;
        }
      } else if (d_tmp_data >= 2.147483648E+9) {
        id2Bypass_size = MAX_int32_T;
      } else {
        id2Bypass_size = 0;
      }

      m_sprintf(i, i1, i2, i3, c_loop_ub_tmp, id2Bypass_size, r18);

      /* char(dateStr); */
      /*  ind0 = strfind((dateStr),':'); */
      /*  dateStr(ind0) = '-'; */
    }
  } else {
    /* CalibrateBaordFlag */
  }

  emxFree_char_T(&r29);
  emxFree_char_T(&d_Vcharge0);
  emxFree_char_T(&r28);
  emxFree_char_T(&c_Vcharge0);
  emxFree_char_T(&r27);
  emxFree_char_T(&r26);
  emxFree_char_T(&f_IchargeAct);
  emxFree_char_T(&r25);
  emxFree_char_T(&e_IchargeAct);
  emxFree_char_T(&d_IchargeAct);
  emxFree_char_T(&c_IchargeAct);
  emxFree_char_T(&r24);
  emxFree_char_T(&r23);
  emxFree_char_T(&r22);
  emxFree_char_T(&r21);
  emxFree_char_T(&r20);
  emxFree_char_T(&b_IchargeAct);
  emxFree_char_T(&IchargeAct);
  emxFree_char_T(&r19);
  emxFree_char_T(&b_Vcharge0);
  emxFree_char_T(&Vcharge0);
  emxFree_char_T(&r18);
  emxFree_char_T(&r17);
  emxFree_char_T(&dv0);
  emxFree_char_T(&r16);
  emxFree_char_T(&r15);
  emxFree_char_T(&r14);
  emxFree_char_T(&meanIbrd0);
  emxFree_char_T(&r13);
  emxFree_char_T(&r12);
  emxFree_char_T(&b_IshuntTest2);
  emxFree_char_T(&b_k_Ttest);
  emxFree_char_T(&d_prm);
  emxFree_char_T(&b_VbusTest2);
  emxFree_char_T(&b_vSumMax);
  emxFree_char_T(&k_Ttest);
  emxFree_char_T(&r11);
  emxFree_char_T(&r10);
  emxFree_char_T(&c_prm);
  emxFree_char_T(&r9);
  emxFree_char_T(&r8);
  emxFree_char_T(&b_prm);
  emxFree_char_T(&r7);
  emxFree_char_T(&vSumMax);
  emxFree_char_T(&b_VmKp184Test_data);
  emxFree_char_T(&b_k_bat);
  emxFree_char_T(&r6);
  emxFree_char_T(&b_VbusTest_data);
  emxFree_char_T(&k_bat);
  emxFree_char_T(&r5);
  emxFree_char_T(&r4);
  emxFree_uint8_T(&r3);
  emxFree_boolean_T(&b_changeConfigFlag);
  emxFree_uint8_T(&r2);
  emxFree_real_T(&b_y);
  emxFree_real_T(&r1);
  emxFree_boolean_T(&x);
  emxFree_real_T(&y);
  emxFree_int8_T(&c_Vbat);
  emxFree_int8_T(&b_Vbat);
  emxFree_real_T(&indVperGrp);
  emxFree_real_T(&r);
  emxFree_real_T(&Vbus_cal_bat_00);
  emxFree_real_T(&Ishunt_cal_bat_00);
  emxFree_real_T(&SelDual_nm1);
  emxFree_boolean_T(&changeConfigFlag);
  emxFree_boolean_T(&switchFlagHelp);
  emxFree_boolean_T(&switchFlag);
  emxFree_real_T(&tLastToggle);
  emxFree_real_T(&SelDualHelp);
  emxFree_real_T(&SelDual);
  emxFree_real_T(&tV);
  emxFree_real_T(&tV1);
  emxFree_real_T(&VbatMat0);
  emxFree_real_T(&VbatMat);
  emxFree_real_T(&IbatMat);
  emxFree_real_T(&Vbat);
  emxFree_real_T(&VbitInsMeas);
  emxFree_real_T(&meanIbrd);
  emxFree_real_T(&Ibrd);
  emxFree_real_T(&Vbrd);
  emxFree_real_T(&Iacs758_cal);
  emxFree_real_T(&ImKp184Test2);
  emxFree_real_T(&IshuntTest2);
  emxFree_real_T(&VbusTest2);
}

/*
 * File trailer for Chr_Dis_kp184_ka6005P_juntek_esp32ser_20240229.c
 *
 * [EOF]
 */
